Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Define the major artifacts that manifest implementation of your components. Indicate how they are deployed on hardware nodes, their inter-dependencies and communication protocols.
ar: حدد القطع الأثرية الرئيسية التي تظهر تنفيذ مكوناتك. وضّح كيف يتم نشرها على عقد الأجهزة ، والاعتماد المتبادل وبروتوكولات الاتصال الخاصة بها.
bn: আপনার উপাদানগুলির বাস্তবায়ন প্রকাশ করে এমন প্রধান নিদর্শনগুলি সংজ্ঞায়িত করুন। হার্ডওয়্যার নোড, তাদের আন্তঃ-নির্ভরতা এবং যোগাযোগ প্রোটোকলগুলিতে তারা কীভাবে মোতায়েন করা হয় তা নির্দেশ করে।
ca: Definiu els artefactes principals que manifesten la implementació dels vostres components. Indiqueu com es despleguen en nodes de maquinari, les seves inter dependències i protocols de comunicació.
cs: Definujte hlavní artefakty, které jsou projevem implementace vašich komponent. Uveďte, jak jsou nasazeny na hardwarových uzlech, jejich vzájemné závislosti a komunikační protokoly.
fi: Määrittele tärkeimmät artefaktit, jotka osoittavat komponenttien toteutuksen. Ilmoita, kuinka ne on otettu käyttöön laitteistosolmuissa, niiden keskinäiset riippuvuudet ja viestintäprotokollat.
fr: Définissez les principaux éléments qui témoignent de la mise en œuvre de vos composants. Indiquez comment ils sont déployés sur les nœuds matériels, leurs interdépendances et les protocoles de communication.
hi: अपने घटकों के कार्यान्वयन को दर्शाने वाले प्रमुख विरूपण-साक्ष्य को परिभाषित करें। संकेत दें कि उन्हें हार्डवेयर नोड्स, उनकी अंतर-निर्भरता और संचार प्रोटोकॉल पर कैसे तैनात किया जाता है।
hr: Definiraj glavne artefakte koji manifestiraju implementaciju tvojih komponenti. Naznači kako se implementiraju na hardverske čvorove, njihove međuovisnosti i komunikacijske protokole.
id: Tentukan artefak utama yang mewujudkan implementasi komponen Anda. Tunjukkan bagaimana mereka digunakan pada node perangkat keras, antar-ketergantungan dan protokol komunikasi mereka.
ja: コンポーネントの実装を示す主要な成果物を定義します。ハードウェア ノード、相互依存関係、および通信プロトコルに展開する方法を示します。
ko: 구성 요소의 구현을 나타내는 주요 아티팩트를 정의합니다. 하드웨어 노드, 종속성 간 및 통신 프로토콜에 배포되는 방법을 나타냅니다.
nl: Definieer de belangrijkste artefacten die de implementatie van uw componenten manifesteren. Geef aan hoe ze worden geïmplementeerd op hardwareknooppunten, hun onderlinge afhankelijkheden en communicatieprotocollen.
pt_br: Defina os principais artefatos que manifestam a implementação de seus componentes. Indique como eles são implantados em nós de hardware, suas interdependências e protocolos de comunicação.
sv: Definiera de viktigaste artefakterna som manifesterar implementering av dina komponenter. Ange hur de distribueras på maskinvarunoder, deras beroenden och kommunikationsprotokoll.
tr: Bileşenlerinizin uygulanmasını gösteren başlıca yapıtları tanımlayın. Donanım düğümlerine nasıl dağıtıldıklarını, karşılıklı bağımlılıklarını ve iletişim kurallarını belirtin.
uk: Визначте основні артефакти, які демонструють реалізацію ваших компонентів. Вкажіть, як вони розгортаються на апаратних вузлах, їх взаємозалежності та протоколи зв’язку.

source: String
ar: سلسلة
bn: স্ট্রিং
ca: Corda
cs: Řetězec
fi: Merkkijono
fr: Chaîne de caractères
hi: स्ट्रिंग
hr: Znakovni niz
id: Rangkaian
ja: 糸
ko: 문자열
nl: Tekenreeks
ru: Строка
sv: Sträng
tr: Dizge
uk: Рядок

source: Date
ar: تاريخ
bn: তারিখ
ca: Datar
cs: Datum
fi: Päiväys
hi: तिथि
hr: Datum
id: Tanggal
ja: 日付
ko: 날짜
nl: Datum
pt_br: Data
ru: Дата
sv: Datum
tr: Tarih
uk: Дата

source: Export
ar: يصدر
bn: রপ্তানি
ca: Exportar
cs: Exportovat
fi: Vie
fr: Exporter
hi: निर्यात
hr: Izvezi
id: Ekspor
it: Esporta
ja: 輸出
ko: 내보내기
nl: Exporteren
pt_br: Exportar
ru: Экспортировать
tr: Dışa Aktar
uk: Експорт

source: Tools
ar: أدوات
bn: সরঞ্জাম
ca: Eines
cs: Nástroje
fi: Työkalut
fr: Outils
hi: औजार
hr: Alati
id: Peralatan
it: Strumenti
ja: ツール
ko: 도구
nl: Gereedschap
pt_br: Ferramentas
ru: Инструменты
sv: Arbetsredskap
tr: Araçlar
uk: Інструменти

source: Open a Model
ar: افتح نموذجًا
bn: একটি মডেল খুলুন
ca: Obrir un model
cs: Otevřete model
fi: Avaa malli
fr: Ouvrir un modèle
hi: मॉडल खोलें
hr: Otvori model
id: Buka Model
it: Apri un modello Gaphor
ja: モデルを開く
ko: 모델 열기
nl: Model openen
pt_br: Abrir um Modelo
ru: Открыть Модель
sv: Öppna en modell
tr: Model Aç
uk: Відкрийте модель

source: Switch to {name}?
cs: Přepnout na {name}?
fi: Vaihdetaanko käyttäjäksi {name}?
fr: Passer à {name} ?
hi: {name} पर जाएं?
hr: Prijeći na {name}?
it: Cambiare a {name}?
nl: Wisselen naar {name}?
pt_br: Trocar para {name}?
ru: Переключиться на {name}?
tr: {name} geçilsin mi?
uk: Перейти на {name}?

source: {name} is already opened. Do you want to switch to the opened window instead?
cs: {name} je již otevřeno. Chcete se místo toho přepnout do otevřeného okna?
fi: {name} on jo avattu. Haluatko sen sijaan vaihtaa avoinna olevaan ikkunaan?
fr: {name} est déjà ouvert. Voulez-vous passer à la fenêtre ouverte à la place ?
hi: {name} पहले से ही खुली हुई है। क्या आप इसके बजाय खुली हुई विंडो पर जाना चाहते हैं?
hr: Datoteka {name} je već otvorena. Želiš li umjesto toga prijeći na otvoreni prozor?
it: {name} è stato già aperto. Vuoi passare alla finestra aperta?
nl: {name} is reeds geopend. Wilt u in plaats hiervan naar het geopende venster wisselen?
pt_br: {name} já está aberto. Você deseja alternar para a janela aberta?
ru: {name} уже открыт. Вы хотите переключиться на открытое окно вместо этого?
tr: {name} zaten açık. Bunun yerine açık pencereye geçmek ister misiniz?
uk: {name} уже відкрито. Бажаєте замість цього перейти до відкритого вікна?

source: Open Again
cs: Otevřít znovu
fi: Avaa uudelleen
fr: Ouvrir à nouveau
hi: पुनः खोलें
hr: Ponovo otvori
it: Apri di nuovo
nl: Opnieuw openen
pt_br: Abrir novamente
ru: Открыть Снова
tr: Tekrar Aç
uk: Знову відкрити

source: Switch
cs: Přepínač
fi: Vaihda
fr: Commutateur
hi: बदले
hr: Prijeđi
it: Cambia
nl: Wisselen
pt_br: Trocar
ru: Переключиться
tr: Geç
uk: Перейти

source: Show in Model Browser
fi: Näytä malliselaimessa
fr: Afficher dans le navigateur de modèles
hi: मॉडल ब्राउज़र में दिखाएं
hr: Prikaži u pregledniku modela
it: Mostra nel browser dei modelli
nl: Tonen in model­browser
pt_br: Mostrar no Navegador de Modelo
ru: Показать в обзоре моделей
tr: Model Browser'da Göster
uk: Показати в браузері моделей

source: Zoom Out
ar: تصغير
bn: জুম আউট করুন
ca: Redueix
cs: Oddálit
fi: Loitonna
fr: Zoom arrière
hi: छोटा करें
hr: Umanji
id: Perkecil
it: Zoom Indietro
ja: ズームアウト
ko: 축소
nl: Uitzoomen
pt_br: Ampliar -
ru: Отдалить
sv: Zooma ut
tr: Uzaklaştır
uk: Зменшити Масштаб

source: Reset Zoom
cs: Aktuální velikost
fi: Todellinen koko
fr: Réinitialiser le zoom
hi: जूम रीसेट करें
hr: Resetiraj zumiranje
it: Reimposta zoom
nl: Ware grootte
pt_br: Redefinir ampliação
ru: Реальный Размер
tr: Gerçek Boyut
uk: Скинути масштаб

source: Zoom In
ar: تكبير
bn: জুম ইন করুন
ca: Amplia
cs: Přiblížit
fi: Lähennä
fr: Zoom avant
hi: बड़ा करें
hr: Uvećaj
id: Perbesar
it: Zoom Avanti
ja: ズームインする
ko: 확대
nl: Inzoomen
pt_br: Ampliar +
ru: Приблизить
sv: Zooma in
tr: Yakınlaştır
uk: Збільшити Масштаб

source: Selected element is not in present in this diagram.
fi: Valittu elementti ei ole läsnä tässä kaaviossa.
fr: L'élément sélectionné n'est pas présent sur ce diagramme.
hr: Odabrani element se ne može prikazati u ovom dijagramu.
it: L'elemento selezionato non è presente in questo diagramma.
ru: Выбранный элемент не может быть представлен на этой диаграмме.
uk: Вибраний елемент відсутній на цій діаграмі.

source: Open a Diagram
cs: Otevřít diagram
fi: Avaa kaavio
fr: Ouvrir un Diagramme
hi: आरेख खोलें
hr: Otvori dijagram
it: Apri un diagramma
nl: Diagram openen
pt_br: Abrir um Diagrama
ru: Открыть Диаграмму
tr: Diyagram Aç
uk: Відкрийте діаграму

source: Open a diagram from the model browser, or create a new diagram from the New diagram menu.
cs: Otevřít diagram z prohlížeče modelů nebo vytvořit nový diagram z nabídky Nový diagram.
fi: Avaa kaavio malliselaimesta tai luo uusi kaavio Uusi kaavio -valikosta.
fr: Ouvrez un diagramme à partir du navigateur de modèle, ou créer un nouveau diagramme à partir du menu Nouveau diagramme.
hi: मॉडल ब्राउज़र से आरेख खोलें, या नया आरेख मेनू से नया आरेख बनाएं।
hr: Otvori dijagram iz preglednika modela ili stvori novi dijagram iz izbornika „Novi dijagram”.
it: Apri un diagramma dal browser dei modelli, oppure crea un nuovo diagramma dal menu Nuovo diagramma.
nl: Open een diagram vanuit de model-browser, of maak een nieuw diagram aan via het menu ‘Nieuw diagram’.
pt_br: Abra um diagrama no navegador de modelo ou crie um novo diagrama no menu Novo diagrama.
ru: Откройте диаграмму из панели обзора моделей или создайте новую используя пункт меню «Новая диаграмма».
tr: Model tarayıcısından bir diyagram açın, ya da yeni diyagram menüsünden yeni diyagram oluşturun.
uk: Відкрийте діаграму в браузері моделей або створити нову діаграму з меню Нова діаграма.

source: No item selected
ar: لم يتم تحديد أي عنصر
bn: কোনও আইটেম নির্বাচিত নেই
ca: No s'ha seleccionat cap element
cs: Není vybrána žádná položka
fi: Ei kohdetta valittuna
fr: Aucun élément sélectionné
hi: कोई आइटम चयनित नहीं
hr: Nijedan element nije odabran
id: Tidak ada item yang dipilih
it: Nessun elemento selezionato
ja: アイテムが選択されていません
ko: 선택한 항목 없음
nl: Geen element geselecteerd
pt_br: Nenhum item selecionado
ru: Ничего не выбрано
sv: Inget objekt markerat
tr: Öge seçilmedi
uk: Елемент не вибрано

source: Show Tips
ar: عرض نصائح
bn: টিপস দেখান
ca: Mostra els consells
cs: Zobrazit tipy
fi: Näytä vinkit
fr: Afficher les conseils
hi: सुझाव दिखाएं
hr: Prikaži savjete
id: Tampilkan Tips
it: Mostra suggerimenti
ja: ヒントを表示する
ko: 팁 표시
nl: Tips tonen
pt_br: Mostrar dicas
ru: Показывать Советы
sv: Visa tips
tr: İpuçlarını Göster
uk: Показати поради

source: Add a model element from the tool box (bottom left) to the diagram. Here you will see its properties appear.
cs: Přidejte do diagramu prvek modelu z okna nástrojů (vlevo dole). Zde se zobrazí jeho vlastnosti.
fi: Lisää mallielementti työkalulaatikosta (vasemmalta alhaalta) kaavioon. Näet sen ominaisuudet tässä.
fr: Ajoutez un élément de modèle au diagramme à partir de la boîte à outils (en bas à gauche). Vous verrez alors apparaître ses propriétés.
hi: टूल बॉक्स (नीचे बाएं) से मॉडल तत्व को आरेख में जोड़ें। यहाँ आप इसके गुण देखेंगे।
hr: Dodaj element modela iz kutije alata (dolje lijevo) u dijagram. Ovdje će se pojaviti njegova svojstva.
it: Aggiungi un elemento di modello dagli strumenti (in basso a sinistra) nel diagramma. Qui vedrai apparire le sue proprietà.
nl: Voeg een modelelement uit de gereedschapskist (linksonder) toe aan het diagram. De eigenschappen zullen hier verschijnen.
pt_br: Adicione um elemento de modelo a partir da caixa de ferramentas (parte inferior esquerda) ao diagrama. Aqui você verá suas propriedades aparecerem.
ru: Добавьте элемент модели из панели инструментов (внизу слева) на диаграмму. Здесь вы увидите его свойства.
tr: Araç kutusundan (sol alt) diyagrama bir model elemanı ekleyin. Burada özelliklerinin göründüğünü göreceksiniz.
uk: Додайте до діаграми елемент моделі з панелі інструментів (унизу ліворуч). Тут ви побачите його властивості.

source: This pane can be hidden by clicking the pane icon in the header.
cs: Toto podokno lze skrýt kliknutím na ikonu podokna v záhlaví.
fi: Tämä paneeli on mahdollista piilottaa napsauttamalla paneelikuvaketta otsakkeesta.
fr: Ce volet peut être masqué en cliquant sur l'icône du volet dans l'en-tête.
hi: इस फलक को शीर्षलेख में फलक आइकन पर क्लिक करके छुपाया जा सकता है।
hr: Ova se ploča može se sakriti pritiskom ikone ploče u zaglavlju.
it: Questo pannello può essere nascosto cliccando l'icona del pannello nella barra della finestra qui sopra.
nl: Dit paneel kan worden verborgen door te klikken op het paneelpictogram in de titelbalk.
pt_br: Este painel pode ser ocultado clicando no ícone do painel no cabeçalho.
ru: Эту панель можно скрыть, щёлкнув мышью по значку панели в заголовке.
tr: Bu bölme, başlıktaki bölme simgesine tıklanarak gizlenebilir.
uk: Цю панель можна приховати, клацнувши піктограму панелі в заголовку.

source: <b>Tip:</b> Most elements in the toolbox have a keyboard shortcut (e.g. "c" for Class). Tool selection only works from the diagram. If a tool does not get selected, click on the diagram once (so it's focused) and then hit the shortcut key.
cs: <b>Tip:</b> Většina prvků ve skupině nástrojů má klávesovou zkratku (např. "c" pro Třída). Výběr nástroje funguje pouze z diagramu. Pokud se nástroj nevybere, klikněte jednou na diagram (aby se objevil focus) a pak stiskněte klávesovou zkratku.
fi: <b>Vinkki:</b> Useimmilla elementeillä on pikanäppäin (esim. "c" luokalle - Class). Työkaluvalinta toimii vain kaaviossa. Jos työkalu ei tule valituksi, napsauta kaaviota kerran (niin että se on kohdistettuna) ja paina sitten pikanäppäintä.
fr: <b>Astuce :</b> La plupart des éléments de la boîte à outils ont un raccourci clavier (par exemple, « c » pour Classe). La sélection des outils ne fonctionne qu'à partir du diagramme. Si un outil n'est pas sélectionné, cliquez une fois sur le diagramme (pour qu'il soit centré), puis appuyez sur la touche de raccourci.
hi: <b>सुझाव:</b> टूलबॉक्स में अधिकांश तत्वों के लिए कीबोर्ड शॉर्टकट होता है (उदाहरण के लिए क्लास के लिए "c")। टूल चयन केवल आरेख से ही काम करता है। यदि कोई टूल चयनित नहीं होता है, तो आरेख पर एक बार क्लिक करें (ताकि वह फ़ोकस हो जाए) और फिर शॉर्टकट कुंजी दबाएं।
hr: <b>Savjet:</b> većina elemenata u kutiji alata ima tipkovne prečace (npr. „c” za klasu). Biranje alata radi samo u dijagramu. Ako se alat ne odabere, pritisni jednom na dijagram (tako da postane aktivan), a zatim pritisni tipku prečaca.
it: <b>Suggerimento:</b> molti elementi negli strumenti hanno una scorciatoia da tastiera (es. "c" per la Classe). La selezione dello strumento funziona solo nel diagramma. Se uno strumento non viene selezionato, clicca sul diagramma una volta (così che è in focus) e premi il tasto di scorciatoia.
nl: <b>Tip:</b> De meeste elementen in de gereedschapskist hebben een sneltoets (bijv. ‘C’ voor Klasse). Gereedschapsselectie werkt alleen vanuit het diagram. Als gereedschap niet wordt geselecteerd, klik dan éénmaal op het diagram (zodat deze gefocust is) en druk dan op de sneltoets.
pt_br: <b>Dica:</b> A maioria dos elementos na caixa de ferramentas tem um atalho de teclado (por exemplo, "c" para a Classe). A seleção de ferramentas só funciona a partir do diagrama. Se uma ferramenta não estiver selecionada, clique no diagrama uma vez (de forma que esteja em foco) e, em seguida, pressione a tecla de atalho.
ru: <b>Совет:</b> Большинство элементов на панели инструментов имеют сочетание клавиш (например, "c" для Class). Выбор инструмента работает только на диаграмме. Если инструмент не выбирается, щелкните на диаграмме один раз (чтобы она была сфокусирована), а затем нажмите сочетание клавиш.
tr: <b>İpucu:</b> Araç kutusundaki çoğu ögenin klavye kısayolu vardır (örneğin, Sınıf için "c"). Araç seçimi sadece diyagramdan çalışır. Bir araç seçilmezse, diyagrama bir kez tıklayın (böylece odaklanır) ve ardından kısayol tuşuna basın.
uk: <b>Порада:</b> більшість елементів на панелі інструментів мають комбінацію клавіш (наприклад, "c" для Class). Вибір інструменту працює лише за схемою. Якщо інструмент не вибрано, клацніть діаграму один раз (щоб вона була в фокусі), а потім натисніть клавішу швидкого доступу.

source: <b>Tip:</b> To search for an element in the model browser (top left), select an element in the model browser and start typing. A search box will automatically appear.
cs: <b>Tip:</b> Chcete-li vyhledat prvek v prohlížeči modelů (vlevo nahoře), vyberte prvek v prohlížeči modelů a začněte psát. Automaticky se zobrazí vyhledávací pole.
fi: <b>Vinkki:</b> Etsiäseksi elementtiä malliselaimessa (vasemmassa yläkulmassa), valitse elementti malliselaimesta ja aloita kirjoittaminen. Hakukenttä ilmestyy näkyviin automaattisesti.
fr: <b>Astuce:</b> Pour rechercher un élément dans le navigateur de modèle (en haut à gauche), sélectionnez un élément et commencez à taper. Une boîte de recherche s'affiche automatiquement.
hi: <b>सुझाव:</b> मॉडल ब्राउज़र (ऊपर बाईं ओर) में किसी तत्व को खोजने के लिए, मॉडल ब्राउज़र में किसी तत्व का चयन करें और टाइप करना शुरू करें। एक खोज बॉक्स अपने आप दिखाई देगा।
hr: <b>Savjet:</b> Za traženje elementa u pregledniku modela (gore lijevo), odaberi element u pregledniku modela i počni tipkati. Automatski će se pojaviti polje pretrage.
it: <b>Suggerimento:</b> per cercare un elemento nel browser degli elementi (in alto a sinistra), seleziona un elemento nel browser e inizia a scrivere. Una barra di ricerca apparirà automaticamente.
nl: <b>Tip:</b> Om een element te zoeken in de model-browser (linksboven), selecteert u een element in de model-browser en begint u te typen. Er verschijnt automatisch een zoekvak.
pt_br: <b>Dica:</b> Para procurar um elemento no navegador de modelo (à esquerda), selecione um elemento no navegador de modelo e comece a digitar. Uma caixa de pesquisa aparecerá automaticamente.
ru: <b>Совет:</b> Чтобы найти элемент на панели обзора моделей (вверху слева), выберите элемент и начните вводить текст. Поле поиска появится автоматически.
tr: <b>İpucu:</b> Model tarayıcıda (sol üst) bir ögeyi aramak için model tarayıcıda bir öğe seçip yazmaya başlayın. Otomatik olarak bir arama kutusu görünecektir.
uk: <b>Порада:</b> щоб шукати елемент у браузері моделі (верхній лівий кут), виберіть елемент у браузері моделі та почніть вводити текст. Автоматично з’явиться вікно пошуку.

source: Help improve Gaphor
fi: Auta parantamaan Gaphoria
fr: Contribuer à l'amélioration de Gaphor
hr: Pomogni poboljšati Gaphor
it: Aiuta a migliorare Gaphor
ru: Помочь улучшить Gaphor
uk: Допоможіть покращити Gaphor

source: Gaphor is free and open source software, written by devoted volunteers.
fi: Gaphor on vapaa, avoimen lähdekoodin ohjelmisto, jonka omistautuneet vapaaehtoiset ovat kehittäneet.
fr: Gaphor est un logiciel libre et gratuit, écrit par des bénévoles dévoués.
hr: Gaphor je besplatan softver otvorenog koda, koji su napisali predani volonteri.
it: Gaphor è un software free e open source, scritto da volontari devoti.
ru: Gaphor — это бесплатное программное обеспечение с открытым исходным кодом, написанное преданными своему делу добровольцами.
uk: Gaphor — це безкоштовне програмне забезпечення з відкритим кодом, створене відданими волонтерами.

source: There are many ways to help make Gaphor better: write a blog post, translate Gaphor into your language, report bugs, or suggest new features. Join us in improving Gaphor!
fi: Voit auttaa parantamaan Gaphoria monin eri tavoin: bloggaa, käännä Gaphor kielellesi, ilmoita ongelmista tai ehdota uusia ominaisuuksia. Tule mukaan!
fr: Vous pouvez contribuer à l'amélioration de Gaphor de nombreuses façons : écrire un article de blog, le traduire dans votre langue, signaler des bugs ou suggérer de nouvelles fonctionnalités. Rejoignez-nous pour contribuer à l'amélioration de Gaphor !
hr: Postoji mnogo načina da pomogneš poboljšati Gaphor: napiši objavu na blogu, prevedi Gaphor na svoj jezik, prijavi greške ili predloži nove funkcije. Pridruži nam se kako bismo poboljšali Gaphor!
it: Ci sono molto modi per aiutare a migliorare Gaphor: scrivere un post su un blog, tradurre Gaphor nella tua lingua, segnalare bug, o suggerire nuove funzionalità. Unisciti a noi nel migliorare Gaphor!
ru: Есть много способов помочь сделать Gaphor лучше: написать сообщение в блоге, перевести Gaphor на свой язык, сообщить об ошибках или предложить новые функции. Присоединяйтесь к нам в улучшении Gaphor!
uk: Є багато способів допомогти покращити Gaphor: написати допис у блозі, перекласти Gaphor на вашу мову, повідомити про помилки або запропонувати нові функції. Приєднуйтесь до нас у вдосконаленні Gaphor!

source: Visit <a href="https://gaphor.org/contribute/">gaphor.org</a> for more information.
fi: Lisätietoja osoitteessa <a href="https://gaphor.org/contribute/">gaphor.org</a>.
fr: Visitez <a href="https://gaphor.org/contribute/">gaphor.org</a> pour plus d'information.
hr: Za više informacija posjeti <a href="https://gaphor.org/contribute/">gaphor.org</a>.
it: Visita <a href="https://gaphor.org/contribute/">gaphor.org</a> per maggiori informazioni.
ru: Для получения дополнительной информации посетите <a href="https://gaphor.org/contribute/">gaphor.org</a>.
uk: Для отримання додаткової інформації відвідайте <a href="https://gaphor.org/contribute/">gaphor.org</a>.

source: Editor
ar: محرر
bn: সম্পাদক
fi: Muokkain
fr: Éditeurs
hr: Uređivač
ja: 編集者
ko: 편집기 표시/숨김
ru: Редактор
sv: Redaktör
uk: Редактор

source: Styling
fi: Tyylitys
fr: Style
hr: Stiliziranje
it: Stile
ru: Стайлинг
uk: Стайлінг

source: Style Sheet
ar: ورقة الأنماط
bn: স্টাইল শীট
ca: Full d'estil
cs: Předloha stylů
fi: Tyylisivu
fr: Feuille de style
hi: स्टाइल शीट
hr: Stilski predložak
id: Lembar Gaya
it: Foglio di stile
ja: スタイルシート
ko: 스타일 시트
nl: Stijlblad
pt_br: Folha de Estilos
ru: Таблица Стилей
sv: Formatmall
tr: Biçim Dosyası
uk: Таблиця стилів

source: Diagram Language
fi: Kaavion kieli
fr: Langage de diagramme
hi: आरेख भाषा
hr: Jezik dijagrama
it: Linguaggio diagramma
nl: Diagram­taal
pt_br: Idioma do diagrama
ru: Язык диаграммы
tr: Diyagram Dili
uk: Мова діаграм

source: The (natural) language used in this model.
fi: Tässä mallissa käytettävä (puhuttu) kieli.
fr: La langue (naturelle) utilisée dans ce modèle.
hi: इस मॉडल में प्रयुक्त (प्राकृतिक) भाषा।
hr: Jezik koji se koristi u ovom modelu.
it: Il linguaggio (naturale) usato in questo modello.
nl: De (natuurlijke) taal gebruikt in dit model.
pt_br: O idioma (natural) usado neste modelo.
ru: Язык (естественный), используемый в этой модели.
tr: Doğal dil bu modelde kullanılmıştır.
uk: (Природна) мова, яка використовується в цій моделі.

source: CSS Editor
fi: CSS-muokkain
fr: Éditeur CSS
hr: Uređivač CSS-a
it: Editor CSS
nl: CSS-bewerker
ru: Редактор CSS
uk: Редактор CSS

source: CSS nodes of focused item
fi: Kohdistetun tietueen CSS-solmut
fr: Nœuds CSS de l'élément mis en évidence
hi: फ़ोकस किए गए आइटम के CSS नोड्स
hr: CSS čvorovi fokusiranog elementa
it: Nodi CSS dell'elemento in focus
nl: CSS-knopen van gefocust item
pt_br: Nós CSS do item em foco
ru: CSS-узлы элемента в фокусе
tr: Odaklanılan ögenin CSS düğümleri
uk: Вузли CSS виділеного елемента

source: 🔗 <a href="https://docs.gaphor.org/en/latest/style_sheets.html">Style sheets in Gaphor</a>
cs: 🔗 <a href="https://docs.gaphor.org/en/latest/style_sheets.html">Styly v Gaphoru</a>
fi: 🔗 <a href="https://docs.gaphor.org/en/latest/style_sheets.html">Tyylisivut Gaphorissa</a>
fr: 🔗 <a href="https://docs.gaphor.org/en/latest/style_sheets.html ">Les feuilles de style dans Gaphor</a>
hi: 🔗 <a href="https://docs.gaphor.org/en/latest/style_sheets.html">गैफोर में स्टाइल शीट</a>
hr: 🔗 <a href="https://docs.gaphor.org/en/latest/style_sheets.html">Stilski predlošci u Gaphoru</a>
it: 🔗 <a href="https://docs.gaphor.org/en/latest/style_sheets.html">Fogli di stile su Gaphor</a>
nl: 🔗 <a href="https://docs.gaphor.org/en/latest/style_sheets.html">Stijlbladen in Gaphor</a>
pt_br: 🔗 <a href="https://docs.gaphor.org/en/latest/style_sheets.html">Folhas de estilos no Gaphor</a>
ru: 🔗 <a href="https://docs.gaphor.org/en/latest/style_sheets.html">Таблицы стилей в Gaphor</a>
tr: 🔗 <a href="https://docs.gaphor.org/en/latest/style_sheets.html">Gaphorʼda biçem sayfaları</a>
uk: 🔗 <a href="https://docs.gaphor.org/en/latest/style_sheets.html">Таблиці стилів у Gaphor</a>

source: Merge Models
cs: Sloučit modely
fi: Yhdistä mallit
fr: Fusionner les modèles
hi: मॉडल मर्ज करें
hr: Sjedini modele
it: Unisci modelli
nl: Modellen samenvoegen
pt_br: Mesclar Modelos
ru: Слияние моделей
tr: Modelleri Birleştir
uk: Злиття моделей
