Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: States
ar: تنص على
bn: রাষ্ট্রসমূহ
ca: Estats
cs: Stavy
fi: Tilat
fr: États
hi: अवस्थाएं
hr: Stanja
id: negara bagian
it: Stati
ja: 列国
ko: 상태(복수)
nl: Staten
pt_br: Estados
ru: Состояния
sv: Stater
tr: Durumlar
uk: Держави

source: Initial Pseudostate
ar: الأولي الكاذبة
bn: প্রাথমিক pseudostate
ca: Pseudoestat inicial
cs: Počáteční pseudostav
fi: Alustava pseudotila
fr: Pseudo-état initial
hi: प्रारंभिक छद्म अवस्था
hr: Početno pseudostanje
id: Pseudostat Awal
it: Pseudostato iniziale
ja: 初期擬似状態
ko: 초기 의사상태
nl: Initiële pseudostaat
pt_br: Pseudoestado Inicial
ru: Начальное Псевдосостояние
sv: Inledande pseudostate
tr: İlk Sözde Durum
uk: Початковий псевдостан

source: Final State
ar: الحالة النهائية
bn: চূড়ান্ত অবস্থা
ca: Estat final
cs: Konečný stav
fi: Viimeinen tila
fr: État final
hi: अंतिम अवस्था
hr: Završno stanje
id: Keadaan Akhir
it: Stato Finale
ja: 最終状態
ko: 최종 상태
nl: Eindstaat
pt_br: Estado Final
ru: Финальное псевдосостояние
sv: Slutligt tillstånd
tr: Son Durum
uk: Кінцевий стан

source: Transition
ar: انتقال
bn: অবস্থান্তর
ca: Transició
cs: Přechod
fi: Transitio
hi: अवस्थांतर
hr: Prijelaz
id: Transisi
it: Transizione
ja: 遷移
ko: 전이
nl: Overgang
pt_br: Transição
ru: Переход
sv: Övergång
tr: Geçiş
uk: Перехід

source: Shallow History Pseudostate
cs: Pseudostatní mělká historie
fi: Matala historian pseudotila
fr: Historique superficiel du Pseudo-état
hi: उथला इतिहास छद्म अवस्था
hr: Pseudostanje plitke povijesti
it: Cronologia pseudostato superficiale
nl: Ondiepe geschiedenispseudostaat
pt_br: Pseudoestado de História Rasa
ru: Недавнее Историческое Псевдосостояние
tr: Sığ Geçmiş Sözde Durumu
uk: Дрібна історія Псевдодержава

source: Deep History Pseudostate
cs: Pseudostát s hlubokou historií
fi: Syvä historian pseudotila
fr: Historique Profond du Pseudo-état
hi: गहरा इतिहास छद्म अवस्था
hr: Pseudostanje duboke povijesti
it: Cronologia pseudostato profonda
nl: Diepe geschiedenispseudostaat
pt_br: Pseudoestado de História Profunda
ru: Давнее Историческое Псевдосостояние
tr: Derin Geçmiş Sözde Durumu
uk: Глибока історія Псевдодержава

source: Join Pseudostate
cs: Připojit se k pseudostátu
fi: Liity pseudotilaan
fr: Rejoindre le pseudo-état
hi: छद्म अवस्था संयुक्त करें
hr: Pseudostanje pridruživanja
it: Pseudostato unito
nl: Samenvoegings-pseudostaat
pt_br: Unir Pseudoestado
ru: Псевдосостояние Объединения
tr: Birleşim Sözde Durumu
uk: Приєднуйтесь до Псевдодержави

source: Fork Pseudostate
cs: Pseudostát vidlice
fi: Luo haarukka pseudotilasta
fr: Diverger le Pseudo-état
hi: छद्म अवस्था विभाजन
hr: Pseudostanje grananja
it: Pseudostato fork
nl: Afsplitsings-pseudostaat
pt_br: Bifurcar Pseudoestado
ru: Псевдосостояние Раздвоения
tr: Çatal Sözde Durumu
uk: Вилка Псевдостан

source: Junction Pseudostate
cs: Pseudostát Junction
fi: Liitoksen pseudotila
fr: Jonction de Pseudo-état
hi: छद्म अवस्था संगम
hr: Pseudostanje razdvajanja
it: Pseudostato di giunzione
nl: Kruisings-pseudostaat
pt_br: Pseudoestado de Junção
ru: Псевдосостояние Соединения
tr: Kavşak Sözde Durumu
uk: Псевдостан з'єднання

source: Choice Pseudostate
cs: Volba pseudostátu
fi: Valinta pseudotila
fr: Choix de Pseudo-état
hi: छद्म अवस्था पसंद
hr: Pseudostanje izbora
it: Pseudostato di scelta
nl: Keuze-pseudostaat
pt_br: Pseudoestado de Escolha
ru: Псевдосостояние Выбора
tr: Seçim Sözde Durumu
uk: Псевдостан вибору

source: Entry Point Pseudostate
cs: Vstupní bod Pseudostát
fi: Sisääntulopiste pseudotila
fr: Point d'Éntrée du Pseudo-état
hi: प्रवेश बिंदु छद्म अवस्था
hr: Pseudostanje ulazne točke
it: Pseudostato del punto di ingresso
nl: Beginpunt-pseudostaat
pt_br: Pseudoestado de Ponto de Entrada
ru: Точка Входа
tr: Girdi Noktası Sözde Durumu
uk: Псевдостан точки входу

source: Exit Point Pseudostate
cs: Výstupní bod Pseudostát
fi: Poistumispiste pseudotila
fr: Sortir du Pseudo-état
hi: निकास बिंदु छद्म अवस्था
hr: Pseudostanje izlazne točke
it: Pseudostato del punto di uscita
nl: Eindpunt-pseudostaat
pt_br: Pseudoestado de Ponto de Saída
ru: Точка Выхода
tr: Çıkış Durumu Sözde Durumu
uk: Псевдостан точки виходу

source: Terminate Pseudostate
cs: Ukončit pseudostát
fi: Lopeta pseudotila
fr: Terminer le Pseudo-État
hi: छद्म अवस्था को समाप्त करें
hr: Prekid pseudostanja
it: Pseudostato terminante
nl: Terminatie-pseudostaat
pt_br: Terminar Pseudoestado
ru: Узел Завершения
tr: Sonlandır Sözde Durumu
uk: Припинити Псевдостан

source: extend
ar: تمديد
bn: নির্বাচিত
ca: estendre
cs: rozšířit
fi: laajenna
fr: étendre
hi: विस्तार करें
hr: proširi
id: memperpanjang
it: estendi
ja: 延ばす
ko: 뻗치다
nl: uitbreiden
pt_br: estende
ru: расширить
sv: förlänga
tr: genişlet
uk: розширити

source: include
ar: تضمن
bn: অন্তর্ভুক্ত
ca: incloure
cs: zahrnout
fi: sisällytä
fr: inclure
hi: शामिल करें
hr: uključi
id: termasuk
it: includi
ja: 含める
ko: 포함하다
nl: opnemen
pt_br: inclui
ru: включить
sv: inbegripa
tr: ekle
uk: включити

source: Use Cases
ar: استخدم حالات
bn: কেসগুলি ব্যবহার করুন
ca: Casos d'ús
cs: Případy použití
fi: Käyttötapaukset
fr: Cas d'Utilisation
hi: उदाहरण
hr: Slučajevi primjene
id: Gunakan Kasus
it: Casi d'uso
ja: ユースケース
ko: 유즈케이스
nl: Doeleinden
pt_br: Casos de Uso
ru: Прецеденты
sv: Använd lådor
tr: Kullanım Örnekleri
uk: Випадки використання

source: Use case
ar: حالة الاستخدام
bn: কেস ব্যবহার করুন
ca: Cas d'ús
cs: Případ použití
fi: Käyttötapaus
fr: Cas d'utilisation
hi: उदाहरण
hr: Slučaj primjene
id: Gunakan kasus
it: Caso d'uso
ja: ユースケース
ko: 유즈케이스
nl: Doeleinde
pt_br: Caso de uso
ru: Прецедент
sv: Användningsfall
tr: Kullanım örneği
uk: Випадок використання

source: Include
ar: تضمن
bn: অন্তর্ভুক্ত
ca: Inclou
cs: Zahrnout
fi: Sisällytä
fr: Inclure
hi: शामिल करें
hr: Uključi
id: Termasuk
it: Includi
ja: 含める
ko: 포함
nl: Opnemen
pt_br: Inclui
ru: Включение
sv: Inbegripa
tr: Ekle
uk: Включати

source: Extend
ar: تمديد
bn: নির্বাচিত
ca: Extèn
cs: Rozšířit
fi: Laajenna
fr: Étendre
hi: बढ़ाएं
hr: Proširi
id: Memperpanjang
it: Estendi
ja: 延ばす
ko: 확장
nl: Uitbreiden
pt_br: Estende
ru: Расширение
sv: Förlänga
tr: Genişlet
uk: Розширити

source: Presentation
fi: Esittely
fr: Présentation
hr: Prezentacija
it: Presentazione
nl: Presentatie
ru: Презентация
uk: Презентація

source: class
fi: luokka
fr: Classe
hr: klasa
it: classe
nl: klasse
ru: класс
uk: клас

source: Model Element
fi: Mallin elementti
fr: Élément de modèle
hr: Element modela
it: Elemento modello
ru: Элемент Модели
uk: Елемент моделі

source: Style
ar: نمط
bn: শৈলী
ca: Estil
cs: Styl
fi: Tyyli
hi: शैली
hr: Stil
id: Gaya
it: Stile
ja: スタイル
ko: 모양새
nl: Stijl
pt_br: Estilo
ru: Стиль
sv: Stil
tr: Biçim
uk: Стиль

source: Rectilinear
ar: مستقيم
bn: রেক্টিলিনিয়ার
ca: Rectilini
cs: Přímočarý
fi: Suorakulmainen
fr: Rectiligne
hi: सीधारेखीय
hr: Ravna crta
id: Seperti garis lurus
it: Rettilineo
ja: 直線
ko: 직선
nl: Hoekig
pt_br: Retilíneo
ru: Прямолинейный
sv: Rätlinjig
tr: Doğrusal
uk: Прямолінійний

source: Flip orientation
ar: اتجاه الوجه
bn: ফ্লিপ ওরিয়েন্টেশন
ca: Inverteix l'orientació
cs: Převrácená orientace
fi: Käännä suunta
fr: Inverser l'orientation
hi: अभिविन्यास पलटें
hr: Preokreni smjer
id: Orientasi balik
it: Orientamento di ribaltamento
ja: フリップの向き
ko: 뒤집기 방향
nl: Orientatie wisselen
pt_br: Inverter orientação
ru: Отразить ориентацию
sv: Vänd orientering
tr: Yönü çevir
uk: Перевернути орієнтацію

source: Note
fi: Muistiinpano
hi: नोट
hr: Napomena
it: Nota
nl: Opmerking
pt_br: Nota
ru: Примечание
tr: Not
uk: Примітка

source: Created By
cs: Vytvořil
fi: Luonut
fr: Créer par
hi: निर्मित द्वारा
hr: Autor
it: Creato da
nl: Gemaakt door
pt_br: Criado por
ru: Создано
tr: Oluşturan
uk: Створено

source: Website
cs: Web
fi: Verkkosivusto
fr: Site Web
hi: वेबसाइट
hr: Web stranica
it: Sito web
pt_br: Site
ru: Веб-сайт
tr: İnternet sitesi
uk: Веб-сайт

source: Revision
cs: Revize
fi: Versio
fr: Révision
hi: संशोधन
hr: Revizija
it: Revisione
nl: Herziening
pt_br: Revisão
ru: Ревизия
tr: Gözden Geçirme
uk: Ревізія

source: License
cs: Licence
fi: Lisenssi
fr: Licence
hi: लाइसेंस
hr: Licenca
it: Licenza
nl: Licentie
pt_br: Licença
ru: Лицензия
tr: Lisans
uk: Ліцензія

source: Created On
cs: Vytvořeno
fi: Luotu
fr: Créé Sur
hi: तिथि निर्मित
hr: Stvoreno
it: Creato il
nl: Gemaakt op
pt_br: Criado em
ru: Создано на
tr: Oluşturulma
uk: Дата створення

source: Updated On
cs: Aktualizováno
fi: Päivitetty
fr: Mise à jour Sur
hi: तिथि अद्यतित
hr: Aktualizirano
it: Aggiornato il
nl: Bijgewerkt op
pt_br: Atualizado em
ru: Обновлено
tr: Güncelleme Tarihi
uk: Оновлений на

source: Select picture...
fi: Valitse kuva…
fr: Sélectionner l'image...
hi: चित्र चुनें…
hr: Odaberi sliku …
it: Seleziona immagine...
nl: Afbeelding selecteren…
pt_br: Selecionar imagem...
ru: Выберите изображение...
tr: Resim seç...
uk: Виберіть зображення...

source: Set default size
fi: Aseta oletuskoko
fr: Définir la taille par défaut
hi: तयशुदा आकार निर्धारित करें
hr: Postavi standardnu veličinu
it: Imposta dimensione predefinita
nl: Standaard­grootte instellen
pt_br: Definir tamanho padrão
ru: Размер по умолчанию
tr: Öntanımlı boyut seç
uk: Установити розмір за замовчуванням

source: Internals of focused item
fi: Kohdistetun kohteen sisäosat
fr: Données internes de l'élément ciblé
hr: Interni podaci fokusiranog elementa
it: Interni dell'elemento in focus
nl: CSS-knopen van gefocust item
ru: Внутренние части элемента в фокусе
uk: Внутрішні елементи вибраного елемента

source: No focused item.
fi: Ei kohdistettua tietuetta.
fr: Pas de point focalisé.
hi: कोई केंद्रित आइटम नहीं।
hr: Nijedan element nije u fokusu.
it: Nessun elemento in focus.
nl: Geen gefocust item.
pt_br: Nenhum item em foco.
ru: Нет элемента в фокусе.
tr: Odaklanılan öge yok.
uk: Немає виділеного елемента.

source: Style Editor
fi: Tyylimuokkain
fr: Éditeur de Style
hr: Uređivač stilova
it: Editor di stili
nl: Stijl editor
ru: Редактор стилей
uk: Редактор стилів

source: Open Style Editor
fi: Avaa tyylimuokkain
fr: Ouvrir l'Éditeur de Style
hr: Otvori uređivač stilova
it: Apri editor di stili
nl: Open stijl editor
ru: Открыть редактор стилей
uk: Відкрийте редактор стилів

source: Border Radius
fi: Reunan säde
fr: Rayon de la Bordure
hr: Radijus okvira
it: Raggio del bordo
nl: Rand radius
ru: Радиус рамки
uk: Радіус кордону

source: Color
fi: Väri
fr: Couleur
hr: Boja
it: Colore
nl: Kleur
ru: Цвет
uk: Колір

source: Background Color
fi: Taustaväri
fr: Couleur d'Arrière-plan
hr: Boja pozadine
it: Colore sfondo
nl: Achtergrondkleur
ru: Цвет фона
uk: Колір фону

source: Text Color
fi: Tekstin väri
fr: Couleur du texte
hr: Boja teksta
it: Colore testo
nl: Tekstkleur
ru: Цвет текста
uk: Колір тексту

source: Add to Style Sheet
fi: Lisää tyylisivuun
fr: Ajouter à la Feuille de style
hr: Dodaj u stilski predložak
it: Aggiungi al foglio dello stile
nl: Toevoegen aan style sheet
ru: Добавить в таблицу стилей
uk: Додати до таблиці стилів

source: Element can’t be represented on a diagram.
cs: Prvek nelze znázornit na diagramu.
fi: Elementtiä ei voi esittää kaaviossa.
fr: L'élément ne peut pas être représenté sur un diagramme.
hi: तत्व को आरेख पर प्रदर्शित नहीं किया जा सकता।
hr: Element se ne može prikazati u dijagramu.
it: L'elemento non può essere rappresentato in un diagramma.
nl: Element kan niet worden vertegenwoordigd in een diagram.
pt_br: O elemento não pode ser representado em um diagrama.
ru: Элемент не можт быть представлен на диаграмме.
tr: Öğe bir diyagramda gösterilemez.
uk: Елемент не може бути представлений на діаграмі.

source: No model file configured for model '{model_name}'.
ar: لم يتم تكوين ملف نموذج للطراز '{model_name}'.
bn: মডেল '{model_name}'-এর জন্য কোনও মডেল ফাইল কনফিগার করা হয়নি।
ca: No s'ha configurat cap fitxer de model per al model "{model_name}".
cs: Pro model '{model_name}' není nakonfigurován žádný soubor modelu.
fi: Mallille '{model_name}' ei ole määritetty mallitiedostoa.
fr: Aucun fichier de modèle n'est configuré pour le modèle "{model_name}".
hi: मॉडल '{model_name}' के लिए कोई मॉडल फाइल विन्यस्त नहीं की गई।
hr: Nijedna datoteka modela nije konfigurirana za model '{model_name}'.
id: Tidak ada file model yang dikonfigurasi untuk model '{model_name}'.
it: Nessun file modello configurato per il modello '{model_name}'.
ja: モデル '{model_name}' 用に構成されたモデル ファイルがありません。
ko: 모델 '{model_name}'에 대해 구성된 모델 파일이 없습니다.
nl: Geen modelbestand geconfigureerd voor model '{model_name}'.
pt_br: Nenhum arquivo de modelo configurado para o modelo '{model_name}'.
ru: Нет файла модели, настроенного для модели '{model_name}'.
sv: Ingen modellfil konfigurerad för modellen {model_name}.
tr: '{model_name}' modeli için yapılandırılan model dosyası yok.
uk: Для моделі не налаштовано файл моделі '{model_name}'.

source: No diagram '{name}' in model '{model_name}' ({model_file}).
ar: لا يوجد رسم تخطيطي '{name}' في النموذج '{model_name}' ({model_file}).
bn: মডেল '{model_name}' ({model_file}) এ কোনও ডায়াগ্রাম নেই '{name}'।
ca: No hi ha cap diagrama "{name}" al model "{model_name}" ({model_file}).
cs: V modelu '{model_name}' ({model_file}) není žádný diagram '{name}'.
fi: Kaaviota '{name}' ei ole mallissa '{model_name}' ({model_file}).
fr: Pas de diagramme '{name}' dans le modèle '{model_name}' ({model_file}).
hi: मॉडल '{model_name}' ({model_file}) में कोई आरेख '{name}' नहीं है।
hr: Nema dijagrama '{name}' u modelu '{model_name}' ({model_file}).
id: Tidak ada diagram '{name}' dalam model '{model_name}' ({model_file}).
it: Nessun diagramma '{name}' nel modello '{model_name}' ({model_file}).
ja: モデル '{model_name}' ({model_file}) に図 '{name}' はありません。
ko: 모델 '{model_name}'({model_file})의 다이어그램 '{name}'이 없습니다.
nl: Geen diagram '{name}' in model '{model_name}' ({model_file}).
pt_br: Sem diagrama '{name}' no modelo '{model_name}' ({model_file}).
ru: Нет диаграммы '{name}' в модели '{model_name}' ({model_file}).
sv: Inget diagram {name} i modellen {model_name} ({model_file}).
tr: '{model_name}' ({model_file}) modelinde '{name}' diyagramı yok.
uk: Немає діаграми "{name}" у моделі "{model_name}" ({model_file}).

source: Auto Layout
cs: Automatické rozvržení
fi: Automaattinen asettelu
fr: Mise en page automatique
hi: स्वचालित अभिन्यास
hr: Automatski raspored
it: Layout automatico
nl: Automatische lay-out
pt_br: Disposição automática
ru: Авторазмещение
tr: Otomatik Yerleşim
uk: Автоматичний макет

source: Auto Layout (orthogonal)
cs: Automatické rozložení (ortogonální)
fi: Automaattinen asettelu (ortogonaalinen)
fr: Mise en page automatique (orthogonale)
hi: स्वचालित अभिन्यास (ऑर्थोगोनल)
hr: Automatski raspored (ortogonalan)
it: Layout automatico (ortogonale)
nl: Automatische lay-out (orthogonaal)
pt_br: Disposição automática (ortogonal)
ru: Авторазмещение (ортогональное)
tr: Otomatik Yerleşim (dikey)
uk: Автоматичний макет (ортогональний)

source: Gaphor Interactive Python Console {version} Type "help" for more information.
ar: وحدة تحكم Gaphor التفاعلية بايثون {version} اكتب "تعليمات" لمزيد من المعلومات.
bn: গ্যাফর ইন্টারেক্টিভ পাইথন কনসোল {version} আরও তথ্যের জন্য "সহায়তা" টাইপ করুন।
ca: Consola Python interactiva Gaphor {version} Escriviu "ajuda" per obtenir més informació.
cs: Interaktivní konzole Gaphor Python {version} Pro více informací zadejte "help".
fi: Gaphorin vuorovaikutteinen Python-konsoli {version} Kirjoita "help" saadaksesi lisätietoja.
fr: Console Python interactive de Gaphor {version} Tapez « help » pour plus d'informations.
hi: गैफोर इंटरएक्टिव पायथन कंसोल {version} अधिक जानकारी के लिए "सहायता" टाइप करें।
hr: Gaphorova interaktivna Python konzola {version} Za daljnje informacije upiši "help" (pomoć).
id: Konsol Python Interaktif Gaphor {version} Ketik "bantuan" untuk informasi lebih lanjut.
it: Console interattiva Python di Gaphor {version} Scrivi "help" per avere più informazioni.
ja: Gaphor インタラクティブ Pythonコンソール {version} 詳細はヘルプを入力してください。
ko: Gaphor 대화형 Python 콘솔 {version} 자세한 내용을 보려면 "도움말"을 입력하십시오.
nl: Gaphor Interactieve Python Console {version} Type "help" voor meer informatie.
pt_br: Console Python Interativo do Gaphor {version} Digite "ajuda" para mais informações.
ru: Интерактивная Python-консоль Gaphor {version} Введите "help" для получения дополнительной информации.
sv: Gaphor interaktiv Python-konsol {version} Skriv "hjälp" för mer information.
tr: Gaphor Etkileşimli Python Uçbirimi {version} Daha fazla bilgi için "help" yazın.
uk: Інтерактивна консоль Gaphor Python {version} Щоб отримати додаткову інформацію, введіть «допомога».

source: Console
ar: وحدة التحكم
bn: কনসোল
ca: Consola
cs: Konzole
fi: Konsoli
hi: कंसोल
hr: Konzola
id: Menghibur
ja: 慰める
ko: 콘솔
ru: Консоль
sv: Konsol
tr: Uçbirim
uk: Консоль

source: Gaphor Console
ar: وحدة التحكم جافور
bn: গ্যাফর কনসোল
ca: Consola Gaphor
cs: Konzole Gaphor
fi: Gaphorin konsoli
fr: Console de Gaphor
hi: गैफोर कंसोल
hr: Gaphor konzola
id: Konsol Gaphor
it: Console di Gaphor
ja: ガファーコンソール
ko: 가포르 콘솔
pt_br: Console do Gaphor
ru: Консоль Gaphor
sv: Gaphor-konsol
tr: Gaphor Uçbirimi
uk: Консоль Gaphor

source: All {ext} Files
ar: جميع الملفات {ext}
bn: সমস্ত {ext} ফাইল
ca: Tots els {ext} fitxers
cs: Všechny soubory {ext}
fi: Kaikki {ext}-tiedostot
fr: Tous les {ext} fichiers
hi: सभी {ext} फाइलें
hr: Sve {ext} datoteke
id: Semua File {ext}
it: Tutti i file {ext}
ja: すべての {ext} ファイル
ko: 파일 총 {ext}개
nl: Alle {ext}-bestanden
pt_br: Todos os arquivos {ext}
ru: Все Файлы {ext}
sv: Alla {ext} Filer
tr: Tüm {ext} Dosyaları
uk: Усі {ext} файли

source: Export as SVG
ar: تصدير كملف SVG
bn: SVG হিসাবে রপ্তানী করুন
ca: Exporta com a SVG
cs: Exportovat jako SVG
fi: Vie SVG-kuvaksi
fr: Exporter en SVG
hi: SVG के रूप में निर्यात करें
hr: Izvezi kao SVG
id: Ekspor sebagai SVG
it: Esporta in SVG
ja: SVG としてエクスポート
ko: SVG로 내보내기
nl: Exporteren als SVG
pt_br: Exportar como SVG
ru: Экспортировать как SVG
sv: Exportera som SVG
tr: SVG Olarak Dışa Aktar
uk: Експортувати як SVG

source: Export diagram as SVG
ar: رسم تخطيطي للتصدير بتنسيق SVG
bn: SVG হিসাবে ডায়াগ্রাম রপ্তানী করুন
ca: Exporta el diagrama com a SVG
cs: Exportovat diagram jako SVG
fi: Vie kaavio SVG-muotoon
fr: Exporter le diagramme en SVG
hi: आरेख को SVG के रूप में निर्यात करें
hr: Izvezi dijagram kao SVG
id: Ekspor diagram sebagai SVG
it: Esporta diagramma in SVG
ja: ダイアグラムを SVG としてエクスポート
ko: 다이어그램을 SVG로 내보내기
nl: Diagram exporteren als SVG
pt_br: Exportar diagrama como SVG
ru: Экспортировать диаграмму как SVG
sv: Exportera diagram som SVG
tr: Diyagramı SVG olarak dışa aktar
uk: Експорт діаграми як SVG

source: Export as PNG
ar: تصدير بصيغة PNG
bn: PNG হিসাবে রপ্তানী করুন
ca: Exporta com a PNG
cs: Exportovat jako PNG
fi: Vie PNG-kuvaksi
fr: Exporter en PNG
hi: PNG के रूप में निर्यात करें
hr: Izvezi kao PNG
id: Ekspor sebagai PNG
it: Esporta in PNG
ja: PNG としてエクスポート
ko: PNG로 수출
nl: Exporteren als PNG
pt_br: Exportar como PNG
ru: Экспортировать как PNG
sv: Exportera som PNG
tr: PNG Olarak Dışa Aktar
uk: Експортувати як PNG

source: Export diagram as PNG
ar: رسم تخطيطي للتصدير بتنسيق PNG
bn: PNG হিসাবে ডায়াগ্রাম রপ্তানী করুন
ca: Exporta el diagrama com a PNG
cs: Exportovat diagram jako PNG
fi: Vie kaavio PNG-muotoon
fr: Exporter le diagramme en PNG
hi: आरेख को PNG के रूप में निर्यात करें
hr: Izvezi dijagram kao PNG
id: Ekspor diagram sebagai PNG
it: Esporta diagramma in PNG
ja: 図を PNG としてエクスポート
ko: PNG로 다이어그램 내보내기
nl: Diagram exporteren als PNG
pt_br: Exportar diagrama como PNG
ru: Экспортировать диаграмму как PNG
sv: Exportera diagram som PNG
tr: Diyagramı PNG olarak dışa aktar
uk: Експорт діаграми як PNG

source: Export as PDF
ar: تصدير كملف PDF
bn: পিডিএফ হিসাবে রপ্তানী করুন
ca: Exporta-ho com a PDF
cs: Exportovat jako PDF
fi: Vie PDF-tiedostoksi
fr: Exporter en PDF
hi: PDF के रूप में निर्यात करें
hr: Izvezi kao PDF
id: Ekspor sebagai PDF
it: Esporta in PDF
ja: PDF としてエクスポート
ko: PDF로 내보내기
nl: Exporteren als PDF
pt_br: Exportar como PDF
ru: Экспортировать как PDF
sv: Exportera som PDF
tr: PDF Olarak Dışa Aktar
uk: Експорт як PDF

source: Export diagram as PDF
ar: رسم تخطيطي للتصدير بتنسيق PDF
bn: পিডিএফ হিসাবে ডায়াগ্রাম রপ্তানী করুন
ca: Exporta el diagrama com a PDF
cs: Exportovat diagram jako PDF
fi: Vie kaavio PDF-muotoon
fr: Exporter le diagramme en PDF
hi: आरेख को PDF के रूप में निर्यात करें
hr: Izvezi dijagram kao PDF
id: Ekspor diagram sebagai PDF
it: Esporta diagramma in PDF
ja: 図を PDF としてエクスポート
ko: 다이어그램을 PDF로 내보내기
nl: Diagram exporteren als PDF
pt_br: Exportar diagrama como PDF
ru: Экспортировать диаграмму как PDF
sv: Exportera diagram som PDF
tr: Diyagramı PDF olarak dışa aktar
uk: Експорт діаграми як PDF

source: Export as EPS
cs: Exportovat jako EPS
fi: Vie EPS-muotoon
fr: Exporter en EPS
hi: EPS के रूप में निर्यात करें
hr: Izvezi kao EPS
it: Esporta in EPS
nl: Exporteren als EPS
pt_br: Exportar como EPS
ru: Экспортировать как EPS
tr: EPS Olarak Dışa Aktar
uk: Експорт як EPS

source: Export diagram as Encapsulated PostScript
cs: Exportovat diagram jako zapouzdřený PostScript
fi: Vie kaavio Encapsulated PostScript -muodossa
fr: Exporter le diagramme en PostScript Encapsulé
hi: आरेख को एनकैप्सुलेटेड पोस्टस्क्रिप्ट के रूप में निर्यात करें
hr: Izvezi dijagram kao Encapsulated PostScript (EPS)
it: Esporta diagramma in Encapsulated PostScript
nl: Diagram exporteren als Encapsulated PostScript
pt_br: Exportar diagrama como PostScript Encapsulado
ru: Экспортировать диаграмму как Encapsulated PostScript
tr: Kapsüllenmiş PostScript (EPS) olarak dışa aktar
uk: Експорт діаграми як інкапсульований PostScript

source: Export diagram as EPS
cs: Export diagramu jako EPS
fi: Vie kaavio EPS-muotoon
fr: Exporter le diagramme en EPS
hi: आरेख को EPS के रूप में निर्यात करें
hr: Izvezi dijagram kao EPS
it: Esporta diagramma in EPS
nl: Diagram exporteren als EPS
pt_br: Exportar diagrama como EPS
ru: Экспортировать диаграмму как EPS
tr: Diyagramı EPS olarak dışa aktar
uk: Експорт діаграми як EPS

source: Export all diagrams as SVG
fi: Vie kaikki kaaviot SVG-muotoon
fr: Exporter tous les diagrammes en SVG
hr: Izvezi sve dijagrame kao SVG
it: Esporta tutti i diagrammi in SVG
nl: Alle diagrammen exporteren als SVG
ru: Экспортировать все диаграммы как SVG
uk: Експортуйте всі діаграми як SVG

source: Export all diagrams as SVG diagrams in a specifieddirectory
fi: Vie kaikki kaaviot SVG-kaavioina määritettyyn hakemistoon
fr: Exporter tous les diagrammes en tant que diagrammes SVG dans un répertoire spécifié
hr: Izvezi sve dijagrame kao SVG dijagrame u određeni direktorij
it: Esporta tutti i diagrammi in SVG in una directory specificata
ru: Экспортировать все диаграммы в формате SVG в указанный каталог
uk: Експортуйте всі діаграми як діаграми SVG у вказаний каталог

source: Export all diagrams
fi: Vie kaikki kaaviot
fr: Exporter tous les diagrammes
hr: Izvezi sve dijagrame
it: Esporta tutti i diagrammi
nl: Alle diagrammen exporteren
ru: Экспортировать все диаграммы
uk: Експортувати всі діаграми

source: Export all diagrams as PNG
fi: Vie kaikki kaaviot PNG-muotoon
fr: Exporter tous les diagrammes en PNG
hr: Izvezi sve dijagrame kao PNG
it: Esporta tutti i diagrammi in PNG
nl: Alle diagrammen exporteren als PNG
ru: Экспортировать все диаграммы как PNG
uk: Експортувати всі діаграми у форматі PNG

source: Export all diagrams as PNG diagrams in a specifieddirectory
fi: Vie kaikki kaaviot PNG-kaavioina määritettyyn hakemistoon
fr: Exporter tous les diagrammes au format PNG dans un répertoire spécifié
hr: Izvezi sve dijagrame kao PNG dijagrame u određeni direktorij
it: Esporta tutti i diagrammi in PNG in una directory specificata
ru: Экспортировать все диаграммы в формате PNG в указанный каталог
uk: Експортуйте всі діаграми як діаграми PNG у вказаний каталог

source: Export all diagrams as PDF
fi: Vie kaikki kaaviot PDF-muotoon
fr: Exporter tous les diagrammes en PDF
hr: Izvezi sve dijagrame kao PDF
it: Esporta tutti i diagrammi in PDF
nl: Alle diagrammen exporteren als PDF
ru: Экспортировать все диаграммы как PDF
uk: Експортуйте всі діаграми як PDF
