Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Export all diagrams as PDF diagrams in a specifieddirectory
fi: Vie kaikki kaaviot PDF-kaavioina määritettyyn hakemistoon
fr: Exporter tous les diagrammes au format PDF dans un répertoire spécifié
hr: Izvezi sve dijagrame kao PDF dijagrame u određeni direktorij
it: Esporta tutti i diagrammi in PDF in una directory specificata
ru: Экспортировать все диаграммы в формате PDF в указанный каталог
uk: Експортуйте всі діаграми як діаграми PDF у вказаний каталог

source: Export all diagrams as EPS
fi: Vie kaikki kaaviot EPS-muotoon
fr: Exporter tous les diagrammes en EPS
hr: Izvezi sve dijagrame kao EPS
it: Esporta tutti i diagrammi in EPS
nl: Alle diagrammen exporteren als EPS
ru: Экспортировать все диаграммы как EPS
uk: Експортуйте всі діаграми як EPS

source: Export all diagrams as EPS diagrams in a specifieddirectory
fi: Vie kaikki kaaviot EPS-kaavioina määritettyyn hakemistoon
fr: Exporter tous les diagrammes au format EPS dans un répertoire spécifié
hr: Izvezi sve dijagrame kao EPS dijagrame u određeni direktorij
it: Esporta tutti i diagrammi in EPS in una directory specificata
ru: Экспортировать все диаграммы в формате EPS в указанный каталог
uk: Експортуйте всі діаграми як діаграми EPS у вказаний каталог

source: This model contains unsaved changes. The changes have been restored.
fi: Tämä malli sisältää tallentamattomia muutoksia. Muutokset on palautettu.
fr: Ce modèle contient des modifications non sauvegardées. Les modifications ont été restaurées.
hr: Ovaj model sadrži nespremljene promjene. Promjene su obnovljene.
it: Questo modello contiene modifiche non salvate. Le modifiche sono state ripristinate.
nl: Het geopende model bevat niet-opgeslagen wijzigingen. Wijzigingen zijn hersteld.
ru: Эта модель содержит несохраненные изменения. Изменения были восстановлены.
uk: Ця модель містить незбережені зміни. Зміни відновлено.

source: New model
ar: موديل جديد
bn: নতুন মডেল
ca: Model nou
cs: Nový model
fi: Uusi malli
fr: Nouveau modèle
hi: नए मॉडल
hr: Novi model
id: Model baru
it: Nuovo modello
ja: 新型
ko: 새 모델
nl: Nieuw model
pt_br: Novo modelo
ru: Новая модель
sv: Ny modell
tr: Yeni model
uk: Нова модель

source: New Diagram
fi: Uusi kaavio
fr: Nouveau Diagramme
hi: नया आरेख
hr: Novi dijagram
it: Nuovo Diagrama
nl: Nieuw diagram
pt_br: Novo Diagrama
ru: Новая Диаграмма
tr: Yeni Diyagram
uk: Нова діаграма

source: 1. Context diagrams
ar: 1. مخططات السياق
bn: 1. প্রসঙ্গ ডায়াগ্রাম
ca: 1. Diagrames de context
cs: 1. Kontextové diagramy
fi: 1. Kontekstikaaviot
fr: 1. Diagrammes de contexte
hi: 1. संदर्भ आरेख
hr: 1. Dijagrami konteksta
id: 1. Diagram konteks
it: 1. Diagramma di contesto
ja: 1. コンテキスト図
ko: 1. 컨텍스트 다이어그램
nl: 1. Context diagrammen
pt_br: 1. Diagramas de contexto
ru: 1. Диаграммы контекста
sv: 1. Kontextdiagram
tr: 1. Bağlam diyagramları
uk: 1. Контекстні діаграми

source: 2. Container diagrams
ar: 2. مخططات الحاويات
bn: 2. ধারক ডায়াগ্রাম
ca: 2. Diagrames de contenidors
cs: 2. Diagramy kontejnerů
fi: 2. Säilökaaviot
fr: 2. Diagrammes de conteneurs
hi: 2. कंटेनर आरेख
hr: 2. Dijagrami kontejnera
id: 2. Diagram wadah
it: 2. Diagramma contenitore
ja: 2. コンテナ図
ko: 2. 컨테이너 다이어그램
nl: 2. Container diagrammen
pt_br: 2. Diagramas de contêiner
ru: 2. Диаграммы контейнеров
sv: 2. Containerdiagram
tr: 2. Taşıyıcı diyagramları
uk: 2. Схеми контейнерів

source: 4. Code diagrams
ar: 4. مخططات الكود
bn: 4. কোড ডায়াগ্রাম
ca: 4. Diagrames de codi
cs: 4. Kódové diagramy
fi: 4. Koodikaaviot
fr: 4. Diagrammes de code
hi: 4. कोड आरेख
hr: 4. Dijagrami koda
id: 4. Diagram kode
it: 4. Diagramma codice
ja: 4. コード図
ko: 4. 코드 다이어그램
nl: 4. Code diagrammen
pt_br: 4. Diagramas de código
ru: 4. Диаграммы кода
sv: 4. Koddiagram
tr: 4. Kod diyagramları
uk: 4. Кодові діаграми

source: 3. Component diagrams
ar: 3. المخططات المكونة
bn: 3. কম্পোনেন্ট ডায়াগ্রাম
ca: 3. Diagrames de components
cs: 3. Součásti diagramů
fi: 3. Komponenttikaaviot
fr: 3. Diagrammes des composants
hi: 3. घटक आरेख
hr: 3. Dijagrami komponenti
id: 3. Diagram komponen
it: 3. Diagramma componente
ja: 3. コンポーネント図
ko: 3. 구성 요소 다이어그램
nl: 3. Componenten diagrammen
pt_br: 3. Diagramas de componentes
ru: 3. Диаграммы компонентов
sv: 3. Komponentdiagram
tr: 3. Bileşen diyagramları
uk: 3. Діаграми компонентів

source: Context diagram
ar: مخطط السياق
bn: প্রসঙ্গ রেখাচিত্র
ca: Diagrama de context
cs: Kontext diagramu
fi: Kontekstikaavio
fr: Diagramme de contexte
hi: संदर्भ आरेख
hr: Dijagram konteksta
id: Diagram konteks
it: Diagramma contesto
ja: コンテキスト図
ko: 컨텍스트 다이어그램
pt_br: Diagrama de contexto
ru: Диаграмма контекста
sv: Diagram över kontext
tr: Bağlam diyagramı
uk: Контекстна діаграма

source: Container diagram
ar: مخطط الحاوية
bn: ধারক ডায়াগ্রাম
ca: Diagrama de contenidors
cs: Kontejnerový diagram
fi: Säilökaavio
fr: Diagramme de conteneur
hi: कंटेनर आरेख
hr: Dijagram kontejnera
id: Diagram wadah
it: Diagramma contenitore
ja: コンテナ図
ko: 컨테이너 다이어그램
pt_br: Diagrama de contêiner
ru: Диаграмма контейнеров
tr: Taşıyıcı diyagramı
uk: Діаграма контейнера

source: Component diagram
ar: مخطط مكون
bn: কম্পোনেন্ট ডায়াগ্রাম
ca: Diagrama de components
cs: Diagram komponent
fi: Komponenttikaavio
fr: Diagramme de composant
hi: घटक आरेख
hr: Dijagram komponenti
id: diagram komponen
it: Diagramma componente
ja: コンポーネント図
ko: 구성 요소 다이어그램
nl: Componenten diagram
pt_br: Diagrama de componentes
ru: Диаграмма компонентов
sv: Komponentdiagram
tr: Bileşen diyagramı
uk: Діаграма компонентів

source: Code diagram
ar: مخطط الكود
bn: কোড ডায়াগ্রাম
ca: Diagrama de codi
cs: Diagram kódu
fi: Koodikaavio
fr: Diagramme de code
hi: कोड आरेख
hr: Dijagram koda
id: Diagram kode
it: Diagramma codice
ja: コード図
ko: 코드 다이어그램
pt_br: Diagrama de código
ru: Диаграмма кода
sv: Koddiagram
tr: Kod diyagramı
uk: Діаграма коду

source: Personal Banking Customer
fi: Henkilökohtainen pankkitoiminta-asiakas
fr: Client des services Bancaires aux Particuliers
hr: Mušterija osobnog bankarstva
it: Cliente bancario personale
ru: Клиент персонального банка
uk: Клієнт персонального банку

source: Internet Banking System
fi: Internet-pankkitoimintajärjestelmä
fr: Système Bancaire par Internet
hr: Sustav internetskog bankarstva
it: Sistema bancario su Internet
ru: Система Интернет-банкинга
uk: Система Інтернет-банкінгу

source: Mainframe Banking System
fi: Keskusyksikkö-pankkitoimintajärjestelmä
fr: Système bancaire sur ordinateur central
hr: Sustav bankarstva na centralnom računalu
it: Mainframe sistema bancario
ru: Мейнфреймовая банковская система
uk: Мейнфрейм Банківська система

source: View account balances, and make payments using
fi: Tarkastele tilien saldoja ja suorita maksuja käyttämällä
fr: Consultez le solde de vos comptes et effectuez des paiements en utilisant
hr: Pogledaj stanja računa i izvrši plaćanja pomoću
it: Visualizza i bilanci dei conti, ed effettua pagamenti usando
ru: Просматривать остатки на счёте и осуществлять платежи с помощью
uk: Переглядати залишки на рахунку та здійснювати платежів за допомогою

source: Get account information from, and makes payments using
fi: Hanki tilitietoja ja suorita maksuja käyttämällä
fr: Obtenir des informations sur les comptes et effectuer des paiements à l'aide de
hr: Primi podatke o računu i izvrši plaćanja pomoću
it: Prendi le informazioni dell'account da, ed effettua pagamenti usando
ru: Получать информацию о счёте и совершать платежи с помощью
uk: Отримувати інформацію про обліковий запис і здійснювати платежі за допомогою

source: E-mail System
fi: Sähköpostijärjestelmä
fr: Système de courrier électronique
hr: E-mail sustav
it: Sistema di posta elettronica
nl: E-mail Systeem
ru: Система электронной почты
uk: Система електронної пошти

source: Sends e-mail to
fi: Lähetä sähköposti vastaanottajalle
fr: Envoyer un mél à
hr: Šalje e-mail na
it: Invia email a
nl: Zendt e-mail naar
ru: Отправка электронной почты в
uk: Надсилає електронний лист до

source: Sends e-mail using
fi: Lähettää sähköpostia käyttäen
fr: Envoi d'un courrier électronique à l'aide de
hr: Šalje e-mail pomoću
it: Invia email usando
ru: Отправка электронной почты с помощью
uk: Надсилає електронну пошту за допомогою

source: Web Application
fi: Verkkosovellus
fr: Application Web
hr: Web aplikacija
it: Applicazione web
nl: Webapplicatie
ru: Веб-приложение
uk: Веб-додаток

source: API Application
fi: Rajapintasovellus
fr: Application API
hr: API aplikacija
it: Applicazione API
nl: API-applicatie
ru: API-приложение
uk: Програма API

source: Single-Page Application
fi: Yhden sivun sovellus (SPA)
fr: Application d'une seule page
hr: Jednostranična aplikacija
it: Applicazione a singola pagina
nl: Single-page-applicatie
ru: Одностраничное приложение
uk: Односторінкова програма

source: Mobile App
fi: Mobiilisovellus
fr: Application mobile
hr: Aplikacija za mobitele
it: App per telefono
nl: Mobiele app
ru: Мобильное приложение
uk: Мобільний додаток

source: Visit bigbank.com/lb using
fi: Vieraile bigbank.com/lb käyttämällä
fr: Visitez bigbank.com/lb en utilisant
hr: Posjeti bigbank.com/lb pomoću
it: Visita bigbank.com/lb usando
ru: Посетите bigbank.com/lb, используя
uk: Відвідайте bigbank.com/lb за допомогою

source: View account balances and make payments using
fi: Tarkastele tilien saldoa ja suorita maksuja käyttämällä
fr: Consulter le solde des comptes et effectuer des paiements en utilisant
hr: Pogledaj stanje računa i izvrši plaćanja pomoću
ru: Просматривать остатки на счете и совершать платежи с помощью
uk: Переглядати залишки на рахунку та здійснювати платежі за допомогою

source: Makes API calls to
fi: Tekee API-kutsuja kohteeseen
fr: Effectue des appels d'API à
hr: Upućuje API pozive na
ru: Выполняет вызовы API к
uk: Здійснює виклики API до

source: Reads from, writes to
fi: Lukee tältä, kirjoittaa kohteeseen
fr: Lecture de, écrire à
hr: Čita iz, piše u
ru: Читает с, пишет в
uk: Читає з, пише

source: Delivers
fi: Toimittaa
fr: Délivre
hr: Isporučuje
nl: Levert
uk: Доставляє

source: Sign In Controller
fi: Sisäänkirjautumisohjain
fr: Contrôleur de connexion
hr: Kontroler prijave
ru: Контроллер Входа
uk: Контролер входу

source: Security Component
fi: Tietoturvakomponentti
fr: Composant de sécurité
hr: Sigurnosna komponenta
nl: Beveiligings­component
ru: Компонент безопасности
uk: Компонент Безпеки

source: Reset Password Controller
fi: Nollaa salasana -ohjain
fr: Commande de Réinitialisation du mot de passe
hr: Kontroler resetiranja lozinki
ru: Сброс контроллера пароля
uk: Скидання контролера пароля

source: E-mail Component
fi: Sähköpostikomponentti
fr: Composant du courrier électronique
hr: E-mail komponenta
ru: Компонент электронной почты
uk: Компонент електронної пошти

source: Account Summary Controller
fi: Tilin yhteenveto -ohjain
fr: Commande de synthèse des comptes
hr: Kontroler sažetka računa
ru: Контролер сводки счетов
uk: Контролер підсумків облікового запису

source: Mainframe Banking System Facade
fi: Keskusyksikön pankkitoimintajärjestelmän julkisivu
fr: Façade du système bancaire central
hr: Fasada sustava bankarstva na centralnom računalu
ru: Фасад основной банковской системы
uk: Фасад банківської системи мейнфрейму

source: Uses
fi: Käyttää
fr: Utilisations
hr: Primjene
it: Usi
nl: Gebruikt
uk: Використанні

source: Makes API calls to [JSON/HTTPS]
fi: Tekee API-kutsuja kohteeseen [JSON/HTTPS]
fr: Effectue des appels API vers [JSON/HTTPS]
hr: Upućuje API pozive na [JSON/HTTPS]
it: Effettua chiamate API a [JSON/HTTPS]
ru: Выполняет вызовы API к [JSON/HTTPS]
uk: Здійснює виклики API до [JSON/HTTPS]

source: Model Name Here
ar: اسم النموذج هنا
bn: মডেলের নাম এখানে
ca: Nom del model aquí
cs: Název modelu zde
fi: Mallin nimi tähän
fr: Nom du modèle ici
hi: मॉडल का नाम यहां
hr: Zadaj ime modela ovdje
id: Nama Model Di Sini
it: Nome modello
ja: モデル名 はこちら
ko: 모델 이름 여기
nl: Modelnaam hier
pt_br: Nome do modelo aqui
ru: Имя Модели Здесь
sv: Modellnamn här
tr: Model Adı Buraya
uk: Назва моделі тут

source: STPA
bn: এসটিপিএ
hr: STPA (teoretska analiza postupaka sustava)
ja: ストパ

source: Loss Definition
ar: تعريف الخسارة
bn: হারানো সংজ্ঞা
ca: Definició de pèrdues
cs: Definice ztráty
fi: Menetyksen määritelmä
fr: Perte de Définition
hi: हानि परिभाषा
hr: Definicija gubitka
id: Definisi Rugi
it: Definizione di perdita
ja: 損失の定義
ko: 손실 정의
nl: Verliesdefinitie
pt_br: Definição de Perda
ru: Определение Потери
sv: Förlustdefinition
tr: Kayıp Tanımı
uk: Визначення втрати

source: FTA
ar: اتفاقية التجارة الحرة
bn: এফটিএ
ca: TLC
hr: FTA (analiza kvarova)
sv: Frihandelsavtal

source: Loss of System
ar: فقدان النظام
bn: সিস্টেমের ক্ষতি
ca: Pèrdua del sistema
cs: Ztráta systému
fi: Järjestelmän menetys
fr: Perte du système
hi: सिस्टम की हानि
hr: Gubitak sustava
id: Kehilangan Sistem
it: Perdita di sistema
ja: システムの損失
ko: 시스템 손실
nl: Verlies van systeem
pt_br: Perda do Sistema
ru: Потеря Системы
sv: Förlust av system
tr: Sistemin Kaybı
uk: Втрата системи

source: Loss of Subsystem 1
ar: فقدان النظام الفرعي 1
bn: Subsystem এর ক্ষতি 1
ca: 1 Pèrdua del subsistema
cs: Ztráta subsystému 1
fi: Alijärjestelmän 1 menetys
fr: Perte du sous-système 1
hi: सबसिस्टम 1 की क्षति
hr: Gubitak podsustava 1
id: Hilangnya Subsistem 1
it: Perdita del sottosistema 1
ja: サブシステム 1 の損失
ko: 하위 시스템 손실 1
nl: Verlies van subsysteem 1
pt_br: Perda do Subsistema 1
ru: Потеря Подсистемы 1
sv: Förlust av delsystem 1
tr: Alt Sistem 1ʼin Kaybı
uk: Втрата підсистеми 1

source: Loss of Subsystem 2
ar: فقدان النظام الفرعي 2
bn: Subsystem 2 এর ক্ষতি
ca: 2 Pèrdua del subsistema
cs: Ztráta subsystému 2
fi: Alijärjestelmän 2 menetys
fr: Perte du sous-système 2
hi: सबसिस्टम 2 की क्षति
hr: Gubitak podsustava 2
id: Hilangnya Subsistem 2
ja: サブシステム 2 の損失
ko: 하위 시스템 손실 2
nl: Verlies van subsysteem 2
pt_br: Perda do Subsistema 2
ru: Потеря Подсистемы 2
sv: Förlust av delsystem 2
tr: Alt Sistem 2ʼnin Kaybı
uk: Втрата підсистеми 2

source: Hazard Definition
ar: تعريف الخطر
bn: বিপদের সংজ্ঞা
ca: Definició de perill
cs: Definice nebezpečí
fi: Hasardin määritelmä
fr: Définition du danger
hi: खतरे की परिभाषा
hr: Definicija opasnosti
id: Definisi Bahaya
ja: ハザード定義
ko: 위험 정의
nl: Gevaardefinitie
pt_br: Definição de Risco
ru: Определение Опасности
sv: Definition av faror
tr: Tehlike Tanımı
uk: Визначення небезпеки

source: Loss of Life or Injury of People
ar: فقدان الحياة أو إصابة الناس
bn: মানুষের জীবন বা আঘাত ের ক্ষতি
ca: Pèrdua de vides o lesions de persones
cs: Ztráta života nebo zranění osob
fi: Kuolema tai henkilön loukkaantuminen
fr: Perte de vie ou blessure de personnes
hi: लोगों की जान या चोट की हानि
hr: Gubitak života ili ozljeda ljudi
id: Kehilangan Nyawa atau Cedera Orang
ja: 人命の喪失または人の負傷
ko: 사람의 인명 손실 또는 부상
nl: Verlies van leven of verwonding van mensen
pt_br: Perda de Vida ou Lesão de Pessoas
ru: Гибель или Ранение Людей
sv: Förlust av liv eller skada hos människor
tr: Can Kaybı veya Yaralanma
uk: Загибель або поранення людей

source: Loss of Mission
ar: فقدان المهمة
bn: মিশন হারানো
ca: Pèrdua de la missió
cs: Ztráta poslání
fi: Tehtävän tappio
fr: Perte de mission
hi: मिशन की हानि
hr: Gubitak misije
id: Kehilangan Misi
ja: ミッションの喪失
ko: 미션 상실
nl: Verlies van missie
pt_br: Perda da Missão
ru: Потеря Миссии
sv: Förlust av uppdrag
tr: Görev Kaybı
uk: Втрата місії

source: Loss of Customer Satisfaction
ar: فقدان رضا العملاء
bn: গ্রাহক সন্তুষ্টি হারানো
ca: Pèrdua de satisfacció del client
cs: Ztráta spokojenosti zákazníků
fi: Asiakastyytyväisyyden menetys
fr: Perte de satisfaction client
hi: ग्राहक संतुष्टि की हानि
hr: Gubitak zadovoljstva kupaca
id: Hilangnya Kepuasan Pelanggan
ja: 顧客満足度の損失
ko: 고객 만족도 상실
nl: Verlies van klanttevredenheid
pt_br: Perda de Satisfação do Cliente
ru: Потеря Удовлетворённости Клиентов
sv: Förlust av kundnöjdhet
tr: Müşteri Memnuniyeti Kaybı
uk: Втрата задоволеності клієнтів

source: Hazard 2
ar: الخطر 2
bn: বিপদ 2
ca: Perill 2
cs: Nebezpečí 2
fi: Hasardi 2
fr: Danger 2
hi: खतरा 2
hr: Opasnost 2
id: Bahaya 2
ja: ハザード2
ko: 위험 2
nl: Gevaar 2
pt_br: Risco 2
ru: Опасность 2
sv: Fara 2
tr: Tehlike 2
uk: Небезпека 2

source: Hazard 1
ar: الخطر 1
bn: বিপদ ১
ca: Perill 1
cs: Nebezpečí 1
fi: Hasardi 1
fr: Danger 1
hi: खतरा 1
hr: Opasnost 1
id: Bahaya 1
ja: ハザード1
ko: 위험 1
nl: Gevaar 1
pt_br: Risco 1
ru: Опасность 1
sv: Fara 1
tr: Tehlike 1
uk: Небезпека 1

source: Mapping of Losses and Hazards
ar: رسم خرائط الخسائر والمخاطر
bn: ক্ষতি এবং বিপত্তির ম্যাপিং
ca: Mapa de pèrdues i perills
cs: Mapování ztrát a nebezpečí
fi: Tappioiden ja vaarojen kartoitus
fr: Cartographie des pertes et des risques
hi: हानियों और खतरों का मानचित्रण
hr: Mapiranje gubitaka i opasnosti
id: Pemetaan Kerugian dan Bahaya
ja: 損失と危険のマッピング
ko: 손실 및 위험 매핑
nl: Verliezen en gevaren in kaart gebracht
pt_br: Mapeamento de Perdas e Riscos
ru: Сопоставление Потерь и Опасностей
sv: Kartläggning av förluster och faror
tr: Kayıpların ve Tehlikelerin Haritalanması
uk: Картування втрат і небезпек

source: Operational Situations
ar: حالات تشغيلية
bn: অপারেশনাল পরিস্থিতি
ca: Situacions operatives
cs: Provozní situace
fi: Operationaaliset tilanteet
fr: Situations opérationnelles
hi: परिचालन स्थितियां
hr: Operacijske situacije
id: Situasi Operasional
ja: 運用状況
ko: 운영 상황
nl: Operationele situaties
pt_br: Situações Operacionais
ru: Оперативные Обстановки
sv: Operativa situationer
tr: İşletim Durumları
uk: Оперативні ситуації

source: Operational Situation 1
ar: الوضع التشغيلي 1
bn: অপারেশনাল পরিস্থিতি 1
ca: Situació operativa 1
cs: Provozní situace 1
fi: Operationaalinen tilanne 1
fr: Situation opérationnelle 1
hi: परिचालन स्थिति 1
hr: Operacijska situacija 1
id: Situasi Operasional 1
ja: 運用状況 1
ko: 운영 상황 1
nl: Operationele situatie 1
pt_br: Situação Operacional 1
ru: Оперативная Обстановка 1
sv: Operativ situation 1
tr: İşletim Durumu 1
uk: Оперативна ситуація 1

source: Context of UCAs
ar: سياق UCAs
bn: UCAs এর প্রেক্ষাপট
ca: Context de les UCAs
cs: Kontext UCA
fi: UCA:iden konteksti
fr: Contexte des UCA
hi: UCA का प्रसंग
hr: Kontekst ravnomjerno raspodijeljenih elemenata na kružnici (UCA)
id: Konteks UCA
ja: UCA のコンテキスト
ko: UCA의 컨텍스트
nl: Context van UCA's
pt_br: Contexto das UCAs
ru: Контекст UCA
sv: Sammanhang för UCA
tr: UCAʼların Bağlamı
uk: Контекст UCA

source: Situational Context
ar: السياق الظرفية
bn: পরিস্থিতিগত প্রেক্ষাপট
ca: Context situacional
cs: Situační kontext
fi: Tilannekohtainen konteksti
fr: Contexte situationnel
hi: परिस्थितिजन्य संदर्भ
hr: Situacijski kontekst
id: Konteks Situasional
ja: 状況コンテキスト
ko: 상황 별 컨텍스트
nl: Situationele context
pt_br: Contexto Situacional
ru: Ситуационный Контекст
sv: Situationskontext
tr: Durumsal Bağlam
uk: Ситуаційний контекст

source: Situation Hierarchy
ar: التسلسل الهرمي للوضع
bn: পরিস্থিতি শ্রেণীবিন্যাস
ca: Jerarquia de situació
cs: Hierarchie situací
fi: Tilannehierarkia
fr: Hiérarchie des situations
hi: परिस्थिति पदानुक्रम
hr: Hijerarhija situacije
id: Hirarki Situasi
ja: シチュエーション階層
ko: 상황 계층 구조
nl: Situatiehiërarchie
pt_br: Hierarquia de Situação
ru: Ситуационная Иерархия
sv: Situationshierarki
tr: Durum Hiyerarşisi
uk: Ієрархія ситуації

source: The fault tree analysis shows which causes for the failure of a system have been considered.
ar: يُظهر تحليل شجرة الأخطاء أسباب فشل النظام التي تم أخذها في الاعتبار.
bn: ফল্ট ট্রি বিশ্লেষণ দেখায় যে কোন সিস্টেমের ব্যর্থতার কারণগুলি বিবেচনা করা হয়েছে।
ca: L'anàlisi de l'arbre de fallades mostra quines són les causes de la fallada d'un sistema.
cs: Analýza stromu poruch ukazuje, které příčiny selhání systému byly zváženy.
fi: Vikapuuanalyysi näyttää, mitkä järjestelmävirheiden syitä on tunnistettu.
fr: L'analyse de l'arbre des défaillances montre quelles sont les causes de la défaillance d'un système qui ont été prises en compte.
hi: दोष वृक्ष विश्लेषण से पता चलता है कि किसी प्रणाली की विफलता के लिए किन कारणों पर विचार किया गया है।
hr: Analiza kvarova prikazuje koji su uzroci kvara sustava uzeti u obzir.
id: Analisis pohon kesalahan menunjukkan penyebab kegagalan sistem yang telah dipertimbangkan.
ja: フォールト ツリー分析では、システムの障害の原因が考慮されています。
ko: 오류 트리 해석은 시스템의 오류의 원인을 고려한 것으로 나타났습니다.
nl: De foutboomanalyse laat zien welke oorzaken voor het falen van een systeem zijn overwogen.
pt_br: A análise da árvore de falha mostra quais causas para a falha de um sistema foram consideradas.
ru: Анализ дерева отказов показывает, какие причины сбоя системы были рассмотрены.
sv: Felträdsanalysen visar vilka orsaker till ett systemfel som har beaktats.
tr: Hata ağacı analizi, bir sistemin arızalanması durumunda hangi nedenlerin dikkate alındığını gösterir.
uk: Аналіз дерева несправностей показує, які причини збою системи були розглянуті.

source: 1. Concept Level
ar: 1. مستوى المفهوم
bn: 1. কনসেপ্ট লেভেল
ca: 1. Nivell de concepte
cs: 1. Koncepční úroveň
fi: 1. Konseptitaso
fr: 1. Niveau conceptuel
hi: 1. अवधारणा स्तर
hr: 1. Konceptualna razina
id: 1. Tingkat Konsep
ja: 1. コンセプトレベル
ko: 1. 개념 수준
nl: 1. Concept Niveau
pt_br: 1. Nível de Conceito
ru: 1. Уровень Концепции
sv: 1. Konceptnivå
tr: 1. Konsept Düzeyi
uk: 1. Рівень концепції

source: 2. Logical Level
ar: 2. المستوى المنطقي
bn: 2. যৌক্তিক স্তর
ca: 2. Nivell lògic
cs: 2. Logická úroveň
fi: 2. Looginen taso
fr: 2. Niveau logique
hi: 2. तार्किक स्तर
hr: 2. Logička razina
id: 2. Tingkat Logika
ja: 2. 論理レベル
ko: 2. 논리적 수준
nl: 2. Logisch Niveau
pt_br: 2. Nível lógico
ru: 2. Уровень Логики
sv: 2. Logisk nivå
tr: 2. Mantık Düzeyi
uk: 2. Логічний рівень

source: 3. Technology Level
ar: 3. مستوى التكنولوجيا
bn: 3. প্রযুক্তি স্তর
ca: 3. Nivell tecnològic
cs: 3. Technologická úroveň
fi: 3. Teknologiataso
fr: 3. Niveau technologique
hi: 3. प्रौद्योगिकी स्तर
hr: 3. Tehnološka razina
id: 3. Tingkat Teknologi
ja: 3. 技術レベル
ko: 3. 기술 수준
nl: 3. Technologisch Niveau
pt_br: 3. Nível de Tecnologia
ru: 3. Уровень Технологии
sv: 3. Tekniknivå
tr: 3. Teknoloji Düzeyi
uk: 3. Технологічний рівень

source: User
ar: مستخدم
bn: ব্যবহারকারী
ca: Usuari
cs: Uživatel
fi: Käyttäjä
fr: Utilisateur
hi: उपयोक्ता
hr: Korisnik
id: Pengguna
ja: 利用者
ko: 사용자
nl: Gebruiker
pt_br: Usuário
ru: Пользователь
sv: Användare
tr: Kullanıcı
uk: Користувач

source: Use Case #1
ar: حالة الاستخدام # 1
bn: কেস #1 ব্যবহার করুন
ca: Cas d'ús #1
cs: Případ použití č. 1
fi: Käyttötapaus #1
fr: Cas d’utilisation #1
hi: उपयोग केस #1
hr: Slučaj primjene broj 1
id: Gunakan Kasus # 1
ja: ユースケース #1
ko: 사례 사용 #1
nl: Doeleinde #1
pt_br: Caso de Uso nº 1
ru: Прецедент №1
sv: Användningsfall #1
tr: Kullanım Örneği #1
uk: Випадок використання #1

source: Structure
ar: بنية
bn: গঠন
ca: Estructura
cs: Struktura
fi: Rakenne
hi: संरचना
hr: Struktura
id: Struktur
ja: 構造
ko: 구조
nl: Structuur
pt_br: Estrutura
ru: Структура
sv: Struktur
tr: Yapı
uk: Структура

source: Feature Domain
fi: Esittele toimialue
fr: Domaine d'application
hi: फ़ीचर डोमेन
hr: Domena značajke
nl: Functiionaliteitsdomein
pt_br: Domínio de Característica
tr: Özellik Alan Adı
uk: Функціональний домен

source: Feature
ar: ميزة
bn: বৈশিষ্ট্য
ca: Tret
cs: Funkce
fi: Ominaisuus
fr: Fonctionnalité
hi: फ़ीचर
hr: Značajka
id: Fitur
ja: 特徴
ko: 특징
nl: Functie
pt_br: Característica
sv: Drag
tr: Özellik
uk: Особливість

source: External Element
ar: عنصر خارجي
bn: বাহ্যিক উপাদান
ca: Element extern
cs: Externí prvek
fi: Ulkoinen elementti
fr: Élément externe
hi: बाहरी तत्त्व
hr: Vanjski element
id: Elemen Eksternal
ja: 外部要素
ko: 외부 요소
nl: Extern element
pt_br: Elemento Externo
ru: Внешний Элемент
sv: Externt element
tr: Harici Öge
uk: Зовнішній елемент

source: Concept Requirements
fi: Käsitevaatimukset
fr: Exigences conceptuelles
hi: अवधारणा आवश्यकताएं
hr: Koncepcijski uvjeti
nl: Concept Vereisten
pt_br: Requisitos de Conceito
ru: Требования к концепции
tr: Konsept Gereksinimleri
uk: Вимоги до концепції
