Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Remove relation “{name}”
cs: Odstranit relaci “{name}”
fi: Poista relaatio “{name}”
fr: Supprimer la relation "{name}"
hi: संबंध “{name}” हटाएं
hr: Ukloni vezu „{name}”
it: Rimuovi relazione “{name}”
nl: Relatie ‘{name}’ verwijderen
pt_br: Remover relação “{name}”
ru: Удалить отношение «{name}»
tr: “{name}” ilişkisini kaldır
uk: Видалити зв'язок “{name}”

source: Update relation “{name}”
cs: Aktualizovat relaci “{name}”
fi: Päivitä relaatio “{name}”
fr: Mettre à jour la relation "{name}"
hi: संबंध “{name}” अपडेट करें
hr: Aktualiziraj vezu „{name}”
it: Aggiorna relazione “{name}”
nl: Relatie ‘{name}’ bijwerken
pt_br: Atualizar relação “{name}”
ru: Обновить отношение «{name}»
tr: “{name}” ilişkisini güncelle
uk: Відношення оновлення “{name}”

source: general: General
fi: yleinen: Yleinen
fr: general : Général
hr: opće: Opće
it: generale: Generale
nl: algemeen: Algemeen
ru: общее: Общее
uk: загальний: загальний

source: C4 Model
ar: نموذج C4
bn: C4 মডেল
cs: Model C4
fi: C4-malli
fr: Modèle C4
hi: C4 मॉडल
id: Model C4
it: Modello C4
ja: C4モデル
ko: C4 모델
pt_br: Modelo C4
ru: Модель C4
sv: C4-modell
tr: C4 Modeli
uk: Модель C4

source: ValueSpecificationAction
fi: ArvoMäärittelyToiminto
fr: ValeurSpecificationAction
hi: मूल्यविनिर्देशकार्रवाई
nl: WaardeSpecificatieActie
pt_br: AçãoEspecificaçãoValor
ru: ДействиеПоЗначениюСпецификации
tr: DeğerBelirtimEylemi
uk: ЗначенняВизначення

source: CallBehaviorAction
fi: KutsuKäyttäytymisToiminta
fr: AppelleActionComportementale
hi: कॉलव्यवहारकार्रवाई
nl: AanroepGedragActie
pt_br: AçãoChamarComportamento
ru: ВызовДействияПоведение
tr: ÇağrıDavranışEylemi

source: Magnet
ar: مغناطيس
bn: চুম্বক
ca: Imant
fi: Magneetti
fr: Aimant
hi: चुंबक
it: Magnete
ja: 磁石
ko: 자석
nl: Magneet
pt_br: Ímã
ru: Магнит
tr: Mıknatıs
uk: Магніт

source: Signal
fi: Signaali
hi: संकेत
it: Segnale
nl: Signaal
pt_br: Sinal
ru: Сигнал
tr: Sinyal
uk: Сигнал

source: id
fi: tunnus
ru: идентификатор

source: Operator
ar: المشغل أو العامل
bn: কার্যকর্তা
ca: Operador
cs: Operátor
fi: Operaattori
fr: Opérateur
hi: संचालिका
ja: 演算子
ko: 연산자
pt_br: Operador
ru: Оператор
sv: Operatör
tr: İşleyen
uk: Оператор

source: Model
fi: Malli
fr: Modèle
it: Modello
ru: Модель
uk: Модель

source: Id
ar: بطاقة تعريف
bn: আইডি
cs: ld
hi: आईडी
id: Indo
ja: 身分証明書
ru: Идентификатор
tr: Kimlik

source: proxy
ar: الوكيل
bn: প্রক্সি
ca: Apoderat
hi: प्रॉक्सी
ja: プロキシ
ko: 대리
ru: прокси
sv: proxyserver
tr: vekil sunucu
uk: проксі

source: qname
fr: nom de famille
nl: qnaam

source: LIFO
ja: リフォ
pt_br: UEPS

source: FIFO
ja: フィフォ
pt_br: PEPS

source: Error Reports
pt_br: Relatórios de erros

source: An unexpected error occurred. Please file an issue on GitHub and include information from Tools → Error Reports.
pt_br: Ocorreu um erro inesperado. Por favor, preencha um relatório de problema no GitHub e inclua informações de Ferramentas -> Relatórios de erros.

source: Any unhandled errors are shown here. You can use these to provide extra information when you create an issue on GitHub.
pt_br: Todos os erros não tratados são mostrados aqui. Você pode usá-los para fornecer informações adicionais quando você criar um relatório de problema no GitHub.

source: New _Package
ar: _حزمة جديدة
bn: নতুন _Package
ca: Nova _Package
id: _Paket . baru
ja: 新しい_Package
ko: 새 패키지(_P)
pt_br: Novo _Pacote
sv: Nytt _Paket

source: New C4 Diagram
ar: مخطط C4 الجديد
bn: নতুন C4 ডায়াগ্রাম
ca: Diagrama C4 nou
id: Diagram C4 Baru
ja: 新しい C4 ダイアグラム
ko: 새로운 C4 다이어그램
sv: Nytt C4-diagram

source: New Class Diagram
ar: مخطط فصل جديد
bn: নতুন শ্রেণী ডায়াগ্রাম
ca: Diagrama de classes nou
id: Diagram Kelas Baru
ja: 新しいクラス図
ko: 새 클래스 다이어그램
sv: Nytt klassdiagram

source: New Activity Diagram
ar: مخطط نشاط جديد
bn: নতুন ক্রিয়াকলাপ ডায়াগ্রাম
ca: Diagrama d'activitat nou
id: Diagram Aktivitas Baru
ja: 新しいアクティビティ図
ko: 새 활동 다이어그램
sv: Nytt aktivitetsdiagram

source: New Sequence Diagram
ar: مخطط تسلسل جديد
bn: নতুন সিকোয়েন্স ডায়াগ্রাম
ca: Diagrama de seqüència nou
id: Diagram Urutan Baru
ja: 新しいシーケンス図
ko: 새 시퀀스 다이어그램
sv: Nytt sekvensdiagram

source: New State Machine Diagram
ar: مخطط آلة الدولة الجديد
bn: নতুন স্টেট মেশিন ডায়াগ্রাম
ca: Diagrama de màquina d'estat nou
id: Diagram Mesin Negara Baru
ja: 新しい状態マシン図
ko: 새 상태 기계 다이어그램
sv: Nytt datordiagram

source: RAAML
ar: رامل
ja: ラムル

source: New FTA Diagram
ar: مخطط اتفاقية التجارة الحرة الجديد
bn: নতুন FTA ডায়াগ্রাম
ca: Diagrama de FTA nou
id: Diagram FTA Baru
ja: 新しい FTA ダイアグラム
ko: 새로운 FTA 다이어그램
sv: Nytt FTA-diagram

source: New STPA Diagram
ar: مخطط STPA الجديد
bn: নতুন STPA ডায়াগ্রাম
ca: Diagrama STPA nou
id: Diagram STPA Baru
ja: 新しい STPA 図
ko: 새로운 STPA 다이어그램
sv: Nytt STPA-diagram

source: New Block Definition Diagram
ar: مخطط تعريف الكتلة الجديد
bn: নতুন ব্লক সংজ্ঞা ডায়াগ্রাম
ca: Diagrama de definició de bloc nou
id: Diagram Definisi Blok Baru
ja: 新しいブロック定義ダイアグラム
ko: 새 블록 정의 다이어그램
sv: Nytt blockdefinitionsdiagram

source: New Internal Block Diagram
ar: مخطط كتلة داخلي جديد
bn: নতুন অভ্যন্তরীণ ব্লক ডায়াগ্রাম
ca: Crea un diagrama de blocs intern
id: Diagram Blok Internal Baru
ja: 新しい内部ブロック図
ko: 새 내부 블록 다이어그램
sv: Nytt internt blockdiagram

source: New Package Diagram
ar: مخطط حزمة جديد
bn: নতুন প্যাকেজ ডায়াগ্রাম
ca: Diagrama de paquets nou
id: Diagram Paket Baru
ja: 新しいパッケージ図
ko: 새 패키지 다이어그램
sv: Nytt paketdiagram

source: New Requirement Diagram
ar: مخطط المتطلبات الجديد
bn: নতুন আবশ্যকতা ডায়াগ্রাম
ca: Diagrama de requisits nou
id: Diagram Persyaratan Baru
ja: 新しい要件図
ko: 새 요구 사항 다이어그램
sv: Nytt kravdiagram

source: New Use Case Diagram
ar: مخطط حالة الاستخدام الجديد
bn: নতুন ব্যবহার কেস ডায়াগ্রাম
ca: Diagrama de casos d'ús nou
id: Diagram Kasus Penggunaan Baru
ja: 新しいユース ケース図
ko: 새 사용 사례 다이어그램
sv: Diagram över nytt användningsfall

source: New Component Diagram
ar: مخطط مكون جديد
bn: নতুন কম্পোনেন্ট ডায়াগ্রাম
ca: Diagrama de components nou
id: Diagram Komponen Baru
ja: 新しいコンポーネント図
ko: 새 구성 요소 다이어그램
sv: Nytt komponentdiagram

source: New Deployment Diagram
ar: رسم تخطيطي جديد للنشر
bn: নতুন স্থাপনা ডায়াগ্রাম
ca: Diagrama de desplegament nou
id: Diagram Penerapan Baru
ja: 新しい配置ダイアグラム
ko: 새 배포 다이어그램
sv: Nytt distributionsdiagram

source: New Communication Diagram
ar: مخطط اتصال جديد
bn: নতুন কমিউনিকেশন ডায়াগ্রাম
ca: Diagrama de comunicació nou
id: Diagram Komunikasi Baru
ja: 新しいコミュニケーション図
ko: 새로운 통신 다이어그램
sv: Nytt kommunikationsdiagram

source: New Profile Diagram
ar: مخطط ملف تعريف جديد
bn: নতুন প্রোফাইল ডায়াগ্রাম
ca: Diagrama de perfil nou
id: Diagram Profil Baru
ja: 新しいプロファイル図
ko: 새 프로필 다이어그램
sv: Nytt profildiagram

source: general: {}
ar: جنرال لواء: {}
bn: সাধারণ: {}
id: umum: {}
ja: 一般: {}
ko: 일반: {}
sv: allmänt: {}

source: supplier: {}
ar: المورد: {}
bn: সরবরাহকারী: {}
ca: proveïdor: {}
id: pemasok: {}
ja: サプライヤ: {}
ko: 공급업체: {}
sv: leverantör: {}

source: extend: {}
ar: تمديد: {}
bn: প্রসারিত করুন: {}
ca: extensió: {}
id: memperpanjang: {}
ja: 拡張: {}
ko: 연장: {}

source: include: {}
ar: تضمن: {}
bn: অন্তর্ভুক্ত: {}
ca: inclou: {}
id: termasuk: {}
ja: を含むことができます。{}
ko: 포함: {}
sv: inkludera: {}

source: Control/object flow
ar: التحكم / تدفق الكائن
bn: নিয়ন্ত্রণ/অবজেক্ট প্রবাহ
ca: Fluxe de control/objecte
id: Kontrol/aliran objek
ja: 制御/オブジェクトフロー
ko: 제어/객체 흐름
sv: Kontroll-/objektflöde

source: 🛈 Help
ar: 🛈 مساعدة
bn: 🛈 সহায়তা
ca: 🛈 Ajuda
id: Bantuan
ja: 🛈 ヘルプ
ko: 🛈 도움말
sv: 🛈 Hjälp

source: S
ar: س

source: Add and edit class attributes according to UML syntax. • <tt>attr</tt> (name, defaults to public visibility) • <tt>+ attr: int</tt> (public with type) • <tt>+ attr: int[0..1]</tt> (public, type, and multiplicity) • <tt># /attr: int # a note</tt> (protected, derived, with remark) Press <b>Enter</b> to edit, <b>Backspace</b>/<b>Delete</b> to remove items. Use <b>-</b>/<b>=</b> to move items up or down.
ar: قم بإضافة وتحرير سمات الفئة وفقًا لبناء جملة UML. • <tt> Attr </tt> (الاسم ، الإعدادات الافتراضية للرؤية العامة) • <tt> + attr: int </tt> (عام بالنوع) • <tt> + Attr: int [0..1] </tt> (عام ، نوع ، وتعدد) • <tt> # / attr: int # a note </tt> (محمية ، مشتقة ، مع ملاحظة) اضغط على <b> أدخل </b> للتعديل ، <b> Backspace </b> / <b> احذف </b> لإزالة العناصر. استخدم <b> - </b> / <b> = </b> لنقل العناصر لأعلى أو لأسفل.
bn: UML সিনট্যাক্স অনুযায়ী শ্রেণী বৈশিষ্ট্যগুলি যোগ করুন এবং সম্পাদনা করুন। • <tt>attr</tt> (নাম, জনসাধারণের দৃশ্যমানতার ডিফল্ট) • <tt>+ attr: int</tt> (টাইপ সহ সর্বজনীন) • <tt>+ attr: int[0..1]</tt> (সর্বজনীন, প্রকার, এবং বহুবিধতা) • <tt># /attr: int # a note</tt> (সুরক্ষিত, প্রাপ্ত, মন্তব্য সহ) সম্পাদনা করতে <b>Enter</b> টিপুন, <b>ব্যাকস্পেস</b>/<b>মুছুন</b> আইটেমগুলি সরাতে। আইটেমগুলি উপরে বা নীচে সরাতে <b>-</b>/<b>=</b> ব্যবহার করুন।
ca: Afegeix i edita atributs de classe segons la sintaxi UML. • <tt>attr</tt> (nom, per defecte a la visibilitat pública) • <tt>+ attr: int</tt> (públic amb tipus) • <tt>+ attr: int[0..1]</tt> (públic, tipus i multiplicitat) • <tt># /attr: int # a note</tt> (protegit, derivat, amb observació) Premeu <b>Enter</b> per editar, <b>Retrocés</b>/<b>Suprimeix</b> per eliminar elements. Utilitzeu <b>-</b>/<b>=</b> per moure els elements amunt o avall.
id: Tambahkan dan edit atribut kelas sesuai dengan sintaks UML. • <tt>attr</tt> (nama, default untuk visibilitas publik) • <tt>+ attr: int</tt> (publik dengan tipe) • <tt>+ attr: int[0..1]</tt> (publik, jenis, dan multiplisitas) • <tt># /attr: int # a note</tt> (dilindungi, diturunkan, dengan komentar) Tekan <b>Enter</b> untuk mengedit, <b>Backspace</b>/<b>Delete</b> untuk menghapus item. Gunakan <b>-</b>/<b>=</b> untuk memindahkan item ke atas atau ke bawah.
ja: UML 構文に従ってクラス属性を追加および編集します。 • <tt> attr</tt> (名前、デフォルトはパブリック可視性) • <tt>+ attr: int</tt> (パブリック・ウィズ・タイプ) • <tt>+ attr: int[0.1]</tt> (パブリック、タイプ、多重度) • <tt># /attr: int # note</tt> (保護された、派生した、注釈付き) <b>Enter</b>を押して編集し、<b>バックスペース</b>/<b>削除</b>を押してアイテムを削除します。 <b>-</b>/<b>=</b>を使用して、アイテムを上下に移動します。
ko: UML 구문에 따라 클래스 특성을 추가하고 편집합니다. • <tt>attr</tt> (이름, 공개 가시성기본값) • <tt>+ attr: int</tt> (유형이 있는 공용) • <tt>+ attr: int[0..1]</tt> (공공, 유형 및 복합성) • <tt># / attr: int # 노트</tt> (보호, 파생, 발언) <b>Enter</b>를 눌러 편집하고, <b>백스페이스</b>/<b>삭제</b>를 눌러 항목을 제거합니다. <b>-</b>/<b>=</b>를 사용하여 항목을 위 또는 아래로 이동합니다.
sv: Lägg till och redigera klassattribut enligt UML-syntax. • <tt>attr</tt> (namn, standard för offentlig synlighet) • <tt>+ attr: int</tt> (offentligt med typ) • <tt>+ attr: int[0..1]</tt> (offentlig, typ och multiplicitet) • <tt># /attr: int # a note</tt> (skyddad, härledd, med anmärkning) Tryck <b>Enter</b> för att redigera <b>Backsteg</b>/<b>Delete</b> för att ta bort objekt. Använd <b>-</b>/<b>=</b> för att flytta objekt uppåt eller nedåt.

source: A
ar: أ
bn: একটি
ca: Un
id: SEBUAH
ja: ある

source: Components
ar: عناصر
bn: অঙ্গ
id: Komponen
ja: コンポーネント
ko: 구성요소
sv: Komponenter

source: Information Flow
ar: تدفق المعلومات
bn: তথ্য প্রবাহ
ca: Flux d'informació
id: Arus Informasi
ja: 情報フロー
ko: 정보 흐름
sv: Informationsflöde

source: Information Item (Class)
ar: عنصر المعلومات (فئة)
bn: তথ্য আইটেম (শ্রেণী)
ca: Element d'informació (classe)
id: Item Informasi (Kelas)
ja: 情報項目(クラス)
ko: 정보 항목(클래스)
sv: Informationsobjekt (klass)

source: Do Activity
ar: قم بنشاط
bn: ক্রিয়াকলাপ করুন
ca: Realitza l'activitat
id: Lakukan Aktivitas
ja: アクティビティを行う
ko: 활동 수행
sv: Gör aktivitet

source: Default Region
ar: المنطقة الافتراضية
bn: ডিফল্ট অঞ্চল
ca: Regió per defecte
id: Wilayah Default
ja: 既定の領域
ko: 기본 지역
sv: Standardregion

source: History Pseudostate
ar: التاريخ الكاذب
bn: ইতিহাস Pseudostate
ca: Pseudoestat de l'historial
id: Sejarah Pseudostate
ja: 履歴擬似状態
ko: 기록 의사상태
sv: Historia Pseudostate

source: Note or Remark
ar: ملاحظة أو ملاحظة
bn: নোট বা মন্তব্য
ca: Nota o comentari
id: Catatan atau Catatan
ja: メモまたは注釈
ko: 참고 또는 발언
sv: Anmärkning eller anmärkning

source: Export as XMI
ar: تصدير كـ XMI
bn: XMI হিসাবে রপ্তানী করুন
ca: Exporta com a XMI
id: Ekspor sebagai XMI
ja: XMI としてエクスポート
ko: XMI로 내보내기
sv: Exportera som XMI

source: Export model as XMI (XML Model Interchange) format
ar: نموذج التصدير بتنسيق XMI (تبادل نموذج XML)
bn: এক্সএমআই (XML মডেল ইন্টারচেঞ্জ) বিন্যাস হিসাবে মডেল রপ্তানি করুন
ca: Model d'exportació com a format XMI (XML Model Interchange)
id: Ekspor model sebagai format XML (XML Model Interchange)
ja: XMI (XML モデル交換) 形式でモデルをエクスポート
ko: XMI(XML 모델 교환) 형식으로 모델을 내보내기
sv: Exportera modell som XMI-format (XML Model Interchange)

source: Export model as XMI file
ar: نموذج التصدير كملف XMI
bn: XMI ফাইল হিসাবে মডেল রপ্তানী করুন
ca: Exporta el model com a fitxer XMI
id: Ekspor model sebagai file XMI
ja: モデルを XMI ファイルとしてエクスポート
ko: 모델을 XMI 파일로 내보내기
sv: Exportera modell som XMI-fil

source: All XMI Files
ar: كافة ملفات XMI
bn: সকল XMI ফাইল
ca: Tots els fitxers XMI
id: Semua File XMI
ja: すべての XMI ファイル
ko: 모든 XMI 파일
sv: Alla XMI-filer

source: Copyright © 2001-2022 Arjan J. Molenaar and Dan Yeaw
ar: حقوق النشر © 2001-2022 Arjan J. Molenaar and Dan Yeaw
bn: কপিরাইট © ২০০১-২০২২ আরজান জে মোলেনার এবং ড্যান ইয়াও
ca: Drets d'autor © 2001-2022 Arjan J. Molenaar i Dan Yeaw
id: Hak Cipta © 2001-2022 Arjan J. Molenaar dan Dan Yeaw
ja: 著作権 © 2001-2022 アルジャン J. モレナールとダン・ヨー
ko: 저작권 © 2001-2022 아르잔 J. 몰레나르와 댄 예아우
sv: Upphovsrätt © 2001-2022 Arjan J. Molenaar och Dan Yeaw

source: Gaphor is the simple modeling tool written in Python
ar: Gaphor هي أداة نمذجة بسيطة مكتوبة بلغة Python
bn: গ্যাফর হ'ল পাইথনে লেখা সহজ মডেলিং টুল
ca: Gaphor és l'eina de modelatge simple escrita en Python
id: Gaphor adalah alat pemodelan sederhana yang ditulis dengan Python
ja: GaphorはPythonで書かれたシンプルなモデリングツールです
ko: 가포는 파이썬으로 작성한 간단한 모델링 도구입니다
sv: Gaphor är det enkla modelleringsverktyget skrivet i Python

source: Fork me on GitHub
ar: شوكة لي على جيثب
bn: আমাকে ফর্ক করুন উপর GitHub
ca: Em fa una forquilla a GitHub
id: Fork saya di GitHub
ja: GitHubで私をフォーク
sv: Förskansar mig på GitHub

source: Licensed under the Apache License, Version 2.0 (the "License"); you may not use this application except in compliance with the License. You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License. --- UML, SysML, and RAAML are either registered trademarks or trademarks of Object Management Group, Inc. in the United States and/or other countries.
ar: مُرخصة بموجب ترخيص Apache ، الإصدار 2.0 ("الترخيص") ؛ لا يجوز لك استخدام هذا التطبيق إلا بما يتوافق مع رخصة. يمكنك الحصول على نسخة من الترخيص على http://www.apache.org/licenses/LICENSE-2.0 ما لم يكن مطلوبًا بموجب القانون المعمول به أو تم الاتفاق عليه كتابةً ، البرنامج يتم توزيعها بموجب الترخيص يتم توزيعها على أساس "كما هي" ، بدون ضمانات أو شروط من أي نوع ، سواء صريح أو ضمني. انظر الترخيص للغة معينة تحكم الأذونات والقيود بموجب الترخيص. - UML و SysML و RAAML هي إما علامات تجارية مسجلة أو العلامات التجارية لشركة Object Management Group، Inc. في الولايات المتحدة و / أو دول أخرى.
bn: Apache লাইসেন্স, সংস্করণ 2.0 ("লাইসেন্স") এর অধীনে লাইসেন্সকৃত; আপনি এই অ্যাপ্লিকেশনটির সাথে সম্মতি ব্যতীত ব্যবহার করতে পারবেন না লাইসেন্স। আপনি লাইসেন্সের একটি অনুলিপি পেতে পারেন http://www.apache.org/licenses/LICENSE-2.0 যদি না প্রযোজ্য আইন দ্বারা প্রয়োজন হয় বা লিখিতভাবে সম্মত হয়, সফ্টওয়্যার লাইসেন্সের অধীনে বিতরণ করা হয় একটি "AS IS" ভিত্তিতে বিতরণ করা হয়, কোনও ধরণের ওয়ারেন্টি বা শর্ত ছাড়াই, হয় প্রকাশ বা অন্তর্নিহিত। নির্দিষ্ট ভাষার জন্য লাইসেন্স দেখুন লাইসেন্সের অধীনে অনুমতি এবং সীমাবদ্ধতাগুলি পরিচালনা করা। --- UML, SysML, এবং RAAML হয় নিবন্ধিত ট্রেডমার্ক বা মার্কিন যুক্তরাষ্ট্রে অবজেক্ট ম্যানেজমেন্ট গ্রুপ, ইনকর্পোরেটেড এর ট্রেডমার্ক এবং/অথবা অন্যান্য দেশ।
ca: Sota la llicència Apache, versió 2.0 (la "Llicència"); no podeu utilitzar aquesta aplicació, excepte en compliment de la Llicència. Podeu obtenir una còpia de la llicència a http://www.apache.org/licenses/LICENSE-2.0 Llevat que ho exigeixi la legislació aplicable o s'acordi per escrit, el programari distribuïts sota la Llicència es distribueixen sobre una base "TAL QUAL", SENSE GARANTIES NI CONDICIONS DE CAP TIPUS, TAMPOC expressa o implícita. Veure la llicència per a l'idioma específic que regeixen els permisos i les limitacions sota la llicència. --- UML, SysML i RAAML són marques registrades o marques comercials d'Object Management Group, Inc. als Estats Units i/o altres països.
id: Dilisensikan di bawah Lisensi Apache, Versi 2.0 ("Lisensi"); Anda tidak boleh menggunakan aplikasi ini kecuali sesuai dengan Lisensi. Anda dapat memperoleh salinan Lisensi di http://www.apache.org/licenses/LICENSE-2.0 Kecuali diwajibkan oleh hukum yang berlaku atau disetujui secara tertulis, perangkat lunak didistribusikan di bawah Lisensi didistribusikan pada DASAR "SEBAGAIMANA ADANYA", TANPA JAMINAN ATAU KETENTUAN APAPUN, baik tersurat atau tersirat. Lihat Lisensi untuk bahasa tertentu mengatur izin dan batasan berdasarkan Lisensi. --- UML, SysML, dan RAAML adalah merek dagang terdaftar atau merek dagang Object Management Group, Inc. di Amerika Serikat dan/atau negara lain.
ja: Apache ライセンス、バージョン 2.0 (「ライセンス」) の下でライセンス。 本アプリケーションは、以下の要件に従う場合を除き、使用することはできません。 ライセンス。ライセンスのコピーを取得することができます。 http://www.apache.org/licenses/LICENSE-2.0 適用法で要求される場合、または書面で同意しない限り、ソフトウェア ライセンスの下で配布され、「AS IS」ベースで配布され、 保証またはいかなる種類の条件も含まない 明示的または黙示的な。特定の言語のライセンスを参照してください。 ライセンスに基づくアクセス許可と制限を管理します。 --- UML、システム、および RAAML は、登録商標または 米国におけるオブジェクト管理グループの商標 その他の国。
ko: 아파치 라이센스, 버전 2.0 ("라이센스")에 따라 라이센스; 귀하는 이 응용 프로그램을 준수하지 않을 수 있습니다. 면허. 라이선스 사본을 받을 수 있습니다. http://www.apache.org/licenses/LICENSE-2.0 관련 법률에서 요구하거나 서면으로 동의하지 않는 한 소프트웨어 라이센스에 따라 배포되는 것은 "AS IS" 기초에 배포되며, 어떤 종류의 보증이나 조건없이, 어느 쪽이든 표현하거나 암시합니다. 특정 언어에 대한 라이선스 보기 라이센스에 따라 권한 및 제한 을 관리합니다. --- UML, SysML 및 RAAML은 등록 상표 또는 미국 내 객체 관리 그룹, Inc.의 상표 및/또는 기타 국가.
sv: Licensierad under Apache-licensen, version 2.0 ("Licensen"). du får inte använda den här applikationen förutom i enlighet med Licens. Du kan få en kopia av Licensen på http://www.apache.org/licenses/LICENSE-2.0 Om det inte krävs enligt tillämplig lag eller skriftligen, distribueras under Licensen distribueras på grundval av "AS IS", UTAN GARANTIER ELLER VILLKOR AV NÅGOT SLAG, ANTINGEN uttryckligt eller underförstått. Se licensen för det specifika språket styrande behörigheter och begränsningar enligt licensen. --- UML, SysML och RAAML är antingen registrerade varumärken eller varumärken som tillhör Object Management Group, Inc. i USA och/eller andra länder.

source: Application
ar: طلب
bn: প্রয়োগ
ca: Aplicació
id: Aplikasi
ja: アプリケーション
ko: 프로그램
sv: Tillämpning

source: New Window
ar: نافذة جديدة
bn: নতুন উইন্ডো
ca: Finestra nova
id: Jendela baru
ja: 新しいウィンドウ
ko: 새 창
sv: Nytt fönster

source: Open
ar: فتح
bn: খুলুন
ca: Obrir
id: Membuka
ja: 開ける
ko: 열기
sv: Öppna

source: Save As
ar: حفظ باسم
bn: এইরূপে সংরক্ষণ করুন
ca: Anomena i desa
id: Simpan Sebagai
ja: 名前を付けて保存
ko: 다른 이름으로 저장
sv: Spara som

source: Diagrams
ar: المخططات
bn: ডায়াগ্রাম
ca: Diagrames
id: diagram
ja: 図
ko: 다이어그램
sv: Diagram

source: Edit
ar: تعديل
bn: সম্পাদনা
ca: Editar
id: Sunting
ja: 編集
ko: 편집
sv: Redigera

source: main
ar: الأساسية
bn: মূল
ca: principal
id: utama
ja: メイン
ko: 메인
sv: huvudsaklig

source: Stakeholder Requirements
ar: متطلبات أصحاب المصلحة
bn: স্টেকহোল্ডারের প্রয়োজনীয়তা
ca: Requisits de les parts interessades
id: Persyaratan Pemangku Kepentingan
ja: ステークホルダーの要件
ko: 이해 관계자 요구 사항
sv: Krav på intressenter

source: System Requirements
ar: متطلبات النظام
bn: সিস্টেমের আবশ্যকতা
ca: Requisits del sistema
id: Persyaratan sistem
ja: システム要件
ko: 시스템 요구 사항
sv: Systemkrav

source: Actuator Command
ar: قيادة المحرك
bn: Actuator কমান্ড
ca: Ordre de l'actuador
id: Perintah Aktuator
ja: アクチュエータコマンド
ko: 액추에이터 커맨드
sv: Ställdon, kommando

source: Example Technolgy Requirement
ar: مثال على متطلبات التكنولوجيا
bn: উদাহরণ প্রযুক্তিগত প্রয়োজনীয়তা
ca: Exemple de requisit de tecnologia
id: Contoh Persyaratan Teknologi
ja: 例テクノギー要件
ko: 예 기술 요구 사항
sv: Exempel på teknikkrav

source: All Gaphor Models
ar: جميع موديلات جافور
bn: সমস্ত Gaphor মডেল
ca: Tots els models de Gaphor
id: Semua Model Gaphor
ja: すべてのガプホルモデル
ko: 모든 가포 모델
sv: Alla Gaphor-modeller

source: {filename} is already opened. Do you want to switch to the opened window instead?
ar: {اسم الملف} مفتوح بالفعل. هل تريد التبديل إلى النافذة المفتوحة بدلاً من ذلك؟
bn: {filename} ইতিমধ্যে খোলা আছে। আপনি কি এর পরিবর্তে খোলা উইন্ডোতে স্যুইচ করতে চান?
ca: El {filename} ja està obert. Voleu canviar a la finestra oberta?
id: {filename} sudah dibuka. Apakah Anda ingin beralih ke jendela yang terbuka?
ja: {filename} は既に開いています。 代わりに開いたウィンドウに切り替えたいですか?
ko: {filename}을(를) 이미 열었습니다. 이미 열어둔 창으로 대신 전환하시겠습니까?
sv: {filename} har redan öppnats. Vill du byta till det öppnade fönstret i stället?

source: Drag to diagram is (temporarily) limited to Classifiers, Packages, and Properties, not {type}.
ar: السحب للرسم التخطيطي (مؤقتًا) يقتصر على المصنفات والحزم والخصائص ، وليس {type}.
bn: ডায়াগ্রামে টেনে আনুন (অস্থায়ীভাবে) ক্লাসিফায়ার, প্যাকেজ এবং বৈশিষ্ট্যগুলিতে সীমাবদ্ধ, {type} নয়।
ca: Arrossegar al diagrama es limita (temporalment) a classificadors, paquets i propietats, no a {type}.
id: Seret ke diagram (sementara) terbatas pada Pengklasifikasi, Paket, dan Properti, bukan {type}.
ja: 図へのドラッグは、分類子、パッケージ、およびプロパティに限定され、{type}ではありません。
ko: 다이어그램으로 (임시로) 끌어다 놓는 동작은 {type} 형식이 아닌 Classifiers, Packages, Properties에 한정합니다.
sv: Dra till diagrammet är (tillfälligt) begränsat till Klassificerare, Paket och Egenskaper, inte {type}.
