Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Show Values
ar: إظهار القيم
bn: মানসমূহ প্রদর্শন করুন
ca: Mostra els valors
cs: Zobrazit hodnoty
fi: Näytä arvot
fr: Afficher les Valeurs
hi: मान दिखाएं
hr: Prikaži vrijednosti
id: Tampilkan Nilai
it: Mostra valori
ja: 値の表示
ko: 값 표시
nl: Waarden tonen
pt_br: Mostrar Valores
ru: Показать Значения
sv: Visa värden
tr: Değerleri Göster
uk: Показати значення

source: Aggregation
ar: تجميع
bn: একত্রীকরণ
ca: Agregació
cs: Agregace
fi: Yhdistäminen
fr: Agrégation
hi: एकत्रीकरण
hr: Agregacija
id: Pengumpulan
it: Aggregazione
ja: 集合体
ko: 응집
nl: Aggregatie
pt_br: Agregação
ru: Агрегация
sv: Aggregering
tr: Toplama
uk: Агрегація

source: No aggregation
ar: لا تجميع
bn: কোনও একত্রীকরণ নেই
ca: Sense agregació
cs: Žádná akregace
fi: Ei yhdistämistä
fr: Pas d'agrégation
hi: कोई एकत्रीकरण नहीं
hr: Bez agregacije
id: Tidak ada agregasi
it: Nessuna aggregazione
ja: 集計なし
ko: 응집안함
nl: Geen aggregatie
pt_br: Nenhuma agregação
ru: Без агрегации
sv: Ingen aggregering
tr: Toplama yok
uk: Немає агрегації

source: Shared
ar: مشترك
bn: অংশীদারি
ca: Compartit
cs: Společný
fi: Jaettu
fr: Partagé
hi: साझा किया गया
hr: Dijeljenjo
id: Bersama
it: Condivisa
ja: シェアード
ko: 공유함
nl: Gedeeld
pt_br: Compartilhado
ru: Совместный
sv: Delad
tr: Paylaşılmış
uk: Спільний доступ

source: Composite
ar: مركب
bn: কম্পোজিট
ca: Compost
cs: Kompozitní
fi: Komposiitti
hi: समग्र
hr: Sastavljeno
id: Gabungan
it: Composito
ja: 複合
ko: 요소
nl: Composiet
pt_br: Composto
ru: Составной
sv: Sammansättning
tr: Bileşik
uk: Композитний

source: Text
ar: نص
bn: পাঠ্য বার্তা
ca: SMS
fi: Teksti
fr: Texte
hi: पाठ
hr: Tekst
id: Teks
it: Testo
ja: テキスト
ko: 텍스트
nl: Tekst
pt_br: Texto
ru: Текст
sv: SMS
tr: Metin
uk: Текст

source: Show text
fi: Näytä teksti
fr: Montrer le texte
hr: Prikaži tekst
it: Mostra testo
nl: Toon tekst
ru: Показывать текст
uk: Показати текст

source: sourceContext: {name}
hi: स्रोत संदर्भ: {name}
hr: izvorni kontekst: {name}
it: contestoFonte: {name}
nl: BronContext: {name}
pt_br: contextoFonte: {name}
tr: kaynakBağlam: {name}
uk: джерело контексту: {name}

source: Internal Blocks
ar: الكتل الداخلية
bn: অভ্যন্তরীণ ব্লকসমূহ
ca: Blocs interns
cs: Interní bloky
fi: Sisäiset lohkot
fr: Blocs Internes
hi: आंतरिक ब्लॉक
hr: Interni blokovi
id: Blok Internal
it: Blocchi Interni
ja: 内部ブロック
ko: 내부 블록
nl: Interne blokken
pt_br: Blocos Internos
ru: Внутренние Блоки
sv: Interna block
tr: Dahili Bloklar
uk: Внутрішні блоки

source: Connector
ar: موصل
bn: সংযোজক
cs: Konektor
fi: Yhdistäjä
fr: Connecteur
hi: कनेक्टर
hr: Spojnica
id: Penyambung
it: Connettore
ja: コネクタ
ko: 연결
pt_br: Conector
ru: Соединитель
sv: Kontakt
tr: Bağlayıcı
uk: Роз'єм

source: Property
ar: ملكية
bn: বিশিষ্টতা
ca: Propietat
cs: Vlastnost
fi: Ominaisuus
fr: Propriété
hi: प्रॉपर्टी
hr: Svojstvo
id: Properti
it: Proprietà
ja: 財産
ko: 속성
nl: Eigenschap
pt_br: Propriedade
ru: Свойство
sv: Egenskap
tr: Özellik
uk: Власність

source: Proxy Port
ar: منفذ الوكيل
bn: প্রক্সি পোর্ট
ca: Port intermediari
fi: Proxyn portti
fr: Port Proxy
hi: प्रॉक्सी पोर्ट
hr: Proxy priključak
id: Pelabuhan Proksi
it: Porta proxy
ja: プロキシ ポート
ko: 프록시 포트
nl: Proxy-poort
pt_br: Porta Proxy
ru: Порт Прокси
tr: Vekil Sunucu Bağlantı Noktası
uk: Порт проксі

source: Block Definition Diagram
fi: Lohkomäärityskaavio
fr: Diagramme de Définition de Bloc
hr: Dijagram definicije blokova
it: Diagramma definizione blocco
nl: Blok­definitie­diagram
ru: Диаграмма Определения Блоков
uk: Діаграма визначення блоку

source: New Package
cs: Nový balíček
fi: Uusi pakkaus
fr: Nouveau Paquet
hi: नया पैकेज
hr: Novi paket
it: Nuovo Pacchetto
nl: Nieuw pakket
pt_br: Novo Pacote
ru: Новый пакет
tr: Yeni Paket
uk: Новий пакет

source: Internal Block Diagram
fi: Sisäisen lohkon kaavio
fr: Diagramme de Bloc Interne
hr: Dijagram internih blokova
it: DIagramma a blocchi interni
nl: Intern blok­diagram
ru: Внутренняя Блок-схема
uk: Внутрішня блок-схема

source: New Block
cs: Nový blok
fi: Uusi lohko
fr: Nouveau Bloc
hi: नया ब्लॉक
hr: Novi blok
it: Nuovo blocco
nl: Nieuw blok
pt_br: Novo Bloco
ru: Новый Блок
tr: Yeni Blok
uk: Новий блок

source: Package Diagram
fi: Pakkauskaavio
fr: Diagramme de Paquet
hr: Dijagram paketa
it: Diagramma pacchetto
nl: Pakket­diagram
ru: Диаграмма Пакетов
uk: Діаграма упаковки

source: Requirement Diagram
fi: Vaatimuskaavio
fr: Diagramme d'Exigence
hr: Dijagram uvjeta
it: Diagramma requisito
nl: Vereisten­diagram
ru: Диаграмма Требований
uk: Діаграма вимог

source: New Activity
cs: Nová aktivita
fi: Uusi aktiviteetti
fr: Nouvelle Activité
hi: नई गतिविधि
hr: Nova aktivnost
it: Nuova attività
nl: Nieuwe activiteit
pt_br: Nova Atividade
ru: Новая Деятельность
tr: Yeni Etkinlik
uk: Нова діяльність

source: New Interaction
cs: Nové interakce
fi: Uusi interaktio
fr: Ajouter une interaction
hi: नया इंटरैक्शन
hr: Nova interakcija
it: Nuova interazione
nl: Nieuwe interactie
pt_br: Nova Interação
ru: Новое Взаимодействие
tr: Yeni Etkileşim
uk: Нова взаємодія

source: New State Machine
cs: Nový stavový stroj
fi: Uusi tilakone
fr: Ajouter une machine à états
hi: नई स्टेट मशीन
hr: Novi automat konačnih stanja
it: Nuova macchina di stato
nl: Nieuwe staat­machine
pt_br: Nova Máquina de Estados
ru: Новый Конечный Автомат
tr: Yeni Durum Makinesi
uk: Нова державна машина

source: Use Case Diagram
fi: Käyttötapauskaavio
fr: Diagramme des Cas d'Utilisation
hr: Dijagram slučaja korištenja
it: Diagramma caso d'uso
nl: Doeleinde­diagram
pt_br: Diagrama de Caso de Uso
ru: Диаграмма Прецедентов
uk: Діаграма варіантів використання

source: Actor
ar: الممثل
bn: অভিনেতা
cs: Herec
fi: Toimija
fr: Acteur
hi: अभिनेता
hr: Sudionik
id: Aktor
it: Attore
ja: 俳優
ko: 액터
nl: Acteur
pt_br: Ator
ru: Актор
sv: Skådespelare
tr: Eylemci
uk: Актор

source: Block
ar: منع
bn: অবরোধ
ca: Bloc
cs: Blok
fi: Lohko
fr: Bloc
hi: ब्लॉक
hr: Blok
id: Memblokir
it: Blocco
ja: ブロック
ko: 블록
nl: Blok
pt_br: Bloco
ru: Блок
tr: Blok
uk: Блокувати

source: Interface Block
fi: Rajapintalohko
fr: Bloc d'Interface
hr: Blok sučelja
it: Blocco interfaccia
nl: Interfaceblok
pt_br: Bloco de Interface
ru: Интерфейс Блок
uk: Інтерфейсний Блок

source: Requirement
ar: متطلبات
bn: আবশ্যকতা
ca: Requisit
cs: Požadavek
fi: Vaatimus
fr: Exigence
hi: आवश्यकता
hr: Uvjet
id: Persyaratan
it: Requisito
ja: 要件
ko: 요구
nl: Vereiste
pt_br: Requisito
ru: Требование
sv: Krav
tr: Gereksinim
uk: Вимога

source: Use Case
fi: Käyttötapaus
fr: Cas d'Utilisation
hr: Slučaj primjene
it: Caso d'uso
nl: Doeleinde
pt_br: Caso de Uso
ru: Прецедент
uk: Випадок Використання

source: Value Type
fi: Arvotyyppi
fr: Type de valeur
hr: Vrsta vrijednosti
it: Tipo valore
nl: WaardeType
ru: Тип значения
uk: Тип значення

source: Allocations
cs: Přidělení
fi: Kohdistukset
fr: Attributions
hi: आवंटन
hr: Dodjeljivanja
it: Allocazioni
nl: Toewijzingen
pt_br: Alocações
ru: Привязки
tr: Ayırmalar
uk: Виділення

source: Allocate
cs: Přidělit
fi: Kohdista
fr: Affecter
hi: आवंटित करें
hr: Dodijeli
it: Alloca
nl: Toewijzen
pt_br: Alocar
ru: Привязка
tr: Ayır
uk: Виділити

source: allocate
cs: přidělit
fi: kohdista
fr: affecter
hi: आवंटित करें
hr: dodijeli
it: alloca
nl: toewijzen
pt_br: alocar
ru: привязка
tr: ayır
uk: виділяти

source: ControlStructure
ar: هيكل التحكم
cs: KontrolníStruktura
fi: KontrolliRakenne
fr: Structure de Contrôle
hi: नियंत्रणसंरचना
hr: Struktura kontrole
id: Struktur Kontrol
it: StrutturaControllo
ja: コントロール構造
ko: 제어구조
nl: ControleStructuur
pt_br: EstruturaControle
ru: СтруктураУправления
sv: Kontrollstruktur
tr: DenetlemeYapısı

source: block
ar: منع
bn: অবরোধ
ca: bloc
cs: blokovat
fi: lohko
fr: Bloc
hi: ब्लॉक
hr: blok
id: memblokir
it: blocco
ja: ブロック
ko: 차단
nl: blok
pt_br: bloco
ru: блок
tr: blok
uk: блок

source: parts
ar: القطع
bn: অংশ
cs: části
fi: osat
fr: pièces
hi: भाग
hr: dijelovi
id: bagian
it: parti
ja: パーツ
ko: 부분
nl: onderdelen
pt_br: partes
ru: части
sv: delar
tr: parçalar
uk: частин

source: references
ar: المراجع
bn: তথ্যসূত্র
ca: Referències
cs: Reference
fi: viittaukset
fr: références
hi: संदर्भ
hr: reference
id: referensi
it: riferimenti
ja: 参照
ko: 참조
nl: referenties
pt_br: referências
ru: ссылки
sv: referenser
tr: referanslar
uk: властивість

source: values
ar: القيم
bn: মানসমূহ
ca: Valors
cs: hodnoty
fi: arvot
fr: valeurs
hi: मान
hr: vrijednosti
id: nilai-nilai
it: valori
ja: 価値観
ko: 값
nl: waarden
pt_br: valores
ru: значения
sv: värden
tr: değerler
uk: значення

source: operations
cs: operace
fi: toiminnot
fr: opérations
hi: अभियान
hr: operacije
it: operazioni
nl: handelingen
pt_br: operações
ru: методы
tr: işlemler
uk: операції

source: unnamed
ar: غير مسمى
bn: নামবিহীন
ca: sense nom
cs: nejmenovaný
fi: nimetön
fr: sans nom
hi: अनाम
hr: neimenovano
id: tidak disebutkan namanya
it: senza nome
ja: 無名
ko: 이름없음
nl: naamloos
pt_br: sem nome
ru: безымянный
sv: namnlös
tr: adsız
uk: безіменний

source: Blocks
ar: كتل
bn: ব্লকসমূহ
ca: Blocs
cs: Bloky
fi: Lohkot
fr: Blocs
hi: ब्लॉक
hr: Blokovi
id: Blok
it: Blocchi
ja: ブロック
ko: 블록(복수)
nl: Blokken
pt_br: Blocos
ru: Блоки
sv: Block
tr: Bloklar
uk: Блоки

source: InterfaceBlock
fi: Rajapinta
fr: Bloc Interface
hi: इंटरफ़ेसब्लॉक
hr: blok sučelja
it: Blocco interfaccia
nl: InterfaceBlok
pt_br: BlocoInterface
ru: ИнтерфейсБлок
tr: ArayüzBloğu
uk: Інтерфейсний блок

source: Composite Association
ar: الرابطة المركبة
bn: কম্পোজিট এসোসিয়েশন
ca: Associació Composta
cs: Kompozitní asociace
fi: Komposiitti assosisaatio
fr: Association Composite
hi: समग्र संबंध
hr: Sastavljena veza
id: Asosiasi Gabungan
it: Associazione composita
ja: 複合アソシエーション
ko: 요소 연관
nl: Composietassociatie
pt_br: Associação Composta
ru: Составная Ассоциация
sv: Sammansatt association
tr: Bileşik İlişkilendirme
uk: Композитна асоціація

source: Shared Association
ar: جمعية مشتركة
bn: শেয়ারকৃত সমিতি
ca: Associació compartida
cs: Sdílené sdružení
fi: Jaettu assosisaatio
fr: Association Partagée
hi: साझा संबंध
hr: Dijeljena veza
id: Asosiasi Bersama
it: Associazione condivisa
ja: 共有アソシエーション
ko: 공유 연관
nl: Gedeelde associatie
pt_br: Associação Compartilhada
ru: Общая Ассоциация
sv: Delad association
tr: Paylaşılmış İlişkilendirme
uk: Спільна асоціація

source: Association
ar: جمعية
bn: অ্যাসোসিয়েশন
ca: Associació
cs: Asociace
fi: Assosisaatio
hi: संबंध
hr: Veza
id: Asosiasi
it: Associazione
ja: 協会
ko: 연관
nl: Associatie
pt_br: Associação
ru: Ассоциация
sv: Förening
tr: İlişkilendirme
uk: Асоціація

source: Direct Association
cs: Přímá asociace
fi: Suora yhdistys
fr: Association Directe
hi: प्रत्यक्ष संबंध
hr: Direktna veza
it: Associazione diretta
nl: Directe associatie
pt_br: Associação Direta
ru: Прямая Ассоциация
tr: Doğrudan İlişkilendirme
uk: Пряма асоціація

source: ValueType
ar: نوع القيمة
bn: মানপ্রকার
ca: Tipus de valor
cs: Typ hodnoty
fi: ArvoTyyppi
fr: TypeValeur
hi: मान प्रकार
hr: Vrsta vrijednosti
id: Tipe Nilai
it: Tipo valore
ja: 値の種類
ko: 값 형식
nl: WaardeType
pt_br: Tipo de Valor
ru: ТипЗначения
tr: DeğerTürü

source: Primitive
ar: بدائي
bn: আদিম
ca: Primitiu
cs: Primitivní
fi: Primitiivi
hi: आदिम
hr: Osnovni element
id: Primitif
it: Primitivo
ja: 原始的
ko: 원시
nl: Primitief
pt_br: Primitivo
ru: Примитив
sv: Primitiv
tr: İlkel
uk: Примітивний

source: interfaceblock
fi: rajapinta
fr: bloc interface
hi: इंटरफ़ेसब्लॉक
hr: blok sučelja
it: blocco interfaccia
nl: interfaceblok
pt_br: blocointerface
ru: интерфейсблок
tr: arayüzbloğu
uk: інтерфейсний блок

source: satisfy
ar: رضا
bn: সন্তুষ্ট
ca: satisfer
cs: uspokojit
fi: tyydytä
fr: satisfait
hi: संतुष्ट
hr: zadovolji
id: memuaskan
it: soddisfa
ja: 満たす
ko: 만족시키다
nl: voldoen
pt_br: satisfazer
ru: удовлетворяет
sv: tillfredsställa
tr: karşıla
uk: задовольнити

source: deriveReqt
ar: اشتق
bn: প্রাপ্তReqt
fr: exigDerivée
hi: व्युत्पन्नआवश्यकता
hr: izvedi zahtjev
id: turunanReqt
ja: 派生Reqt
ko: 파생된 Reqt
pt_br: Derivar Requisição
ru: выводитТребов
tr: türetmeGereksinimi

source: trace
ar: أثر
bn: ট্রেস
ca: traça
cs: stopa
fi: jälki
fr: tracé
hi: ट्रेस
hr: trag
id: jejak
it: traccia
ja: 跡
ko: 자취
nl: volgen
pt_br: rastrear
ru: отслеживает
sv: spåra
tr: izle
uk: слід

source: verify
ar: تحقق
bn: যাচাই
ca: verificar
cs: ověřit
fi: vahvista
fr: vérifier
hi: सत्यापन करें
hr: provjeri
id: memeriksa
it: verifica
ja: 確かめる
ko: 확인
nl: verifiëren
pt_br: verificar
ru: проверяет
sv: kontrollera
tr: doğrula
uk: перевірити

source: refine
ar: صقل
bn: পরিমার্জন
ca: refinar
cs: upřesnit
fi: tarkenna
fr: affiner
hi: परिष्कृत करें
hr: razradi
id: menyaring
it: perfeziona
ja: 磨く
ko: 다듬다
nl: verfijnen
pt_br: refinar
ru: очищает
sv: förfina
tr: arıt
uk: доопрацювати

source: requirement
ar: متطلبات
bn: আবশ্যকতা
ca: requisit
cs: požadavek
fi: vaatimus
fr: exigence
hi: आवश्यकता
hr: uvjet
id: persyaratan
it: requisito
ja: 要件
ko: 요구
nl: vereiste
pt_br: requisito
ru: требование
sv: krav
tr: gereksinim
uk: вимога

source: Requirements
ar: متطلبات
bn: প্রয়োজনীয়তা
ca: Requisits
cs: Požadavky
fi: Vaatimukset
fr: Exigences
hi: आवश्यकता
hr: Uvjeti
id: Persyaratan
it: Requisiti
ja: 必要条件
ko: 요구(복수)
nl: Vereisten
pt_br: Requisitos
ru: Требования
sv: Krav
tr: Gereksinimler
uk: Вимоги

source: Satisfy
ar: رضا
bn: সন্তুষ্ট করা
ca: Satisfer
cs: Uspokojit
fi: Tyydytä
fr: Satisfaire
hi: संतुष्ट करें
hr: Zadovolji
id: Memuaskan
it: Soddisfa
ja: 満たす
ko: 만족
nl: Voldoen
pt_br: Satisfazer
ru: Удовлетворить
sv: Tillfredsställa
tr: Karşıla
uk: Задовольнити

source: Derive Requirement
ar: اشتقاق الشرط
bn: প্রয়োজনীয়তা অর্জন করুন
ca: Requisit de derivació
cs: Odvození požadavku
fi: Johdannaisvaatimus
fr: Exigence Dérivée
hi: व्युत्पन्न आवश्यकता
hr: Izvedeni uvjet
id: Persyaratan Turunan
it: Deriva requisito
ja: 要件を導き出す
ko: 파생 요구 사항
nl: Afgeleide Eis
pt_br: Derivar Requisito
ru: Вывести Требование
sv: Härled krav
tr: Türetme Gereksinimi
uk: Вивести вимогу

source: Trace
ar: أثر
bn: ট্রেস
ca: Traça
cs: Stopa
fi: Jälki
fr: Tracer
hi: ट्रेस
hr: Precrtaj
id: Jejak
it: Traccia
ja: 跡
ko: 추적
nl: Volgen
pt_br: Rastrear
ru: Отслеживать
sv: Spåra
tr: İzle
uk: Слід

source: Refine
ar: صقل
bn: পরিমার্জন করুন
ca: Refinar
cs: Upřesnit
fi: Tarkenna
fr: Affiner
hi: परिष्कृत करें
hr: Razradi
id: Menyaring
it: Perfeziona
ja: 磨く
ko: 정제
nl: Verfijnen
pt_br: Refinar
ru: Очистить
sv: Förfina
tr: arıt
uk: Уточніть

source: Verify
ar: تحقق
bn: যাচাই
ca: Verificar
cs: Ověřit
fi: Vahvista
fr: Vérifier
hi: सत्यापन करें
hr: Provjeri
id: Memeriksa
it: Verifica
ja: 確かめる
ko: 검증
nl: Verifiëren
pt_br: Verificar
ru: Проверить
sv: Kontrollera
tr: Doğrula
uk: Підтвердити

source: Containment
ar: الاحتواء
bn: নিয়ন্ত্রন
ca: Contenció
cs: Omezení
fi: Eristäminen
fr: Confinement
hi: रोकथाम
hr: Sadrži
id: Penahanan
it: Contenimento
ja: 封じ込め
ko: 견제
nl: Insluiting
pt_br: Contenção
ru: Сдерживание
sv: Inneslutning
tr: Kapsama
uk: Стримування

source: (from {namespace})
ar: (من {namespace})
bn: ({namespace}থেকে)
ca: (de {namespace})
cs: (od {namespace})
fi: {namespace}):sta
fr: (de {namespace})
hi: ({namespace} से)
hr: (od {namespace})
id: (dari {namespace})
it: (da {namespace})
ja: ({名前空間から})
ko: ({namespace}에서)
nl: (uit {namespace})
pt_br: (de {namespace})
ru: (из {namespace})
sv: (från {namespace})
tr: ({namespace} kaynağından)
uk: (з {namespace})

source: Type
cs: Typ
fi: Tyyppi
hi: प्रकार
hr: Vrsta
it: Tipo
pt_br: Tipo
ru: Тип
tr: Tür
uk: Тип

source: Show Type
cs: Zobrazit typ
fi: Näytä tyyppi
fr: Montrer le Type
hi: प्रकार दिखाएं
hr: Prikaži vrstu
it: Mostra tipo
nl: Type tonen
pt_br: Mostrar Tipo
ru: Показать тип
tr: Türü Göster
uk: Показати тип

source: Removed unused elements from the model: they are not used in any other diagram.
ar: تمت إزالة العناصر غير المستخدمة من النموذج: لا يتم استخدامها في أي رسم تخطيطي آخر.
bn: মডেল থেকে অব্যবহৃত উপাদানগুলি অপসারণ করা হয়েছে: তারা অন্য কোনও চিত্রে ব্যবহার করা হয় না।
ca: S'eliminen els elements no utilitzats del model: no s'utilitzen en cap altre diagrama.
cs: Odstraněny nepoužívané prvky z modelu: nepoužívají se v žádném jiném diagramu.
fi: Poistettu käyttämättömät elementit mallista: ne eivät ole käytössä yhdessäkään kaaviossa.
fr: Suppression des éléments inutilisés du modèle : ils ne sont utilisés dans aucun autre diagramme.
hi: मॉडल से अप्रयुक्त तत्वों को हटा दिया गया: उनका उपयोग किसी अन्य आरेख में नहीं किया गया।
hr: Iz modela su uklonjeni nekorišteni elementi: ne koriste se u nijednom drugom dijagramu.
id: Menghapus elemen yang tidak digunakan dari model: elemen tersebut tidak digunakan dalam diagram lainnya.
it: RImosso elementi non usati dal modello: non sono utilizzati in nessun altro diagramma.
ja: モデルから未使用の要素を削除: 他の図では使用されません。
ko: 모델에서 사용되지 않는 요소를 제거: 다른 다이어그램에는 사용되지 않습니다.
nl: Ongebruikte elementen zijn uit model verwijderd: ze waren niet meer in gebruik.
pt_br: Elementos não usados do modelo foram removidos; eles não são usados em nenhum outro diagrama.
ru: Удалены неиспользуемые элементы из модели: они не используются ни в одной другой диаграмме.
sv: Borttagna oanvända element från modellen: de används inte i något annat diagram.
tr: Kullanılmayan ögeler modelden kaldırıldı: başka hiçbir diyagramda kullanılmazlar.
uk: Видалені невикористані елементи з моделі: вони не використовуються в жодній іншій діаграмі.

source: Component Diagram
fi: Komponenttikaavio
fr: Diagramme de Composant
hr: Dijagram komponenti
it: Diagramma componenti
nl: Componenten diagram
ru: Диаграмма компонентов
uk: Діаграма Компонентів

source: Deployment Diagram
fi: Käyttöönottokaavio
fr: Diagramme de Déploiement
hr: Dijagram implementacije
it: Diagramma di distribuzione
nl: Inzettings­diagram
ru: Диаграмма Развёртывания
uk: Схема розгортання

source: Communication Diagram
fi: Kommunikaatiokaavio
fr: Diagramme de Communication
hr: Dijagram komunikacije
it: Diagramma di comunicazione
nl: Communicatie­diagram
ru: Диаграмма Коммуникации
uk: Діаграма зв'язку

source: Profile Diagram
fi: Profiilikaavio
fr: Diagramme de Profile
hr: Dijagram profila
it: Diagramma profilo
nl: Profiel­diagram
ru: Диаграмма Профилей
uk: Схема профілю

source: Artifact
ar: الأداة
ca: Artefacte
cs: Artefakt
fi: Artefakti
fr: Artéfact
hi: विरूपण-साक्ष्य
hr: Artefakt
id: Artefak
it: Artefatto
ja: アーティファクト
ko: 인위요소
nl: Artefact
pt_br: Artefato
ru: Артефакт
sv: Artefakt
tr: Yapıt
uk: Артефакт

source: Device
ar: جهاز
bn: ডিভাইস
ca: Dispositiu
cs: Zařízení
fi: Laite
fr: Dispositif
hi: उपकरण
hr: Uređaj
id: Perangkat
it: Dispositivo
ja: デバイス
ko: 장치
nl: Apparaat
pt_br: Dispositivo
ru: Устройство
sv: Apparat
tr: Aygıt
uk: Пристрій

source: Instance Specification
fi: Instanssispesifikaatio
fr: Spécification d'une Instance
hr: Specifikacija instance
it: Specifica istanza
nl: Instantie­specificatie
ru: Спецификация экземпляра
uk: Специфікація екземпляра

source: Interface
ar: واجهه المستخدم
bn: ইন্টারফেস
ca: Interfície
cs: Rozhraní
fi: Rajapinta
hi: इंटरफ़ेस
hr: Sučelje
id: Antarmuka
it: Interfaccia
ja: インターフェイス
ko: 인터페이스
ru: Интерфейс
sv: Gränssnitt
tr: Arayüz
uk: Інтерфейс

source: Node
ar: العقدة
bn: নোড
fi: Solmu
fr: Nœud
hi: नोड
hr: Čvor
id: simpul
it: Nodo
ja: ノード
ko: 노드
nl: Knoop
pt_br: Nó
ru: Узел
sv: Nod
tr: Düğüm
uk: Вузол

source: Profile
ar: الملف الشخصي
bn: প্রোফাইল
ca: Perfil
cs: Profil
fi: Profiili
fr: Profil
hi: प्रोफाइल
hr: Profil
id: Profil
it: Profilo
ja: プロフィール
ko: 프로파일
nl: Profiel
pt_br: Perfil
ru: Профиль
sv: Profil
tr: Profil
uk: Профіль

source: Stereotype
ar: الصورة النمطية
bn: স্টেরিওটাইপ
ca: Estereotip
cs: Stereotyp
fi: Stereotyyppi
fr: Stéréotype
hi: टकसाली
hr: Stereotip
id: Stereotip
it: Stereotipo
ja: ステレオタイプ
ko: 이중형식
pt_br: Estereótipo
ru: Стереотип
sv: Stereotyp
tr: Stereotip
uk: Стереотип

source: New {name}
ar: جديد {name}
bn: নতুন {name}
ca: Crea un {name}
cs: Nové {name}
fi: Uusi {name}
fr: Nouvel(le) {name}
hi: नया {name}
hr: Nova {name}
id: {name} baru
it: Nuovo {name}
ja: 新しい {name}
ko: 새 {name}
nl: Nieuw {name}
pt_br: Novo {name}
ru: Новый {name}
sv: Nytt {namn}
tr: Yeni {name}
uk: Новий {name}

source: <None>
ar: <بلا>
ca: <Cap>
fi: <Ei mitään>
fr: <Aucun>
hr: <Bez>
id: <Tidak ada>
it: <Nessuno>
ko: <없음>
nl: <geen>
pt_br: <Nenhum>
ru: <Пусто>
tr: <Yok>
uk: <жодного>

source: <Relationships>
ar: <العلاقات>
cs: <Vztahy>
fi: <Suhteet>
fr: <Relations>
hr: <Odnosi>
id: <Hubungan>
it: <Relazioni>
nl: <relaties>
pt_br: <Relacionamentos>
ru: <Отношения>
tr: <İlişkiler>
uk: <стосунки>

source: supplier: {name}
cs: dodavatel: {name}
fi: toimittaja: {name}
fr: fournisseur : {name}
hi: प्रदायक: {name}
hr: dobavljač: {name}
it: fornitore: {name}
nl: leverancier: {name}
pt_br: fornecedor: {name}
ru: поставщик: {name}
tr: tedarikçi: {name}
uk: постачальник: {name}

source: readOnly
fi: vain luku
fr: LectureSeule
hr: samo za čitanje
it: solaLettura
nl: Alleen lezen
ru: только для чтения
uk: тільки для читання

source: general: {name}
cs: obecné: {name}
fi: yleinen: {name}
fr: général : {name}
hi: सामान्य: {name}
hr: opće: {name}
it: generale: {name}
nl: algemeen: {name}
pt_br: geral: {name}
ru: общее: {name}
tr: genel: {name}
uk: загальний: {name}

source: extend: {name}
cs: rozšířit: {name}
fi: laajenna: {name}
fr: étendre : {name}
hi: विस्तार करें: {name}
hr: proširi: {name}
it: estendi: {name}
nl: uitbreiden: {name}
pt_br: estende: {name}
ru: расширение: {name}
tr: genişlet: {name}
uk: розширити: {name}

source: include: {name}
cs: zahrnout: {name}
fi: sisällytä: {name}
fr: inclure : {name}
hi: शामिल करें: {name}
hr: uključi: {name}
it: includi: {name}
nl: omvatten: {name}
pt_br: inclui: {name}
ru: включение: {name}
tr: ekle: {name}
uk: включити: {name}

source: Swimlane One
ar: حارة واحدة
bn: Swimlene One
ca: Swimlane 1
fi: Uimarata yksi
fr: Couloir d'activité (swimlane) Un
hi: स्विमलेन एक
hr: Traka jedan
id: renang satu
it: Swimlane uno
ja: スイムレーン・ワン
ko: 스윔레인 원
nl: Zwembaan één
pt_br: Raia Um
ru: Первая Дорожка
sv: Swimlane Ett
tr: Kulvar Bir
uk: Свімлане Один

source: Swimlane Two
ar: الحارة الثانية
bn: Swimlene দুই
ca: Swimlane Dos
fi: Uimarata kaksi
fr: Couloir d'activité (swimlane) Deux
hi: स्विमलेन दो
hr: Traka dva
id: Kolam Renang Dua
it: Swimlane due
ja: スイムレーン2
ko: 스윔레인 2
nl: Zwembaan twee
pt_br: Raia Dois
ru: Вторая Дорожка
sv: Swimlane två
tr: Kulvar İki
uk: Swimlane два

source: Actions
ar: أجراءات
bn: ক্রিয়া
ca: Accions
cs: Akce
fi: Toiminnot
hi: कार्रवाइयां
hr: Radnje
id: tindakan
it: Azioni
ja: アクション
ko: 동작(복수)
nl: Acties
pt_br: Ações
ru: Действия
sv: Åtgärder
tr: Eylemler
uk: Дії

source: Action
ar: عمل
bn: ক্রিয়া
ca: Acció
cs: Akce
fi: Toiminto
hi: कार्रवाई
hr: Radnja
id: Tindakan
it: Azione
ja: アクション
ko: 동작
nl: Actie
pt_br: Ação
ru: Действие
sv: Handling
tr: Eylem
uk: Дія

source: Call behavior action
cs: Zavolat akci chování
fi: Kutsu käyttäytymistoimintaa
fr: Appelle action comportementale
hi: कॉल व्यवहार कार्रवाई
hr: Radnja pozivanja ponašanja
it: Azione di comportamento della chiamata
nl: Aanroep­gedrag­actie
pt_br: Ação de chamar comportamento
ru: Вызов действия Поведение
tr: Çağrı davranış eylemi
uk: Виклик поведінки дії

source: Value specification action
fi: ArvoMäärittelyToiminto
fr: Valeur de l'action spécifique
hi: मान विनिर्देशन कार्रवाई
hr: Radnja specifikacije vrijednosti
it: Azione di specificazione del valore
nl: Waarde­specificatie­actie
pt_br: Ação de especificação de valor
ru: Действие по значению спецификации
tr: Değer belirtim eylemi
uk: Дія визначення значення

source: Initial node
ar: العقدة الأولية
bn: প্রারম্ভিক নোড
ca: Node inicial
cs: Počáteční uzel
fi: Alkusolmu
fr: Nœud initial
hi: प्रारंभिक नोड
hr: Početni čvor
id: simpul awal
it: Nodo iniziale
ja: 初期ノード
ko: 초기 노드
nl: Initiële knoop
pt_br: Nó inicial
ru: Начальный узел
sv: Inledande nod
tr: İlk düğüm
uk: Початковий вузол

source: Activity final node
ar: عقدة النشاط النهائية
bn: ক্রিয়াকলাপ চূড়ান্ত নোড
ca: Node final de l'activitat
cs: Konečný uzel aktivity
fi: Aktiviteetin viimeinen solmu
fr: Nœud de fin d'activité
hi: गतिविधि अंतिम नोड
hr: Završni čvor aktivnosti
id: Node akhir aktivitas
it: Nodo finale attività
ja: アクティビティ最終ノード
ko: 활동 종단 노드
nl: Laatste activiteitsknoop
pt_br: Nó final de atividade
ru: Финальный узел деятельности
sv: Slutlig nod för aktivitet
tr: Etkinlikler son düğüm
uk: Кінцевий вузол діяльності
