Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Feature User Need
ar: حاجة المستخدم الميزة
bn: বৈশিষ্ট্য ব্যবহারকারীর প্রয়োজন
ca: Necessitat de l'usuari de característiques
cs: Funkce Potřeba uživatele
fi: Esittele käyttäjän tarve
fr: Fonctionnalité Besoin de l'utilisateur
hi: उपयोगकर्ता की सुविधा आवश्यकता
hr: Potrebe korisnika
id: Fitur Kebutuhan Pengguna
ja: 機能 ユーザーのニーズ
ko: 기능 사용자 필요
nl: Voldoen aan gebruikersbehoeften
pt_br: Característica que o Usuário Precisa
sv: Funktionsanvändarens behov
tr: Özellik Kullanıcı İhtiyacı
uk: Потреба користувача в функції

source: Logical Structure
ar: الهيكل المنطقي
bn: যৌক্তিক কাঠামো
ca: Estructura lògica
cs: Logická struktura
fi: Looginen rakenne
fr: Structure logique
hi: तार्किक संरचना
hr: Logička struktura
id: Struktur logis
ja: 論理構造
ko: 논리적 구조
nl: Logische structuur
pt_br: Estrutura Lógica
ru: Логическая Структура
sv: Logisk struktur
tr: Mantıksal Yapı
uk: Логічна структура

source: Sensor
ar: المستشعر
bn: সেন্সর
cs: Senzor
fi: Anturi
fr: Capteur
hi: सेंसर
hr: Senzor
ja: センサー
ko: 센서
ru: Сенсор
tr: Algılayıcı
uk: Датчик

source: sensor
ar: المستشعر
bn: সেন্সর
cs: senzor
fi: anturi
fr: capteur
hi: सेंसर
hr: senzor
ja: センサー
ko: 센서
ru: сенсор
tr: algılayıcı
uk: датчик

source: controller
ar: مراقب
bn: নিয়ন্ত্রক
ca: controlador
cs: řadič
fi: kontrolleri
fr: régulateur
hi: नियंत्रक
hr: kontroler
id: pengontrol
ja: コントローラ
ko: 컨트롤러
nl: bediener
pt_br: controlador
ru: контроллер
sv: kontrollant
tr: denetleyici
uk: контролер

source: Logical Boundary
ar: الحدود المنطقية
bn: যৌক্তিক সীমানা
ca: Límit lògic
cs: Logická hranice
fi: Looginen rajaus
fr: Limite Logique
hi: तार्किक सीमा
hr: Logička granica
id: Batas Logis
ja: 論理境界
ko: 논리 경계
nl: Logische grens
pt_br: Limite Lógico
ru: Логическая Граница
sv: Logisk gräns
tr: Mantıksal Sınır
uk: Логічна межа

source: Technology Structure
ar: هيكل التكنولوجيا
bn: প্রযুক্তি কাঠামো
ca: Estructura tecnològica
cs: Technologická struktura
fi: Teknologiarakenne
fr: Structure Technologique
hi: प्रौद्योगिकी संरचना
hr: Struktura tehnologije
id: Struktur Teknologi
ja: 技術構造
ko: 기술 구조
nl: Technologiestructuur
pt_br: Estrutura de Tecnologia
ru: Технологическая Структура
sv: Teknikstruktur
tr: Teknoloji Yapısı
uk: Структура Технології

source: Technology Boundary
ar: حدود التكنولوجيا
bn: প্রযুক্তি সীমানা
ca: Límit tecnològic
cs: Technologická hranice
fi: Teknologiarajaus
fr: Limites Technologique
hi: प्रौद्योगिकी सीमा
hr: Granica tehnologije
id: Batas Teknologi
ja: テクノロジーの境界
ko: 기술 경계
nl: Technologiegrens
pt_br: Limite de Tecnologia
ru: Технологическая Граница
sv: Teknikgräns
tr: Teknoloji Sınırı
uk: Кордон Технології

source: Technology Requirements
ar: متطلبات التكنولوجيا
bn: প্রযুক্তির প্রয়োজনীয়তা
ca: Requisits tecnològics
cs: Technologické požadavky
fi: Teknologiavaatimukset
fr: Exigences technologiques
hi: प्रौद्योगिकी आवश्यकताएं
hr: Tehnološki uvjeti
id: Persyaratan Teknologi
ja: 技術要件
ko: 기술 요구 사항
nl: Technologievereisten
pt_br: Requisitos de Tecnologia
ru: Технологические Требования
sv: Tekniska krav
tr: Teknoloji Gereksinimleri
uk: Технологічні Вимоги

source: Detailed Behavior
ar: سلوك مفصل
bn: বিস্তারিত আচরণ
ca: Comportament detallat
cs: Detailní chování
fi: Tarkennettu toiminta
fr: Comportement détaillé
hi: विस्तृत व्यवहार
hr: Detaljno ponašanje
id: Perilaku Terperinci
ja: 詳細な動作
ko: 자세한 동작
nl: Gedetailleerd gedrag
pt_br: Comportamento Detalhado
ru: Подробное Поведение
sv: Detaljerat beteende
tr: Ayrıntılı Davranış
uk: Детальна поведінка

source: Logical Requirements
fi: Loogiset vaatimukset
fr: Exigences logiques
hi: तार्किक आवश्यकताएं
hr: Logički uvjeti
nl: Logische Vereisten
pt_br: Requisitos Lógicos
ru: Логические Требования
tr: Mantıksal Gereksinimler
uk: Логічні вимоги

source: Logical States
ar: الدول المنطقية
bn: যৌক্তিক রাষ্ট্রসমূহ
ca: Estats lògics
cs: Logické stavy
fi: Loogiset tilat
fr: États logiques
hi: तार्किक स्थितियां
hr: Logička stanja
id: Keadaan logis
ja: 論理状態
ko: 논리 상태
nl: Logische staten
pt_br: Estados Lógicos
ru: Логические Состояния
sv: Logiska tillstånd
tr: Mantıksal Durumlar
uk: Логічні стани

source: Feature Event Flow
ar: ميزة تدفق الأحداث
bn: বৈশিষ্ট্য ইভেন্ট প্রবাহ
ca: Flux d'esdeveniments de característiques
cs: Průběh funkční události
fi: Esittele tapahtuman kulku
fr: Fonctionnalité de Flux d'événements
hi: फ़ीचर इवेंट प्रवाह
hr: Tok događaja
id: Alur Acara Fitur
ja: 機能イベントフロー
ko: 기능 이벤트 흐름
nl: Functiegebeurtenisstroom
pt_br: Fluxo de Eventos de Características
ru: Функция потока событий
sv: Händelseflöde för funktioner
tr: Özellik Olay Akışı
uk: Функція потоку подій

source: Off
ar: إيقاف
bn: বন্ধ
ca: Apagat
cs: Vypnout
fi: Pois
fr: Arrêt
hi: बंद
hr: Isključeno
id: Mati
ja: オフ
ko: 꺼져
nl: Uit
pt_br: Desligado
ru: Выключено
sv: Bort
tr: Kapalı
uk: Вимк

source: On
ar: تشغيل
bn: অন
ca: Sobre
cs: Zapnout
fi: Päällä
fr: Marche
hi: चालू
hr: Uključeno
id: Pada
ja: オン
ko: 에
nl: Aan
pt_br: Ligado
ru: Включено
sv: På
tr: Açık
uk: Увімк

source: actuator
ar: مشغل
bn: অ্যাকচুয়েটর
ca: actuador
cs: aktuátor
fi: toimilaite
fr: actionneur
hi: एक्चुएटर
hr: upravljač
id: penggerak
it: attuatore
ja: アクチュエータ
ko: 작동기
pt_br: atuador
ru: привод
sv: Ställdon
tr: çalıştırıcı
uk: привід

source: Use Case Function #1
ar: استخدم حالة الوظيفة # 1
bn: কেস ফাংশন #1 ব্যবহার করুন
ca: Utilitza la funció cas núm.
cs: Případ použití Funkce #1
fi: Käyttötapauksen funktio #1
fr: Cas d'utilisation Fonction #1
hi: प्रकार्य #1 का उपयोग
hr: Funkcija slučaja primjene broj 1
id: Gunakan Fungsi Kasus #1
ja: ユースケース関数 #1
ko: 사례 기능 사용 #1
nl: Doeleindefunctie #1
pt_br: Função do Caso de Uso #1
ru: Функция Прецедента №1
sv: Använd ärendefunktion #1
tr: Kullanım Örneği Fonksiyonu #1
uk: Випадок використання функції #1

source: First Action
ar: أول عمل
bn: প্রথম কর্ম
ca: Primera acció
cs: První akce
fi: Ensimmäinen toiminto
fr: Première action
hi: पहली कार्रवाई
hr: Prva radnja
id: Aksi Pertama
ja: 最初のアクション
ko: 첫 번째 작업
nl: Eerste actie
pt_br: Primeira Ação
ru: Первое Действие
sv: Första åtgärden
tr: İlk Eylem
uk: Перша дія

source: Second Action
ar: الإجراء الثاني
bn: দ্বিতীয় কর্ম
ca: Segona acció
cs: Druhá akce
fi: Toinen toiminto
fr: Seconde Action
hi: दूसरी कार्रवाई
hr: Druga radnja
id: Aksi Kedua
ja: 2 番目のアクション
ko: 두 번째 작업
nl: Tweede actie
pt_br: Segunda Ação
ru: Второе Действие
sv: Andra åtgärden
tr: İkinci Eylem
uk: Друга дія

source: Example System Requirement
ar: مثال على متطلبات النظام
bn: উদাহরণ সিস্টেমের প্রয়োজনীয়তা
ca: Requisit del sistema d'exemple
cs: Příklad systémových požadavků
fi: Esimerkinomainen järjestelmävaatimus
fr: Exemple d'Exigence du Système
hi: उदाहरण सिस्टम आवश्यकता
hr: Primjer sustavskog uvjeta
id: Contoh Persyaratan Sistem
ja: システム要件の例
ko: 예 시스템 요구 사항
nl: Voorbeeldsysteemvereiste
pt_br: Exemplo de Requisito do Sistema
ru: Пример Системных Требований
sv: Exempel på systemkrav
tr: Örnek Sistem Gereksinimi
uk: Приклад системних вимог

source: Sensed Data
ar: البيانات المحسوسة
bn: সংবেদনশীল ডাটা
ca: Dades detectades
cs: Snímaná data
fi: Tunnistetut tiedot
fr: Données détectées
hi: संवेदित डेटा
hr: Senzorski podaci
id: Data yang Dirasakan
ja: センシド・データ
ko: 감지된 데이터
nl: Gedetecteerde gegevens
pt_br: Dados Detectados
ru: Воспринятые Данные
sv: Avkänningsdata
tr: Algılanan Veri
uk: Дані датчиків

source: Command
ar: يأمر
bn: আদেশ
ca: Manar
cs: Příkaz
fi: Komento
fr: Commande
hi: कमांड
hr: Naredba
id: Memerintah
ja: 命令
ko: 명령
nl: Opdracht
pt_br: Comando
ru: Команда
sv: Befallning
tr: Komut
uk: Команда

source: Functional Boundary Behavior
ar: سلوك الحدود الوظيفية
bn: কার্যকরী সীমানা আচরণ
ca: Comportament funcional de límits
cs: Funkční hraniční chování
fi: Toiminnallinen rajakäyttäytyminen
fr: Comportement à la frontière fonctionnelle
hi: कार्यात्मक सीमा व्यवहार
hr: Funkcionalno ponašanje granica
id: Perilaku Batas Fungsional
ja: 機能境界の動作
ko: 기능 경계 동작
nl: Functioneel grensgedrag
pt_br: Comportamento de Limite Funcional
ru: Функциональное Пограничное Поведение
sv: Beteende för funktionella gränser
tr: İşlevsel Sınır Davranışı
uk: Функціональна гранична поведінка

source: Determine Actuator Command
ar: تحديد أمر المشغل
bn: Actuator কমান্ড নির্ধারণ করুন
ca: Determina l'ordre de l'actuador
cs: Určete příkaz aktuátoru
fi: Määritä toimilaitteen komento
fr: Déterminer la commande de l’actionneur
hi: एक्ट्यूएटर कमांड निर्धारित करें
hr: Naredba za određivanje upravljača
id: Tentukan Perintah Aktuator
ja: アクチュエータコマンドの決定
ko: 액추에이터 명령 결정
nl: Actuatoropdracht vaststellen
pt_br: Determinar o comando do Atuador
ru: Определить Команду Привода
sv: Kommandot Bestäm ställdon
tr: Çalıştırıcı Komutu Belirle
uk: Визначити команду приводу

source: Actuate Actuator
ar: مشغل المحرك
ca: Actua l'actuador
cs: Aktivační aktuátor
fi: Aktivoi toimilaite
fr: Actionner l'actionneur
hi: एक्चुएटर संचालित करें
hr: Pokreni upravljač
id: Aktuator Aktuator
ja: アクチュエートアクチュエータ
ko: 액추에이터
nl: Actuator activeren
pt_br: Acionar Atuador
ru: Привести в действие Привод
sv: Aktivera ställdon
tr: Çalıştırıcıyı Çalıştır
uk: Активуйте привод

source: Example Technology Requirement
cs: Příklad požadavku na technologii
fi: Esimerkinomainen teknologiavaatimus
fr: Exemple d'exigence technologique
hi: उदाहरण प्रौद्योगिकी आवश्यकता
hr: Primjer tehnološkog uvjeta
nl: Voorbeeldtechnologievereiste
pt_br: Exemplo de Requisito de Tecnologia
ru: Пример Технологических Требований
tr: Örnek Teknoloji Gereksinimi
uk: Приклад технологічних вимог

source: System
ar: نظام
bn: সিস্টেম
ca: Sistema
cs: Systém
fi: Järjestelmä
fr: Système
hi: सिस्टम
hr: Sustav
id: Sistem
it: Sistema
ja: 制
ko: 체계
nl: Systeem
pt_br: Sistema
ru: Система
tr: Sistem
uk: Система

source: ECU
ar: وحدة نقدية أوروبية
hr: ECU (elektronička upravljačka jedinica)
ru: ЭБУ

source: DC Motor
ar: محرك بتيار مستمر
bn: ডিসি মোটর
ca: Motor de corrent continu
cs: Stejnosměrný motor
fi: DC-moottori
fr: Moteur à courant continu
hi: डीसी मोटर
hr: DC motor (istosmjerni motor)
id: Motor DC
ja: DCモーター
ko: DC 모터
pt_br: Motor de CC
ru: Двигатель Постоянного Тока
sv: LIKSTRÖMSmotor
uk: Двигун постійного струму

source: IR Transceiver
ar: جهاز الإرسال والاستقبال IR
bn: আইআর ট্রান্সসিভার
ca: Transceptor de l'IR
cs: IR vysílač
fi: IR-lähetin/-vastaanotin
fr: Émetteur-récepteur IR
hi: आईआर ट्रांसीवर
hr: Infracrveni primopredajnik
id: Pemancar IR
ja: IRトランシーバー
ko: IR 트랜시버
nl: IR-ontvanger
pt_br: Transceptor de Infravermelho
ru: ИК-трансивер
sv: IR-sändtagare
tr: IR alıcı-verici
uk: ІЧ трансивер

source: ecu
ar: وحدة نقدية أوروبية
hr: ecu (elektronička upravljačka jedinica)
ja: エキュ
ko: 에쿠 (주)
ru: эбу

source: dc Motor
ar: محرك بتيار مستمر
bn: ডিসি মোটর
ca: motor dc
cs: stejnosměrný motor
fi: dc-moottori
fr: Moteur à courant continu
hi: डीसी मोटर
hr: dc motor (istosmjerni motor)
id: motor dc
ja: DCモーター
ko: DC 모터
pt_br: Motor de cc
ru: Двигатель постоянного тока
uk: двигун постійного струму

source: ir Transceiver
ar: الأشعة تحت الحمراء الإرسال والاستقبال
bn: ir ট্রান্সসিভার
ca: ir Transceptor
fi: ir-lähetin-vastaanotin
fr: Émetteur-récepteur IR
hi: आईआर ट्रांसीवर
hr: infracrveni primopredajnik
ja: ir トランシーバー
ko: 이르 트랜시버
nl: ir-ontvanger
pt_br: Transceptor de infravermelho
ru: ик-трансивер
sv: ir Sändtagare
tr: ir alıcı-verici
uk: є трансивером

source: Detect Obstacle
ar: كشف العقبة
bn: বাধা সনাক্ত করুন
ca: Detecta l'obstacle
cs: Detekce překážky
fi: Havaitse este
fr: Détection d'un obstacle
hi: बाधा का पता लगाएं
hr: Otkrij prepreku
id: Deteksi Rintangan
ja: 障害物の検出
ko: 장애물 감지
nl: Obstakel detecteren
pt_br: Detectar Obstáculo
ru: Обнаружить Препятствие
sv: Upptäck hinder
tr: Engel Algıla
uk: Виявлення перешкоди

source: Command Reverse
ar: عكس الأمر
bn: কমান্ড রিভার্স
ca: Ordre inverteix
cs: Příkaz Rezervnosti
fi: Komento käänteinen
fr: Commande Inversée
hi: उलटा कमांड
hr: Obrnuta naredba
id: Perintah Terbalik
ja: コマンドの逆
ko: 명령 역방향
nl: Opdrachtomkering
pt_br: Comendo de Inversão
ru: Обратная Команда
sv: Omvänd kommando
tr: Ters Komut
uk: Команда Реверс

source: Reverse Motor
ar: عكس المحرك
bn: রিভার্স মোটর
ca: Motor invers
cs: Reverzní motor
fi: Käänteinen moottori
fr: Marche Arrière Moteur
hi: उल्टा मोटर
hr: Obrni motor
id: Motor mundur
ja: リバースモーター
ko: 리버스 모터
nl: Motor omkeren
pt_br: Motor de Inversão
ru: Двигатель Заднего Хода
sv: Omvänd motor
tr: Terk Motor
uk: Двигун заднього ходу

source: Detect Object
ar: كشف الكائن
bn: অবজেক্ট শনাক্ত করুন
ca: Detecta l'objecte
cs: Detekce objektu
fi: Havaitse objekti
fr: Détecter l'Objet
hi: वस्तु का पता लगाएं
hr: Otkrij objekt
id: Deteksi Objek
ja: オブジェクトの検出
ko: 물체 감지
nl: Object detecteren
pt_br: Detectar Objeto
ru: Обнаружить Объект
sv: Identifiera objekt
tr: Nesne Algıla
uk: Виявлення об'єкта

source: Detection Event
ar: حدث الكشف
bn: সনাক্তকরণ ঘটনা
ca: Incidència de detecció
cs: Detekční událost
fi: Havainnointitapahtuma
fr: Événement de détection
hi: घटनाओं का पता लगाएं
hr: Događaj otkrivanja
id: Acara Deteksi
ja: 検出イベント
ko: 탐지 이벤트
nl: Detectiegebeurtenis
pt_br: Evento de Detecção
ru: Событие Обнаружения
sv: Identifieringshändelse
tr: Algılama Olayı
uk: Подія виявлення

source: Feature Context
ar: سياق الميزة
bn: বৈশিষ্ট্য প্রসঙ্গ
ca: Context de la característica
cs: Kontext funkce
fi: Ominaisuuskonteksti
fr: Contexte de la fonction
hi: फ़ीचर प्रसंग
hr: Kontekst značajke
id: Konteks Fitur
ja: 機能コンテキスト
ko: 기능 컨텍스트
nl: Functiecontext
pt_br: Contexto da Característica
ru: Контекст функции
sv: Funktionskontext
tr: Özellik Bağlamı
uk: Контекст функції

source: Read Input
fi: Lue syöttö
fr: Lire l'Entrée
hi: इनपुट पढ़ें
hr: Čitaj unos
nl: Invoer lezen
pt_br: Ler entrada
ru: Прочесть Ввод
tr: Girdiyi Oku
uk: Прочитати введені дані

source: FeatureInput
fi: Esittele syöttö
fr: CaractéristiqueEntrée
hi: विशेषताइनपुट
hr: Unos značajki
nl: Functie
pt_br: EntradaCaracterística
tr: ÖzellikGirişi
uk: ФункціяВедення

source: Request Actuation
fi: Pyydä aktivointia
fr: Demande d'Actionnement
hi: अनुरोध प्रारंभ करें
hr: Zatraži izvršavanje
nl: Eerste actie
pt_br: Solicitar Atuação
ru: Запрос на активацию
tr: İstek Çalıştırma
uk: Запит на активацію

source: Actuation Command
fi: Aktivointikomento
fr: Commande d'actionnement
hi: सक्रियण कमांड
hr: Naredba za izvršavanje
nl: Actuatorcommando
pt_br: Comando de Atuação
ru: Команда активации
tr: Çalıştırıcı Komut
uk: Команда активації

source: Model Navigation
fi: Mallin navigointi
fr: Modèle de navigation
hi: मॉडल नेविगेशन
hr: Navigacija modela
nl: Model­navigatie
pt_br: Navegação de Modelo
ru: Модель навигации
tr: Model Gezintisi
uk: Модель навігації

source: Concept
fi: Konsepti
fr: Principe
hi: अवधारणा
hr: Koncept
pt_br: Conceito
ru: Концепция
tr: Konsept
uk: Концепція

source: Logical
fi: Looginen
fr: Logique
hi: तार्किक
hr: Logika
nl: Logisch
pt_br: Lógico
ru: Логический
tr: Mantıksal
uk: Логічно

source: Pillar
fi: Pilari
fr: Pilier
hi: स्तंभ
hr: Stup
nl: Pilaar
pt_br: Pilar
tr: Sütun
uk: Стовпа

source: Abstraction Level
fi: Abstraktiotaso
fr: Niveau de détail
hi: अमूर्तन स्तर
hr: Razina apstrakcije
nl: Abstractie niveau
pt_br: Nível de Abstração
ru: Уровень абстракции
tr: Soyutlama Düzeyi
uk: Рівень абстракції

source: 1. Use Cases
ar: 1. وقائع الاستخدام
bn: 1. কেস ব্যবহার করুন
ca: 1. Casos d'ús
cs: 1. Případy použití
fi: 1. Käyttötapaukset
fr: 1. Cas d’utilisation
hi: 1. उपयोग के मामले
hr: 1. Slučajevi primjene
id: 1. Kasus Penggunaan
ja: 1. ユースケース
ko: 1. 사례 사용
nl: 1. Doeleinden
pt_br: 1. Casos de uso
ru: 1. Прецеденты
sv: 1. Användningsfall
tr: 1. Kullanım Örnekleri
uk: 1. Випадки використання

source: 2. Domain Analysis
ar: 2. تحليل المجال
bn: 2. ডোমেইন বিশ্লেষণ
ca: 2. Anàlisi de dominis
cs: 2. Analýza domény
fi: 2. Alueanalyysi
fr: 2. Analyse de domaine
hi: 2. डोमेन विश्लेषण
hr: 2. Analiza domene
id: 2. Analisis Domain
ja: 2. ドメイン分析
ko: 2. 도메인 분석
nl: 2. Domeinanalyse
pt_br: 2. Análise de Domínio
ru: 2. Анализ Предметной области
sv: 2. Domänanalys
tr: 2. Etki Alanı Analizleri
uk: 2. Аналіз домену

source: 3. Architectural Design
ar: 3. التصميم المعماري
bn: 3. স্থাপত্য নকশা
ca: 3. Disseny arquitectònic
cs: 3. Architektonický návrh
fi: 3. Arkkitehtuurinen suunnittelu
fr: 3. Conception architecturale
hi: 3. वास्तुशिल्प डिजाइन
hr: 3. Arhitektonski dizajn
id: 3. Desain Arsitektur
ja: 3. 建築設計
ko: 3. 건축 디자인
nl: 3. Architectonisch ontwerp
pt_br: 3. Projeto Arquitetônico
ru: 3. Архитектурный Дизайн
sv: 3. Arkitektonisk design
tr: 3. Mimari Tasarım
uk: 3. Архітектурне проектування

source: 4. Detailed Design
ar: 4. التصميم التفصيلي
bn: 4. বিস্তারিত নকশা
ca: 4. Disseny detallat
cs: 4. Podrobný návrh
fi: 4. Yksityiskohtainen suunnittelu
fr: 4. Conception détaillée
hi: 4. विस्तृत डिजाइन
hr: 4. Detaljni dizajn
id: 4. Desain Rinci
ja: 4. 詳細設計
ko: 4. 상세한 디자인
nl: 4. Gedetailleerd ontwerp
pt_br: 4. Projeto Detalhado
ru: 4. Рабочий Проект
sv: 4. Detaljerad design
tr: 4. Ayrıntılı Tasarım
uk: 4. Детальний проект

source: Main Actor
ar: الممثل الرئيسي
bn: প্রধান অভিনেতা
ca: Actor principal
cs: Hlavní herec
fi: Ensisijainen toimija
fr: Acteur principal
hi: मुख्य अभिनेता
hr: Glavni sudionik
id: Aktor utama
ja: 主役
ko: 메인 배우
nl: Hoofduitvoerder
pt_br: Ator Principal
ru: Главный Актор
sv: Huvudskådespelare
tr: Ana Eylemci
uk: Головний актор

source: Main Use Case
ar: حالة الاستخدام الرئيسية
bn: প্রধান ব্যবহারের কেস
ca: Cas d'ús principal
cs: Hlavní případ použití
fi: Ensisijainen käyttötapaus
fr: Cas d’utilisation principal
hi: मुख्य उपयोग
hr: Glavni slučaj primjene
id: Kasus Penggunaan Utama
ja: 主な使用例
ko: 주요 사용 사례
nl: Hoofddoeleinde
pt_br: Caso de Uso Principal
ru: Основной Прецедент
sv: Huvudanvändningsfall
tr: Ana Kullanım Örneği
uk: Основний варіант використання

source: Included Use Case
ar: وشملت حالة الاستخدام
bn: অন্তর্ভুক্ত ব্যবহারের কেস
ca: Cas d'ús inclòs
cs: Zahrnutý případ použití
fi: Sisällytetty käyttötapaus
fr: Cas d’utilisation inclus
hi: सम्मिलित उपयोग
hr: Uključeni slučajevi primjene
id: Termasuk Kasus Penggunaan
ja: 含まれるユースケース
ko: 포함된 사용 사례
nl: Inbegrepen doeleinde
pt_br: Caso de Uso Incluído
ru: Включённый Прецедент
sv: Inkluderat användningsfall
tr: Eklenen Kullanım Örneği
uk: Включений варіант використання

source: Secondary Actor
ar: ممثل ثانوي
bn: গৌণ অভিনেতা
ca: Actor secundari
cs: Vedlejší herec
fi: Toissijainen toimija
fr: Acteur secondaire
hi: द्वितीयक अभिनेता
hr: Sekundarni sudionik
id: Aktor Sekunder
ja: セカンダリアクター
ko: 보조 액터
nl: Secundaire uitvoerder
pt_br: Ator Secundário
ru: Второстепенный Актор
sv: Sekundär skådespelare
tr: İkincil Eylemci
uk: Другорядний актор

source: Secondary Use Case
ar: حالة استخدام ثانوية
bn: গৌণ ব্যবহারের কেস
ca: Cas d'ús secundari
cs: Sekundární případ použití
fi: Toissijainen käyttötapaus
fr: Cas d’utilisation secondaire
hi: द्वितीयक उपयोग
hr: Sekundarni slučaj primjene
id: Kasus Penggunaan Sekunder
ja: 二次的ユースケース
ko: 보조 사용 사례
nl: Secundair doeleinde
pt_br: Caso de Uso Secundário
ru: Второстепенный Прецедент
sv: Sekundärt användningsfall
tr: İkincil Kullanım Örneği
uk: Вторинний варіант використання

source: Use Case Scenarios
ar: سيناريوهات حالة الاستخدام
bn: কেস দৃশ্যাবলী ব্যবহার করুন
ca: Utilitza els escenaris del cas
cs: Scénáře případů použití
fi: Käyttötapausskenaariot
fr: Scénarios d’utilisation
hi: उपयोग परिदृश्य
hr: Scenariji slučaja primjene
id: Gunakan Skenario Kasus
ja: ユースケースシナリオ
ko: 사례 시나리오 사용
nl: Doeleindescenario's
pt_br: Cenários de Caso de Uso
ru: Сценарии Прецедентов
sv: Använd ärendescenarier
tr: Kullanım Örneği Senaryosu
uk: Сценарії використання

source: Scenario 1
ar: السيناريو 1
bn: দৃশ্যকল্প 1
ca: Escenari 1
cs: Scénář 1
fi: Skenaario 1
fr: Scénario 1
hi: परिदृश्य 1
hr: Scenarij 1
id: skenario 1
ja: シナリオ 1
ko: 시나리오 1
pt_br: Cenário 1
ru: Сценарий 1
tr: Senaryo 1
uk: Сценарій 1

source: Scenario 2
ar: السيناريو 2
bn: দৃশ্যকল্প 2
ca: Escenari 2
cs: Scénář 2
fi: Skenaario 2
fr: Scénario 2
hi: परिदृश्य 2
hr: Scenarij 2
id: Skenario 2
ja: シナリオ 2
ko: 시나리오 2
pt_br: Cenário 2
ru: Сценарий 2
tr: Senaryo 2
uk: Сценарій 2

source: Domain Entities
ar: كيانات المجال
bn: ডোমেইন সত্তাসমূহ
ca: Entitats de domini
cs: Subjekty domény
fi: Alue-entiteetit
fr: Entités de domaine
hi: डोमेन संस्थाएं
hr: Entiteti domene
id: Entitas Domain
ja: ドメイン エンティティ
ko: 도메인 엔터티
nl: Domeinentiteiten
pt_br: Entidades de Domínio
ru: Сущности Домена
sv: Domänenheter
tr: Etki Alanı Varlıkları
uk: Сутності домену

source: Software Task
ar: مهمة البرنامج
bn: সফ্টওয়্যার কাজ
ca: Tasca de programari
cs: Softwarová úloha
fi: Ohjelmistotehtävä
fr: Tâche logicielle
hi: सॉफ्टवेयर कार्य
hr: Softverski zadatak
id: Tugas Perangkat Lunak
ja: ソフトウェアタスク
ko: 소프트웨어 작업
nl: Softwaretaak
pt_br: Tarefa de Software
ru: Задача Программного обеспечения
sv: Programvaruuppgift
tr: Yazılım Görevi
uk: Програмне завдання

source: performs
ar: ينفذ
bn: সম্পাদন করে
ca: Realitza
cs: provádí
fi: suorittaa
fr: exécute
hi: निष्पादन
hr: izvršava
id: melakukan
ja: 実行
ko: 수행
nl: presteert
pt_br: executa
ru: выполняет
sv: Utför
tr: gerçekleştir
uk: виконує

source: Package Dependencies
ar: تبعيات الحزمة
bn: প্যাকেজ নির্ভরতা
ca: Dependències del paquet
cs: Závislosti balíčků
fi: Paketin riippuvuudet
fr: Dépendances de package
hi: पैकेज निर्भरताएं
hr: Ovisnosti paketa
id: Ketergantungan Paket
ja: パッケージの依存関係
ko: 패키지 종속성
nl: Pakketafhankelijkheden
pt_br: Dependências de Pacotes
ru: Зависимости Пакета
sv: Paketberoenden
tr: Paket Bağımlılıkları
uk: Залежності пакетів

source: SW Component 1
ar: مكون SW 1
bn: SW কম্পোনেন্ট 1
ca: Component SW 1
cs: SW komponenta 1
fi: Ohjelmistokomponentti 1
fr: Composant 1 SW
hi: SW घटक 1
hr: Softverska komponenta 1
id: Komponen SW 1
ja: SW コンポーネント 1
ko: SW 구성 요소 1
pt_br: Componente SW 1
ru: Компонент ПО 1
sv: SW-komponent 1
tr: SW Bileşeni 1
uk: Компонент SW 1

source: SW Component 4
ar: مكون SW 4
bn: SW কম্পোনেন্ট 4
ca: Component SW 4
cs: SW komponenta 4
fi: Ohjelmistokomponentti 4
fr: Composant SW 4
hi: SW घटक 4
hr: Softverska komponenta 4
id: Komponen SW 4
ja: SW コンポーネント 4
ko: SW 구성 요소 4
pt_br: Componente SW 4
ru: Компонент ПО 4
sv: SW-komponent 4
tr: SW Bileşeni 4
uk: Компонент SW 4

source: SW Component 3
ar: مكون SW 3
bn: SW কম্পোনেন্ট 3
ca: Component SW 3
cs: SW komponenta 3
fi: Ohjelmistokomponentti 3
fr: Composant SW 3
hi: SW घटक 3
hr: Softverska komponenta 3
id: Komponen SW 3
ja: SW コンポーネント 3
ko: SW 구성 요소 3
pt_br: Componente SW 3
ru: Компонент ПО 3
sv: SW-komponent 3
tr: SW Bileşeni 3
uk: Компонент SW 3

source: SW Component 2
ar: مكون SW 2
bn: SW কম্পোনেন্ট 2
ca: Component SW 2
cs: SW komponenta 2
fi: Ohjelmistokomponentti 2
fr: Composant SW 2
hi: SW घटक 2
hr: Softverska komponenta 2
id: Komponen SW 2
ja: SW コンポーネント 2
ko: SW 구성 요소 2
pt_br: Componente SW 2
ru: Компонент ПО 2
sv: SW-komponent 2
tr: SW Bileşeni 2
uk: Компонент SW 2

source: Primary Actor
ar: الفاعل الأساسي
bn: প্রধান অভিনেতা
ca: Actor principal
cs: Primární aktér
fi: Ensisijainen toimija
fr: Acteur principal
hi: प्राथमिक अभिनेता
hr: Primarni sudionik
id: Aktor Utama
ja: 主役俳優
ko: 기본 액터
nl: Primaire uitvoerder
pt_br: Ator Primário
ru: Основной Актор
sv: Primär aktör
tr: Ana Eylemci
uk: Основний актор

source: Actor Profile
ar: الملف الشخصي للممثل
bn: অভিনেতা প্রোফাইল
ca: Perfil de l'actor
cs: Profil aktéra
fi: Toimijan profiili
fr: Profil de l’acteur
hi: अभिनेता प्रोफ़ाइल
hr: Profil sudionika
id: Profil Aktor
ja: アクター プロファイル
ko: 배우 프로필
nl: Uitvoerdersprofiel
pt_br: Perfil do Ator
ru: Профиль Актора
sv: Skådespelare profil
tr: Eylemci Profili
uk: Профіль актора

source: login
ar: تسجيل الدخول
bn: লগইন
ca: Connexió
cs: přihlásit se
fi: sisäänkirjautuminen
fr: connectez-vous
hi: लॉगिन
hr: prijava
id: Gabung
ja: ログイン
ko: 로그인
nl: inloggen
ru: вход
sv: logga in
tr: giriş
uk: Логіни

source: Detailed Class Design
ar: تصميم فصل مفصل
bn: বিস্তারিত ক্লাস ডিজাইন
ca: Disseny detallat de la classe
cs: Podrobný návrh třídy
fi: Yksityiskohtainen luokkasuunnittelu
fr: Conception détaillée des classes
hi: विस्तृत वर्ग डिजाइन
hr: Detaljni dizajn klasa
id: Desain Kelas Rinci
ja: 詳細なクラス設計
ko: 상세한 클래스 디자인
nl: Gedetailleerd klasseontwerp
pt_br: Design Detalhado de Classe
ru: Детальное Проектирование Класса
sv: Detaljerad klassdesign
tr: Ayrıntılı Sınıf Tasarımı
uk: Детальний дизайн класу
