Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Flow final node
ar: عقدة التدفق النهائية
bn: ফ্লো চূড়ান্ত নোড
ca: Node final del fluxe
cs: Konečný uzel toku
fi: Virran viimeinen solmu
fr: Nœud de fin de flot
hi: प्रवाह अंतिम नोड
hr: Završni čvor toka
id: simpul akhir aliran
it: Nodo finale del flusso
ja: フロー最終ノード
ko: 흐름 종단 노드
nl: Laatste stroomknoop
pt_br: Nó final de fluxo
ru: Узел завершения потока
sv: Slutlig nod för flöde
tr: Akış son düğümü
uk: Кінцевий вузол потоку

source: Decision/merge node
ar: عقدة القرار / دمج
bn: সিদ্ধান্ত/একত্রীকরণ নোড
ca: Node de decisió/fusió
cs: Rozhodovací/slučovací uzel
fi: Päätös-/yhdistämissolmu
fr: Nœud de décision et de fusion
hi: निर्णय/मर्ज नोड
hr: Čvor odluke/sjedinjavanja
id: Keputusan/gabungkan simpul
it: Nodo di decisione/unione
ja: 決定/マージ ノード
ko: 결정/병합 노드
nl: Beslissings-/samenvoegings­knoop
pt_br: Nó de decisão/intercalação
ru: Узел принятия решения или узел слияния
sv: Besluts-/kopplingsnod
tr: Karar/birleştirme düğümü
uk: Вузол рішення/злиття

source: Fork/join node
ar: شوكة / ربط العقدة
bn: ফর্ক/যোগদান নোড
ca: Node de desviació/unió
cs: Režim Fork/připojit
fi: Haarautumis-/liittymissolmu
fr: Nœud de bifurcation et d'union
hi: फ़ॉर्क/जुड़ाव नोड
hr: Čvor grananja/spajanja
id: Garpu/gabung simpul
it: Nodo di fork/unisci
ja: フォーク/ジョインノード
ko: 분리/결합 노드
nl: Splitsings-/aansluitingsknoop
pt_br: Nó de separação/junção
ru: Узел раздвоения/слияния
sv: Fork/join-nod
tr: Çatal/birleşim düğümü
uk: Розгалуження/вузол приєднання

source: Object node
ar: عقدة الكائن
bn: অবজেক্ট নোড
ca: Node d'objecte
cs: Objektový uzel
fi: Oliosolmu
fr: Nœud d'objet
hi: वस्तु नोड
hr: Čvor objekta
id: simpul objek
it: Nodo oggetto
ja: オブジェクト ノード
ko: 객체 노드
nl: Object­knoop
pt_br: Nó de objeto
ru: Узел данных
sv: Nod för objekt
tr: Nesne düğümü
uk: Вузол об'єкта

source: Swimlane
ar: حارة
fi: Uimarata
fr: Couloir d'activité (swimlane)
hi: स्विमलेन
hr: Traka
id: renang
ja: スイムレーン
ko: 스윔레인
nl: Zwembaan
pt_br: Raia
ru: Дорожка
tr: Kulvar
uk: Свімлане

source: Control flow
cs: Řídicí tok
fi: Kontrollivirta
fr: Contrôle du flux
hi: प्रवाह नियंत्रण
hr: Tok kontrola
it: Controllo flusso
nl: Controlestroom
pt_br: Fluxo de Controle
ru: Поток управления
tr: Denetim akışı
uk: Контроль потоку

source: Object flow
cs: Tok objektů
fi: Objektivirta
fr: Flux de l'objet
hi: वस्तु प्रवाह
hr: Tok objekata
it: Flusso oggetto
nl: Objectstroom
pt_br: Fluxo de objetos
ru: Поток объектов
tr: Nesne akışı
uk: Потік об'єктів

source: Send signal action
ar: إرسال إشارة العمل
bn: সংকেত ক্রিয়াকলাপ প্রেরণ করুন
ca: Envia l'acció del senyal
cs: Akce odeslání signálu
fi: Lähetä signaali -toiminto
fr: Envoyer un signal d'action
hi: संकेत कार्रवाई भेजें
hr: Radnja slanja signala
id: Kirim tindakan sinyal
it: Invia segnale azione
ja: シグナルアクションの送信
ko: 시그널 보내기 동작
nl: Signaalactie verzenden
pt_br: Enviar sinal de ação
ru: Действие отправки сигнала
sv: Skicka signalåtgärd
tr: Sinyal eylemi gönder
uk: Надіслати дії сигнал

source: Send signal
ar: إرسال إشارة
bn: সংকেত প্রেরণ করুন
ca: Envia el senyal
cs: Odeslat signál
fi: Lähetä signaali
fr: Envoyer un signal
hi: संकेत भेजें
hr: Pošalji signal
id: Kirim sinyal
it: Invia segnale
ja: 送信シグナル
ko: 신호 보내기
nl: Signaal verzenden
pt_br: Enviar sinal
ru: Отправить сигнал
sv: Skicka signal
tr: Sinyal gönder
uk: Надіслати сигнал

source: Accept event action
ar: اقبل إجراء الحدث
bn: ঘটনা ক্রিয়াকলাপ স্বীকার করুন
ca: Accepta l'acció de l'esdeveniment
cs: Akceptovat akci události
fi: Hyväksy tapahtuma -toiminto
fr: Accepter l'action de l'événement
hi: घटना कार्रवाई स्वीकारें
hr: Radnja prihvaćanja događaja
id: Terima tindakan acara
it: Accetta azione evento
ja: イベントの受け入れアクション
ko: 이벤트 허용 동작
nl: Gebeurtenisactie accepteren
pt_br: Aceitar ação do evento
ru: Действие принятия события
sv: Acceptera händelseåtgärd
tr: Olay eylemini kabul et
uk: Прийняти дію події

source: Accept event
ar: قبول الحدث
bn: ঘটনা স্বীকার করুন
ca: Accepta l'esdeveniment
cs: Přijmout událost
fi: Hyväksy tapahtuma
fr: Accepter l'événement
hi: घटना स्वीकारें
hr: Prihvati događaj
id: Terima acara
it: Accetta evento
ja: イベントの受け入れ
ko: 이벤트 수락
nl: Gebeurtenis accepteren
pt_br: Aceitar evento
ru: Принять событие
sv: Acceptera händelse
tr: Olayı kabul et
uk: Прийняти подію

source: Input pin
cs: Vstupní pin
fi: Syöttökiinnitys
fr: Broche d'Entrée
hi: इनपुट पिन
hr: Pribadača unosa
it: Pin di input
nl: Invoer pin
pt_br: Pino de entrada
ru: Входной контакт
tr: Giriş pimi
uk: Вхідний штифт

source: Output pin
cs: Výstupní pin
fi: Lähtökiinnitys
fr: Broche de Sortie
hi: आउटपुट पिन
hr: Pribadača rezultata
it: Pin di output
nl: Uitvoer pin
pt_br: Pino de saída
ru: Выходной контакт
tr: Çıktı pimi
uk: Вихідний штифт

source: merge/decision
ar: دمج / قرار
bn: একত্রীকরণ/সিদ্ধান্ত
ca: fusió/decisió
cs: sloučit/rozhodnout
fi: yhdistäminen/päätös
fr: fusion/décision
hi: मर्ज/निर्णय
hr: sjedini/odluka
id: penggabungan/keputusan
it: unisci/decisione
ja: マージ/決定
ko: 병합/결정
nl: samenvoegen/besluit
pt_br: intercalação/decisão
ru: слияние/решение
sv: sammanfoga/fatta beslut
tr: birleştir/karar
uk: злиття/рішення

source: merge
ar: دمج
bn: মার্জ
ca: fusionar
cs: sloučit
fi: yhdistäminen
fr: fusionne
hi: मर्ज
hr: sjedini
id: menggabungkan
it: unisci
ja: マージ
ko: 병합
nl: samenvoegen
pt_br: intercalar
ru: слияние
sv: slå ihop
tr: birleştir
uk: злиття

source: decision
ar: قرار
bn: সিদ্ধান্ত
ca: decisió
cs: rozhodnutí
fi: päätös
fr: décision
hi: निर्णय
hr: odluka
id: keputusan
it: decisione
ja: 決定
ko: 결정
nl: besluit
pt_br: decisão
ru: решение
sv: beslut
tr: karar
uk: рішення

source: New Parameter…
fi: Uusi parametri…
fr: Nouveau Paramètre …
hi: नया पैरामीटर…
hr: Novi parametar …
it: Nuovo parametro…
nl: Nieuwe parameter…
pt_br: Novo Parâmetro…
ru: Новый параметр…
tr: Yeni Parametre…
uk: Новий параметр…

source: unordered
ar: غير مرتب
bn: অবিন্যস্ত
ca: Desordenada
cs: neuspořádané
fi: järjestämätön
fr: non ordonné
hi: अक्रमित
hr: nepobrojano
id: tidak dipesan
it: non ordinato
ja: 順 不同
ko: 정렬안함
nl: ongeordend
pt_br: não ordenado
ru: неупорядоченно
sv: Oordnad
tr: sırasız
uk: невпорядкований

source: ordered
ar: أمر
bn: নির্দেশিত
ca: Ordenat
cs: objednáno
fi: järjestetty
fr: ordonné
hi: क्रमित
hr: pobrojano
id: dipesan
it: ordinato
ja: 注文
ko: 정렬함
nl: geordend
pt_br: ordenado
ru: упорядоченно
sv: beordrats
tr: sıralı
uk: замовив

source: upperBound
ar: الحد الاعلى
bn: উপরেরাউন্ড
ca: entrada superior
fi: Yläraja
fr: LimiteSupérieure
hr: gornja granica
id: batas atas
ja: アッパーバウンド
ko: 어퍼바운드
nl: bovengrens
ru: верхняя граница
sv: övreBundet
uk: верхня межа

source: ordering
ar: يأمر
bn: আদেশ
ca: Ordenar
fi: tilaaminen
fr: commande
hr: redoslijed
id: Memerintah
it: ordinamento
ja: 順序
ko: 주문
nl: Volgorde
ru: упорядоченность
sv: Beställning
uk: замовлення

source: New Swimlane
ar: حارة سباحة جديدة
bn: নতুন Swimlane
ca: Nova Swimlane
cs: Nový Swimlane
fi: Uusi uimarata
fr: Nouveau Couloir d'activité (swimlane)
hi: नया स्विमलेन
hr: Nova traka
id: renang baru
it: Nuovo swimlane
ja: ニュースイムレーン
ko: 새로운 스윔레인
nl: Nieuwe Zwembaan
pt_br: Nova Raia
ru: Новая Дорожка
sv: Nya Swimlane
tr: Yeni Kulvar
uk: Новий Swimlane

source: input pin
cs: vstupní pin
fi: syöttökiinnitys
fr: broche d'entrée
hi: इनपुट पिन
hr: pribadača unosa
it: Pin di input
nl: invoer pin
pt_br: pino de entrada
ru: входной контакт
tr: girdi pimi
uk: вхідний контакт

source: output pin
cs: výstupní pin
fi: lähtökiinnitys
fr: broche de sortie
hi: आउटपुट पिन
hr: pribadača rezultata
it: Pin di output
nl: uitvoer pin
pt_br: pino de saída
ru: выходной контакт
tr: çıktı pini
uk: вихідний штифт

source: Show type
ar: نوع العرض
bn: ধরন দেখান
ca: Mostra el tipus
cs: Zobrazit typ
fi: Näytä tyyppi
fr: Montrer le type
hi: प्रकार दिखाएं
hr: Prikaži vrstu
id: Tampilkan jenis
it: Mostra tipo
ja: タイプを表示
ko: 표시 유형
nl: Type tonen
pt_br: Exibir tipo
ru: Показывать тип
sv: Visa typ
tr: Türü göster
uk: Тип шоу

source: Horizontal
ar: أفقي
bn: অনুভূমিক
ca: Horitzontal
cs: Horizontální
fi: Vaakatasossa
hi: क्षैतिज
hr: Vodoravno
id: Horisontal
it: Orizzontale
ja: 水平な
ko: 수평
nl: Horizontaal
ru: Горизонтальный
sv: Vågrät
tr: Yatay
uk: Горизонтальний

source: Join Specification
ar: انضمام المواصفات
bn: স্পেসিফিকেশনে যোগ দিন
ca: Especificació d'unió
cs: Připojit specifikace
fi: Liitosspesifikaatio
fr: Spécification de connexion
hi: कनेक्शन विनिर्देश
hr: Specifikacija spajanja
id: Gabung Spesifikasi
it: Unisci specifica
ja: 結合仕様
ko: 결합 명세
nl: Specificatie samenvoegen
pt_br: Juntar Especificação
ru: Присоединиться к Спецификации
sv: Kopplingsspecifikation
tr: Birleşim Özelliği
uk: Специфікація приєднання

source: Swimlanes
ar: الممرات المائية
fi: Uimaradat
fr: Couloirs d'activités (swimlanes)
hi: स्विमलेन
hr: Trake
id: renang
it: Swimlane
ja: スイムレーン
ko: 스윔레인
nl: Zwembanen
pt_br: Raias
ru: Дорожки
tr: Kulvarlar
uk: Плавальні доріжки

source: Partitions
ar: أقسام
bn: পার্টিশন
ca: Particions
cs: Oddíly
fi: Osiot
hi: विभाजन
hr: Particije
id: Partisi
it: Partizioni
ja: パーティション
ko: 분할
nl: Partities
pt_br: Partições
ru: Разделы
sv: Partitioner
tr: Bölümler
uk: Перегородки

source: Upper Bound
ar: الحد الاعلى
bn: উপরের বাউন্ড
ca: Límit superior
cs: Horní hranice
fi: Yläraja
fr: Limite Supérieure
hi: ऊपरी सीमा
hr: Gornja granica
id: Batas Atas
it: Limite superiore
ja: 上限
ko: 상단
nl: Bovengrens
pt_br: Limite Superior
ru: Верхняя Граница
sv: Övre gräns
tr: Üst Sınır
uk: Верхня межа

source: Ordering
fi: Tilaaminen
fr: Commander
hr: Redoslijed
it: Ordinamento
nl: Volgorde
ru: Упорядоченность
uk: Замовлення

source: Last In First Out (LIFO)
bn: লাস্ট ইন ফার্স্ট আউট (LIFO)
ca: Últim en primera sortida (LIFO)
cs: Poslední nastupuje, první vystupuje (LIFO)
fi: Viimeinen sisään, ensimmäinen ulos (LIFO)
fr: Dernier Entré Premier Sorti (LIFO)
hi: लास्ट इन फ़र्स्ट आउट (LIFO)
hr: Zadnji nutra prvi van (LIFO)
id: Terakhir Masuk Pertama Keluar (LIFO)
ja: ラストインファーストアウト (LIFO)
ko: 마지막 첫 번째 아웃 (LIFO)
pt_br: Último a Entrar, Primeiro a Sair (UEPS)
ru: Последним пришёл — первым ушёл (LIFO)
sv: Sist in först ut (LIFO)
tr: Son Giren İlk Çıkar (LIFO)
uk: Останній прийшов, перший вийшов (LIFO)

source: First In First Out (FIFO)
ca: Primer en primera sortida (FIFO)
cs: První dovnitř, první ven (FIFO)
fi: Ensimmäinen sisään, ensimmäinen ulos (FIFO)
fr: Premier Entré Premier Sorti (FIFO)
hi: फर्स्ट इन फर्स्ट आउट (फीफो)
hr: Prvi nutra prvi van (FIFO)
id: Masuk Pertama Keluar Pertama (FIFO)
ja: ファースト・イン・ファースト・アウト (FIFO)
ko: 첫 번째 아웃 (FIFO)
pt_br: Primeiro a Entrar, Primeiro a Sair (PEPS)
ru: Первым пришёл — первым ушёл (FIFO)
sv: Först in först ut (FIFO)
tr: İlk Giren İlk Çıkar (FIFO)
uk: Перший прийшов, перший вийшов (FIFO)

source: Show Ordering
ar: عرض الترتيب
bn: অর্ডার প্রদর্শন করুন
ca: Mostra la comanda
cs: Zobrazit řazení
fi: Näytä järjestys
fr: Montrer le Classement
hi: क्रमांकन दिखाएं
hr: Prikaži redoslijed
id: Tampilkan Pemesanan
it: Mostra ordinamento
ja: 注文を表示
ko: 순서 표시
nl: Volgorde tonen
pt_br: Mostrar Ordenação
ru: Показывать Упорядоченность
sv: Visa beställning
tr: Sıralamayı Göster
uk: Показати замовлення

source: Name
ar: اسم
bn: নাম
ca: Nom
cs: Název
fi: Nimi
fr: Nom
hi: नाम
hr: Ime
id: Nama
it: Nome
ja: 名前
ko: 이름
nl: Naam
pt_br: Nome
ru: Имя
sv: Namn
tr: Ad
uk: Ім'я

source: Behavior
ar: سلوك
bn: আচরণ
ca: Comportament
cs: Chování
fi: Toiminta
fr: Comportement
hi: व्यवहार
hr: Ponašanje
id: Perilaku
it: Comportamento
ja: 振舞い
ko: 행동
nl: Gedrag
pt_br: Comportamento
ru: Поведение
sv: Uppförande
tr: Davranış
uk: Поведінка

source: Value
ar: قيمة
bn: মান
ca: Valor
cs: Hodnota
fi: Arvo
fr: Valeur
hi: मान
hr: Vrijednost
id: Nilai
it: Valore
ja: 価値
ko: 값
nl: Waarde
pt_br: Valor
ru: Значение
sv: Värde
tr: Değer
uk: Значення

source: Guard
ar: يحمي
bn: প্রহরী
ca: Guàrdia
cs: Strážce
fi: Vartija
fr: Garde
hi: गार्ड
hr: Zaštita
id: Penjaga
it: Guardia
ja: 守る
ko: 가드
nl: Bewaker
pt_br: Guarda
ru: Защита
sv: Vakt
tr: Koruma
uk: Охоронець

source: Parameter Nodes
cs: Parametr Uzlů
fi: Parametrisolmut
fr: Nœuds de paramètre
hi: पैरामीटर नोड
hr: Čvorovi parametara
it: Nodi parametro
nl: Parameter­knoop
pt_br: Nós de parâmetros
ru: Узлы Параметров
tr: Parametre Düğümleri
uk: Вузли параметрів

source: ⓘ Help
cs: ⓘ Nápověda
fi: ⓘ Ohje
fr: ⓘ Aide
hi: ⓘ सहायता
hr: ⓘ Pomoć
it: ⓘ Aiuto
pt_br: ⓘ Ajuda
ru: ⓘ Справка
tr: ⓘ Yardım
uk: ⓘ Довідка

source: Add and edit class activity according to UML syntax. • <tt>attr</tt> (name, defaults to public visibility) • <tt>+ attr: int</tt> (public with type) • <tt>+ attr: int[0..1]</tt> (public, type, and multiplicity) • <tt>+ attr: int | bool</tt> (public, union type) • <tt># /attr: int # a note</tt> (protected, derived, with remark) Press <b>Enter</b> to edit, <b>Backspace</b>/<b>Delete</b> to remove items. Use <b>-</b>/<b>=</b> to move items up or down.
cs: Přidání a úprava aktivity třídy podle syntaxe UML. - <tt>attr</tt> (název, výchozí hodnota je public visibility) - <tt>+ attr: int</tt> (public s typem) - <tt>+ attr: int[0..1]</tt> (public, typ a násobnost) - <tt>+ attr: int | bool</tt> (veřejný, typ unie) - <tt># /attr: int # a note</tt> (chráněný, odvozený, s poznámkou) Stiskněte <b>Enter</b> pro úpravu, <b>Backspace</b>/<b>Delete</b> pro odstranění položek. Pomocí <b>-</b>/<b>=</b> přesunete položky nahoru nebo dolů.
fi: Lisää ja muokkaa luokan toimintaa UML-syntaksin mukaan. • <tt>attr</tt> (nimi, oletuksena on julkinen näkyvyys) • <tt>+ attr: int</tt> (julkinen tyypin kanssa) • <tt>+ attr: int[0..1]</tt> (julkinen, tyyppi ja moninkertaisuus) • <tt>+ attr: int | bool</tt> (julkinen, ammattiliittotyyppi) • <tt># /attr: int # huomautus</tt> (suojattu, johdettu, huomautuksen kanssa) Paina <b>Enter</b> muokataksesi ja <b>Askelpalautin</b>/<b>Delete</b> poistaaksesi kohteita. Käytä <b>-</b>/<b>=</b> siirtääksesi kohteita ylös tai alas.
fr: Ajouter et modifier l’activité de classe selon la syntaxe UML. • <tt>attr</tt> ( (nom, visibilité publique par défaut) • <tt>+ attr: int</tt> (publique avec type) • <tt>+ attr: int[0..1]</tt> (publique, type, et multiplicité) • <tt>+ attr: int | bool</tt> (publique, type union ) • <tt># /attr: int # a note</tt> (protégé, dérivé, avec remarque) Presser <b>Entrer</b> pour modifier, <b>retour arrière</b>/<b>Supprimer</b> pour retirer des éléments. Utiliser <b>-</b>/<b>=</b> pour déplacer les éléments vers le haut ou le bas.
hi: UML वाक्यविन्यास के अनुसार कक्षा गतिविधि जोड़ें और संपादित करें। • <tt>attr</tt> (नाम, तयशुदा रूप से सार्वजनिक दृश्यता) • <tt>+ attr: int</tt> (प्रकार के साथ सार्वजनिक) • <tt>+ attr: int[0..1]</tt> (सार्वजनिक, प्रकार, और बहुलता) • <tt>+ attr: int | bool</tt> (सार्वजनिक, संघ प्रकार) • <tt># /attr: int # a note</tt> (संरक्षित, व्युत्पन्न, टिप्पणी के साथ) संपादित करने के लिए <b>Enter</b> दबाएं, आइटम हटाने के लिए <b>Backspace</b>/<b>Delete</b> दबाएं। आइटम को ऊपर या नीचे ले जाने के लिए <b>-</b>/<b>=</b> का उपयोग करें।
hr: Dodaj i uredi svojstva klasa u skladu s UML sintaksom. • <tt>attr</tt> (ime, zadano za javnu vidljivost) • <tt>+ attr: int</tt> (javno s vrstom) • <tt>+ attr: int[0..1]</tt> (javno, vrsta i mnogostrukost) • <tt>+ attr: int | bool</tt> • <tt># /attr: int # nota</tt> (zaštićeno, izvedeno, s napomenom) Pritisni <b>Enter</b> za uređivanje, <b>Backspace</b>/<b>Delete</b> za uklanjanje elemenata. Koristi <b>-</b>/<b>=</b> za premještanje elemenata prema gore ili dolje.
it: Aggiungi e modifica l'attivià della classe secondo la sintassi UML. • <tt>attr</tt> (nome, di base è di visibilità pubblica) • <tt>+ attr: int</tt> (pubblico con tipo) • <tt>+ attr: int[0..1]</tt> (pubblico, tipo, e cardinalità) • <tt>+ attr: int | bool</tt> (pubblico, tipo unione) • <tt># /attr: int # a note</tt> (protetto, derivato, con remark) Premi <b>Enter</b> per modificare, <b>Backspace</b>/<b>Delete</b> per rimuovere gli elementi. Usa <b>-</b>/<b>=</b> per muovere gli oggetti su e giù.
nl: Voeg klasseactiviteit toe en bewerk deze volgens UML-syntax. • <tt>attr</tt> (naam, standaard is openbare zichtbaarheid) • <tt>+ attr: int</tt> (openbaar met type) • <tt>+ attr: int[0..1]</tt> (openbaar, type, en hoeveelheid) • <tt>+ attr: int | bool</tt> (openbaar, samenvoegingstype) • <tt># /attr: int # a note</tt> (beschermd, afgeleid, met opmerking) Druk op <b>Enter</b> om te bewerken, <b>Backspace</b>/<b>Delete</b> om items te verwijderen. Gebruik <b>-</b>/<b>=</b> om items omhoog of omlaag te verplaatsen.
pt_br: Adicione e edite a atividade da classe de acordo com a sintaxe UML. • <tt>atributo</tt> (nome, usa como padrão a visibilidade pública) • <tt>+ atributo: int</tt> (público com tipo) • <tt>+ atributo: int[0..1]</tt> (público, tipo e multiplicidade) • <tt>+ atributo: int | bool</tt> (público, tipo união) • <tt># /atributo: int # uma nota</tt> (protegido, derivado, com observação) Pressione <b>Enter</b> para editar, <b>Backspace</b>/<b>Delete</b> para remover itens. Use <b>-</b>/<b>=</b> para mover itens para cima ou para baixo.
ru: Добавляйте и изменяйте деятельность класса в соответствии с синтаксисом UML. • <tt>атрибут</tt> (имя, по умолчанию публичная видимость) • <tt>+ атрибут: тип</tt> (публичный с типом) • <tt>+ атрибут: тип[0..1]</tt> (публичный, тип, множественность) • <tt>+ атрибут: тип | bool</tt> (публичный, тип - объединение) • <tt># /атрибут: тип # пометка</tt> (защищённый, производный, с пометкой) Нажмите <b>Enter</b> для редактирования, <b>Backspace</b>/<b>Delete</b> для удаления элементов. Используйте <b>-</b>/<b>=</b> для перемещения элементов вверх и вниз.
tr: UML sözdizimine göre sınıf etkinliği ekleyin ve düzenleyin. • <tt>attr</tt> (ad, public görümüne varsayılan) • <tt>+ attr: int</tt> (tür ile public) • <tt>+ attr: int[0..1]</tt> (public, tür, ve çeşitlilik) • <tt>+ attr: int | bool</tt> (public, union türü) • <tt># /attr: int # bir not</tt> (protected, derived, not ile) Düzenlemek için <b>Enter</b>ʼa basın, Ögeleri kaldırmak için <b>Geri Sil</b>/<b>Sil</b>ʼe basın. Öğeleri yukarı veya aşağı taşımak için <b>-</b>/<b>=</b> kullanın.
uk: Додавати та редагувати діяльність класу відповідно до синтаксису UML. • <tt>attr</tt> (ім'я, за замовчуванням загальнодоступний) • <tt>+ attr: int</tt> (публічний із типом) • <tt>+ attr: int[0..1]</tt> (публічний, тип і множинність) • <tt>+ attr: int | bool</tt> (публічний, тип об'єднання) • <tt># /attr: int # примітка</tt> (захищена, похідна, із зауваженням) Натисніть <b>Enter</b>, щоб редагувати, <b>Backspace</b>/<b>Delete</b>, щоб видалити елементи. Використовуйте <b>-</b>/<b>=</b>, щоб перемістити елементи вгору або вниз.

source: Direction
fi: Suunta
hr: Smjer
it: Direzione
nl: Richting
ru: Направление
uk: Напрямок

source: In/Out
fi: Sisään/ulos
fr: Entrée/Sortie
hi: अंदर/बाहर
hr: Ulaz/Izlaz
nl: In/uit
pt_br: Entrada/Saída
ru: Ввод/Вывод
tr: Girdi/Çıktı
uk: Вхід/Вихід

source: In
fi: Sisään
fr: Entrée
hi: अंदर
hr: Ulaz
pt_br: Entrada
ru: Ввод
tr: Girdi
uk: В

source: Out
fi: Ulos
fr: Sortie
hi: बाहर
hr: Izlaz
nl: Uit
pt_br: Saída
ru: Вывод
tr: Çıktı
uk: Вийти

source: Return
fi: Palaa
fr: Retour
hi: पीछे
hr: Natrag
it: Ritorno
nl: Terug
pt_br: Retorno
ru: Вернуть
tr: Dönüş
uk: Повернення

source: Show Direction
ar: إظهار الاتجاه
bn: দিকনির্দেশ দেখান
ca: Mostra la direcció
cs: Zobrazit směr
fi: Näytä suunta
fr: Afficher la direction
hi: दिशा दिखाएं
hr: Prikaži smjer
id: Tunjukkan Arah
it: Mostra direzione
ja: 方向を表示
ko: 방향 표시
nl: Richting tonen
pt_br: Mostrar Direção
ru: Показать Направление
sv: Visa riktning
tr: Yönü Göster
uk: Показати напрямок

source: Multiplicity
fi: Moninaisuus
fr: Multiplicité
hi: बहुलता
hr: Mnogostrukost
it: Cardinalità
nl: Multipliciteit
pt_br: Multiplicidade
ru: Множественность
tr: Çokluk
uk: Кратність

source: New Attribute…
fi: Uusi attribuutti…
fr: Nouvel Attribut …
hi: नई विशेषता…
hr: Novo svojstvo …
it: Nuovo attributo …
nl: Nieuw attribuut…
pt_br: Novo Atributo…
ru: Новый Атрибут…
tr: Yeni Öznitelik…
uk: Новий атрибут…

source: New Operation…
fi: Uusi operaatio…
fr: Nouvelle opération …
hi: नया अभियान…
hr: Nova operacija …
it: Nuova operazione…
nl: Nieuwe handeling…
pt_br: Nova Operação…
ru: Новый Метод…
tr: Yeni İşlem…
uk: Нова операція…

source: Classes
ar: الطبقات
bn: ক্লাস
cs: Třídy
fi: Luokat
hi: वर्ग
hr: Klase
id: Kelas
it: Classi
ja: クラス
ko: 클래스(복수)
nl: Klassen
ru: Классы
sv: Klasser
tr: Sınıflar
uk: Заняття

source: Interface Realization
ar: تحقيق الواجهة
bn: ইন্টারফেস উপলব্ধি
ca: Realització de la interfície
cs: Realizace rozhraní
fi: Rajapinnan realisaatio
fr: Réalisation de l'Interface
hi: इंटरफ़ेस कार्यान्वयन
hr: Realizacija sučelja
id: Realisasi Antarmuka
it: Realizzazione interfaccia
ja: インターフェイスの実現
ko: 인터페이스 실체화
nl: Interface Realizatie
pt_br: Realização de Interface
ru: Реализация Интерфейса
sv: Genomförande av gränssnitt
tr: Arayüz Gerçekleştirme
uk: Реалізація інтерфейсу

source: DataType
ar: نوع البيانات
bn: ডাটা প্রকার
ca: Tipus de dades
cs: Datový typ
fi: DataTyyppi
fr: TypeDonnée
hi: डेटाप्रकार
hr: Vrsta podataka
id: Tipe data
it: Tipo dato
ja: データ型
ko: 데이터형식
nl: GegevensType
pt_br: TipoDado
ru: ТипДанных
sv: Datatyp
tr: VeriTürü

source: primitive
ar: بدائي
bn: আদিম
ca: primitiu
cs: primitivní
fi: primitiivi
fr: primitif
hi: प्राचीन
hr: osnovni element
id: primitif
it: primitivo
ja: 原始的
ko: 원시적인
nl: primitieve
pt_br: primitivo
ru: примитив
sv: primitiv
tr: ilkel
uk: примітивний

source: valueType
ar: نوع القيمة
bn: মানপ্রকার
cs: typ hodnoty
fi: arvoTyyppi
fr: typeValeur
hi: मानप्रकार
hr: vrsta vrijednosti
id: nilaiTipe
ja: 値タイプ
ko: 값형식
nl: waardeType
pt_br: tipoValor
ru: типЗначения
tr: değerTürü

source: dataType
ar: نوع البيانات
bn: ডাটা প্রকার
cs: datový typ
fi: dataTyyppi
fr: donnéeType
hi: डेटाप्रकार
hr: vrsta podataka
id: tipe data
ja: データ型
ko: 데이터Type
nl: gegevensType
pt_br: tipoDado
ru: типДанных
sv: Datatyp
tr: veriTürü

source: use
ar: استعمال
bn: ব্যবহার
ca: utilitzar
cs: použít
fi: käytä
fr: utiliser
hi: उपयोग
hr: koristi
id: menggunakan
it: usa
ja: 使う
ko: 쓰다
nl: gebruiken
pt_br: usa
ru: использует
sv: använda
tr: kullan
uk: використовувати

source: realize
ar: يدرك
bn: উপলব্ধি করুন
ca: Adonem
cs: realizovat
fi: realisoi
fr: réaliser
hi: अहसास
hr: realiziraj
id: menyadari
it: realizza
ja: 思い知る
ko: 실현하다
nl: realiseren
pt_br: realiza
ru: реализует
sv: förverkliga
tr: gerçekleştir
uk: усвідомити

source: implements
ar: الأدوات
bn: বাস্তবায়ন
ca: Implementa
cs: implementace
fi: implementoi
fr: Implémentations
hi: लागू करता है
hr: implementacije
id: mengimplementasikan
it: Implementa
ja: 用具
ko: 구현
nl: implementeert
pt_br: Implementa
ru: имплементирует
sv: Implementerar
tr: uygular
uk: інвентар

source: enumeration
ar: تعداد
bn: গণনা
ca: enumeració
cs: výčet
fi: enumeraatio
fr: énumération
hi: गणना
hr: nabrajanje
id: pencacahan
it: enumerazione
ja: 列挙
ko: 열거형
nl: opsomming
pt_br: enumeração
ru: перечисление
sv: uppräkning
tr: numaralandırma
uk: перерахування

source: New Enumeration…
fi: Uusi enumeraatio…
fr: Nouvelle Énumération …
hi: नई गणना…
hr: Novo nabrajanje …
it: Nuova enumerazione…
nl: Nieuwe opsomming…
pt_br: Nova Enumeração…
ru: Новое перечисление…
tr: Yeni Numaralandırma…
uk: Новий перелік…

source: interface
ar: واجهه المستخدم
bn: ইন্টারফেস
ca: interfície
cs: rozhraní
fi: rajapinta
hi: इंटरफ़ेस
hr: sučelje
id: antarmuka
it: interfaccia
ja: インターフェイス
ko: 인터페이스
ru: интерфейс
sv: gränssnitt
tr: arayüz
uk: інтерфейс

source: stereotype
ar: الصورة النمطية
bn: স্টেরিওটাইপ
ca: estereotip
cs: stereotyp
fi: stereotyyppi
fr: stéréotype
hi: टकसाली
hr: stereotip
id: stereotip
it: stereotipo
ja: ステレオタイプ
ko: 스테레오 타입
pt_br: estereótipo
ru: стереотип
sv: stereotyp
tr: stereotip
uk: стереотип

source: metaclass
ar: ميتاكلاس
bn: মেটাক্লাস
ca: metaclasse
cs: metatřída
fi: metaluokka
fr: métaclasse
hi: मेटाक्लास
hr: metaklasa
id: kelas meta
it: metaclasse
ja: メタクラス
ko: 메타클래스
nl: meta-klasse
pt_br: metaclasse
ru: метакласс
sv: metaklass
tr: üstsınıf
uk: метаклас

source: profile
ar: الملف الشخصي
bn: প্রোফাইল
ca: perfil
cs: profil
fi: profiili
fr: profil
hi: प्रोफाइल
hr: profil
id: Profil
it: profilo
ja: プロフィール
ko: 윤곽
nl: profiel
pt_br: perfil
ru: профиль
sv: profil
tr: profil
uk: профіль
