Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Merge Model Changes
cs: Sloučit změny modelu
fi: Yhdistä mallimuutokset
fr: Fusionner les modifications du modèle
hi: मॉडल परिवर्तन मर्ज करें
hr: Promjene sjedinjavanja modela
it: Unisci cambiamenti modelli
nl: Modelwijzigingen samenvoegen
pt_br: Mesclar Alterações de Modelos
ru: Изменения при слиянии моделей
tr: Model Değişikliklerini Birleştir
uk: Злиття змін моделі

source: Apply incoming changes from the conflicting model. Use Undo to revert changes.
cs: Použijí se příchozí změny z konfliktního modelu. Pro vrácení změn použijte Undo.
fi: Toteuta muutokset ristiriidan aiheuttavasta mallista. Käytä kumoamistoimintoa peruaksesi muutokset.
fr: Appliquer les modifications reçues du modèle en conflit. Utiliser Annuler pour supprimer les modifications.
hi: विरोधाभासी मॉडल से आने वाले परिवर्तनों को लागू करें। परिवर्तनों को पूर्ववत करने के लिए पूर्ववत करें का उपयोग करें।
hr: Primijeni dolazne promjene iz konfliktnog modela. Koristi „Poništi” za vraćanje promjena.
it: Applica le modifiche in arrivo dal modello conflittuale. Usa annulla per ripristinarle.
nl: Inkomende wijzigingen van het conflicterende model toepassen. Gebruik ‘Ongedaan maken’ om de wijzigingen ongedaan te maken.
pt_br: Aplica as alterações recebidas do modelo conflitante. Use Desfazer para reverter as alterações.
ru: Применить входящие изменения из конфликтующей модели. Используйте «Отменить», чтобы отменить изменения.
tr: Çakışan modelden gelen değişiklikleri uygula. Değişiklikleri geri almak için Geri Al'ı kullanın.
uk: Застосувати вхідні зміни з конфліктуючої моделі. Щоб скасувати зміни, скористайтеся «Скасувати».

source: Resolve
cs: Vyřešit
fi: Selvitä
fr: Résoudre
hi: समाधान करें
hr: Riješi
it: Risolvi
nl: Oplossen
pt_br: Resolver
ru: Разрешить
tr: Çöz
uk: Вирішити

source: It looks like Gaphor is started from the command line. Do you want to open a debug session?
ar: يبدو أن Gaphor بدأ من سطر الأوامر. هل تريد فتح جلسة تصحيح؟
bn: দেখে মনে হচ্ছে গ্যাফর কমান্ড লাইন থেকে শুরু হয়েছে। আপনি কি একটি ডিবাগ সেশন খুলতে চান?
ca: Sembla que Gaphor s'inicia des de la línia d'ordres. Voleu obrir una sessió de depuració?
cs: Vypadá to, že se Gaphor spouští z příkazového řádku. Chcete otevřít relaci ladění?
fi: Vaikuttaa siltä, että Gaphor käynnistettiin komentoriviltä. Haluatko avata vianjäljitysistunnon?
fr: Il semble que Gaphor soit lancé depuis la ligne de commande. Voulez-vous ouvrir une session de débogage ?
hi: ऐसा लगता है कि गैफोर को कमांड लाइन से शुरू किया गया है। क्या आप डिबग सत्र खोलना चाहते हैं?
hr: Čini se da je Gaphor pokrenut iz naredbenog retka. Želiš li otvoriti sesiju otklanjanja grešaka?
id: Sepertinya Gaphor dimulai dari baris perintah. Apakah Anda ingin membuka sesi debug?
it: Sembra che Gaphor sia stato avviato dalla linea di comando. Vorresti aprire una sessione di debug?
ja: ガプホルはコマンドラインから起動しているように見えます。デバッグ セッションを開きますか?
ko: 가포를 명령행에서 실행한 것 같습니다. 디버깅 세션을 여시겠습니까?
nl: Het lijkt erop dat Gaphor is gestart via de opdrachtregel. Wilt u een foutopsporingssessie openen?
pt_br: Parece que o Gaphor foi iniciado pela linha de comando. Você quer abrir uma sessão de depuração?
ru: Похоже, что Gaphor запущен из командной строки. Вы хотите открыть сеанс отладки?
sv: Det ser ut som gaphor har startats från kommandoraden. Vill du öppna en felsökningssession?
tr: Gaphor komut satırından başlatılmış. Bir hata ayıklama oturumu açmak ister misiniz?
uk: Схоже, Gaphor запускається з командного рядка. Хочете відкрити сеанс налагодження?

source: Close
cs: Zavřít
fi: Sulje
fr: Fermer
hi: बंद करें
hr: Zatvori
it: Chiudi
nl: Sluiten
pt_br: Fechar
ru: Закрыть
tr: Kapat
uk: Закрити

source: Start Debug Session
cs: Spustit relaci ladění
fi: Käynnistä vianjäljitysistunto
fr: Démarrer la session de débogage
hi: डीबग सत्र प्रारंभ करें
hr: Pokreni sesiju otklanjanja grešaka
it: Inizia sessione di debug
nl: Foutopsporingssessie starten
pt_br: Iniciar Sessão de Depuração
ru: Начать Сеанс Отладки
tr: Hata Ayıklama Oturumunu Başlat
uk: Почати сеанс налагодження

source: Gaphor Models
cs: Všechny modely Gaphor
fi: Kaikki Gaphor-mallit
fr: Modèles Gaphor
hi: गैफोर मॉडल
hr: Svi Gaphor modeli
it: Modelli di Gaphor
nl: Alle Gaphor-modellen
pt_br: Modelos do Gaphor
ru: Все Модели Gaphor
tr: Tüm Gaphor Modelleri
uk: Моделі Gaphor

source: Images
fi: Kuvat
hi: छवियां
hr: Slike
it: Immagini
nl: Afbeeldingen
pt_br: Imagens
ru: Изображения
tr: Görüntüler
uk: Зображення

source: All Files
ar: كل الملفات
bn: সকল ফাইল
ca: Tots els fitxers
cs: Všechny soubory
fi: Kaikki tiedostot
fr: Tous les fichiers
hi: सभी फाइलें
hr: Sve datoteke
id: Semua data
it: Tutti i file
ja: すべてのファイル
ko: 모든 파일
nl: Alle bestanden
pt_br: Todos os Arquivos
ru: Все файлы
sv: Alla filer
tr: Tüm Dosyalar
uk: Усі файли

source: Flatpak Document Portal
fi: Flatpak-asiakirjaportaali
fr: Portail documentaire Flatpak
hr: Flatpak portal dokumenata
it: Portale documento Flatpak
ru: Портал документов Flatpak
uk: Портал документів Flatpak

source: Gaphor was not able to store the model, probably due to an internal error: {exc} If you think this is a bug, please contact the developers.
ar: لم يكن Gaphor قادرًا على تخزين النموذج ، ربما بسبب خطأ داخلي: {exc} إذا كنت تعتقد أن هذا خطأ ، فيرجى الاتصال بالمطورين.
bn: গ্যাফার মডেলটি সংরক্ষণ করতে সক্ষম হননি, সম্ভবত একটি অভ্যন্তরীণ ত্রুটির কারণে: {exc} আপনি যদি মনে করেন যে এটি একটি বাগ, দয়া করে ডেভেলপারদের সাথে যোগাযোগ করুন।
ca: Gaphor no va poder emmagatzemar el model, probablement a causa d'un error intern: {exc} Si creieu que es tracta d'un error, poseu-vos en contacte amb els desenvolupadors.
cs: Gaphor nebyl schopen model uložit, pravděpodobně kvůli vnitřní chybě: {exc} Pokud si myslíte, že se jedná o chybu, kontaktujte prosím vývojáře.
fi: Gaphor ei voinut tallettaa mallia, luultavasti sisäisen virheen vuoksi: {exc} Jos luulet tämän olevan ohjelmistovirhe, ole yhteydessä kehittäjiin.
fr: Gaphor n'a pas pu enregistrer le modèle, probablement en raison d'une erreur interne : {exc} Si vous pensez qu'il s'agit d'un bogue, veuillez contacter les développeurs.
hi: गैफोर मॉडल को संग्रहीत करने में सक्षम नहीं था, संभवतः एक आंतरिक त्रुटि के कारण: {exc} यदि आपको लगता है कि यह एक बग है, तो कृपया डेवलपर्स से संपर्क करें।
hr: Gaphor nije uspio spremiti model, vjerojatno zbog interne greške: {exc} Ako misliš da se radi o grešci, obrati se programerima.
id: Gaphor tidak dapat menyimpan model, mungkin karena kesalahan internal: {kecuali} Jika menurut Anda ini adalah bug, silakan hubungi pengembang.
it: Gaphor non è riuscito a memorizzare il modello, probabilmente per via di un errore interno: {exc} Se pensi che questo sia un bug, contatta gli sviluppatori.
ja: Gaphor は、おそらく内部エラーのためにモデルを保存できませんでした: {exc} これがバグだと思う場合は、開発者に連絡してください。
ko: 가포에서 모델을 저장할 수 없었습니다. 아마도 내부 오류 때문인 것 같습니다: {exc} 버그라 생각하신다면, 개발자에게 연락하십시오.
nl: Gaphor kon het model niet opslaan, waarschijnlijk als gevolg van een interne fout: {exc} Als u denkt dat dit een fout is, neem dan contact op met de ontwikkelaars.
pt_br: Gaphor não conseguiu armazenar o modelo, provavelmente devido a um erro interno: {exc} Se você acha que isso é um bug, entre em contato com os desenvolvedores.
ru: Gaphor не смог сохранить модель, вероятно, из-за внутренней ошибки: {exc} Если вы считаете, что это ошибка, пожалуйста, свяжитесь с разработчиками.
sv: Gaphor kunde inte lagra modellen, förmodligen på grund av ett internt fel: {exc} Om du tror att det här är ett fel, vänligen kontakta utvecklarna.
tr: Gaphor, muhtemelen dahili bir hata nedeniyle modeli depolayamadı: {exc} Bunun bir hata olduğunu düşünüyorsanız, lütfen geliştiricilerle iletişime geçin.
uk: Gaphor не зміг зберегти модель, ймовірно, через внутрішню помилку: {exc} Якщо ви вважаєте, що це помилка, зверніться до розробників.

source: You do not have the permissions necessary to save the model. Please check that you typed the location correctly and try again.
ar: ليس لديك الأذونات اللازمة لحفظ النموذج. يرجى التحقق من كتابة الموقع بشكل صحيح والمحاولة مرة أخرى.
bn: মডেলটি সংরক্ষণ করার জন্য প্রয়োজনীয় অনুমতিগুলি আপনার কাছে নেই। অনুগ্রহ করে পরীক্ষা করুন যে আপনি অবস্থানটি সঠিকভাবে টাইপ করেছেন এবং আবার চেষ্টা করুন।
ca: No teniu els permisos necessaris per desar el model. Comproveu que heu escrit la ubicació correctament i torneu-ho a provar.
cs: Nemáte potřebná oprávnění k uložení modelu. Zkontrolujte, zda jste správně zadali umístění, a zkuste to znovu.
fi: Käyttöoikeutesi eivät riitä mallin tallentamiseen. Varmista että kirjoitit sijainnin oikein ja yritä uudelleen.
fr: Vous ne disposez pas des autorisations nécessaires pour enregistrer le modèle. Vérifiez que vous avez saisi l'emplacement correctement et réessayez.
hi: आपके पास मॉडल को सहेजने के लिए आवश्यक अनुमतियां नहीं हैं। कृपया जाँच लें कि आपने स्थान सही ढंग से टाइप किया है और पुनः प्रयास करें।
hr: Nemaš potrebne dozvole za spremanje modela. Provjeri ispravnost upisanog mjesta i pokušaj ponovo.
id: Anda tidak memiliki izin yang diperlukan untuk menyimpan model. Harap periksa apakah Anda mengetik lokasi dengan benar dan coba lagi.
it: Non hai i permessi necessari per salvare il modello. Controlla che hai digitato la posizione corretta e riprova.
ja: モデルを保存するために必要な権限がありません。 正しく入力した場所を確認して、やり直してください。
ko: 모델 저장에 필요한 권한이 없습니다. 위치를 올바르게 입력했는지 확인하고 다시 시도하십시오.
nl: U beschikt niet over de machtigingen die nodig zijn om het model op te slaan. Controleer of u de locatie correct hebt getypt en probeer het opnieuw.
pt_br: Você não tem as permissões necessárias para salvar o modelo. Verifique se você digitou o local corretamente e tente novamente.
ru: У вас нет разрешений, необходимых для сохранения модели. Проверьте, правильно ли вы ввели расположение, и повторите попытку.
sv: Du har inte de behörigheter som krävs för att spara modellen. Kontrollera att du har skrivit platsen korrekt och försök igen.
tr: Modeli kaydetmek için gerekli izinleriniz yok. Konumu doğru yazdığınızdan emin olun ve tekrar deneyin.
uk: У вас немає прав, необхідних для збереження моделі. Будь ласка, перевірте, чи правильно ви ввели місцезнаходження, і повторіть спробу.

source: You do not have enough free space on the device to save the model. Please free up some disk space and try again or save it in a different location.
ar: ليس لديك مساحة خالية كافية على الجهاز لحفظ الطراز. الرجاء إخلاء بعض مساحة القرص والمحاولة مرة أخرى أو حفظها في موقع مختلف.
bn: মডেলটি সংরক্ষণ করার জন্য আপনার ডিভাইসে পর্যাপ্ত খালি জায়গা নেই। অনুগ্রহ করে কিছু ডিস্ক স্থান খালি করুন এবং আবার চেষ্টা করুন অথবা এটি একটি ভিন্ন অবস্থানে সংরক্ষণ করুন।
ca: No teniu prou espai lliure al dispositiu per desar el model. Allibereu espai de disc i torneu-ho a provar o deseu-lo en una altra ubicació.
cs: V zařízení nemáte dostatek volného místa pro uložení modelu. Uvolněte místo na disku a zkuste to znovu nebo jej uložte na jiné místo.
fi: Laitteella ei ole riittävästi vapaata tilaa mallin tallentamiseksi. Vapauta levytilaa ja yritä uudelleen tai tallenna eri sijaintiin.
fr: Vous n'avez pas assez d'espace libre sur l'appareil pour enregistrer le modèle. Libérez de l'espace disque et réessayez ou enregistrez le modèle à un autre endroit.
hi: आपके उपकरण पर मॉडल को सहेजने के लिए पर्याप्त खाली स्थान नहीं है। कृपया कुछ डिस्क स्थान खाली करें और पुनः प्रयास करें या इसे किसी अन्य स्थान पर सहेजें।
hr: Za spremanje modela nemaš dovoljno slobodnog prostora na uređaju. Oslobodi dio prostora na disku i pokušaj ponovo ili spremi model na jedno drugo mjesto.
id: Anda tidak memiliki cukup ruang kosong di perangkat untuk menyimpan model. Kosongkan sebagian ruang disk dan coba lagi atau simpan di lokasi lain.
it: Non hai abbastanza spazio libero nel dispositivo per salvare il modello. Libera un po' di spazio sul disco e riprova oppure salvalo in una posizione diversa.
ja: モデルを保存するための十分な空き領域がデバイスにありません。 ディスク領域を増やしてから、もう一度やり直すか、別の場所に保存してください。
ko: 모델을 저장할 장치에 충분한 공간이 없습니다. 디스크 일부 공간을 비운 후 다시 시도하시거나 다른 위치에 저장하십시오.
nl: U hebt niet genoeg vrije ruimte op het apparaat om het model op te slaan. Maak wat schijfruimte vrij en probeer het opnieuw, of sla het op een andere locatie op.
pt_br: Você não tem espaço livre suficiente no dispositivo para salvar o modelo. Libere espaço em disco e tente novamente ou salve-o em um local diferente.
ru: Вам не хватает свободного места на устройстве для сохранения модели. Пожалуйста, освободите место на диске и повторите попытку или сохраните модель в другом месте.
sv: Du har inte tillräckligt med ledigt utrymme på enheten för att spara modellen. Frigör lite diskutrymme och försök igen eller spara det på en annan plats.
tr: Modeli kaydetmek için aygıtta yeterli boş alanınız yok. Lütfen biraz disk alanı boşaltıp tekrar deneyin veya farklı bir konuma kaydedin.
uk: У вас недостатньо вільного місця на пристрої для збереження моделі. Звільніть місце на диску та спробуйте ще раз або збережіть його в іншому місці.

source: The model cannot be stored at this location: {exc} Please check that you typed the location correctly and try again.
ar: لا يمكن تخزين النموذج في هذا الموقع: {exc} يرجى التحقق من كتابة الموقع بشكل صحيح والمحاولة مرة أخرى.
bn: মডেলটি এই অবস্থানে সংরক্ষণ করা যাবে না: {exc} অনুগ্রহ করে পরীক্ষা করুন যে আপনি অবস্থানটি সঠিকভাবে টাইপ করেছেন এবং আবার চেষ্টা করুন।
ca: El model no es pot emmagatzemar en aquesta ubicació: {exc} Comproveu que heu escrit la ubicació correctament i torneu-ho a provar.
cs: Na tomto místě nelze model uložit: {exc}. Zkontrolujte prosím, zda jste zadali umístění správně, a zkuste to znovu.
fi: Mallia ei voi tallettaa tähän sijaintiin: {exc} Varmista että kirjoitit sijainnin oikein ja yritä uudelleen.
fr: Le modèle ne peut pas être stocké à cet emplacement : {exc} Veuillez vérifier que vous avez saisi l’emplacement correctement et réessayer.
hi: मॉडल को इस स्थान पर संग्रहीत नहीं किया जा सकता: {exc} कृपया जाँच लें कि आपने स्थान सही टाइप किया है और पुनः प्रयास करें।
hr: Model se ne može spremiti na ovom mjestu: {exc} Provjeri ispravnost upisanog mjesta i pokušaj ponovo.
id: Model tidak dapat disimpan di lokasi ini: {kecuali} Harap periksa apakah Anda mengetik lokasi dengan benar dan coba lagi.
it: Il modello non può essere memorizzato in questa posizione: {exc} Controlla che hai digitato la posizione corretta e riprova.
ja: モデルは次の場所に保存できません。 {exc} 正しく入力した場所を確認して、やり直してください。
ko: 모델을 이 위치에 저장할 수 없습니다: {exc} 위치를 올바르게 입력했는지 확인하고 다시 시도하십시오.
nl: Het model kan niet worden opgeslagen op deze locatie: {exc} Controleer of u de locatie correct heeft ingevoerd en probeer opnieuw.
pt_br: O modelo não pode ser armazenado neste local: {exc} Verifique se você digitou o local corretamente e tente novamente.
ru: Модель не может быть сохранена в следующем расположении: {exc} Проверьте, правильно ли вы ввели расположение, и повторите попытку.
sv: Modellen kan inte lagras på den här platsen: {exc} Kontrollera att du har skrivit platsen korrekt och försök igen.
tr: Model şu konumda depolanamaz: {exc} Konumu doğru yazdığınızdan emin olun ve tekrar deneyin.
uk: Модель не можна зберігати в цьому місці: {exc} Будь ласка, перевірте, чи правильно ви ввели місцезнаходження, і повторіть спробу.

source: Loading…
ar: جار التحميل…
bn: লোড।।।
ca: S'està carregant…
cs: Načítání…
fi: Ladataan…
fr: Chargement…
hi: लोड हो रहा है…
hr: Učitavanje …
id: Memuat…
it: Caricamento in corso…
ja: 積載。。。
ko: 불러오는 중...
nl: Laden…
pt_br: Carregando…
ru: Загрузка…
sv: Läser in…
tr: Yükleniyor…
uk: Завантаження…

source: Loading model from {filename}
ar: تحميل النموذج من {filename}
bn: {filename} থেকে মডেল লোড করা হচ্ছে
ca: S'està carregant el model des de {filename}
cs: Načítání modelu z {filename}
fi: Ladataan mallia tiedostosta {filename}
fr: Chargement du modèle à partir de {filename}
hi: {filename} से मॉडल लोड हो रहा है
hr: Učitavanje modela iz {filename}
id: Memuat model dari {filename}
it: Caricamento modello da {filename}
ja: {filename} からモデルを読み込む
ko: {filename}에서 모델 불러오는 중
nl: Laden van model {filename}
pt_br: Carregando modelo de {filename}
ru: Загрузка модели из {filename}
sv: Läser in modell från {filename}
tr: {filename} dosyasından model yükleniyor
uk: Завантаження моделі з {filename}

source: Loading current and incoming model
cs: Načítání aktuálního a příchozího modelu
fi: Ladataan nykyistä ja tulevaa mallia
fr: Chargement du modèle actuel et du modèle entrant
hi: वर्तमान और आने वाले मॉडल लोड हो रहे हैं
hr: Učitavanje trenutačnog i dolaznog modela
it: Caricamento modello corrente e in arrivo
nl: Huidig en binnenkomend model aan het laden
pt_br: Carregando modelo atual e o recebido
ru: Загрузка текущей и входящей модели
tr: Geçerli ve gelen modelin yüklenmesi
uk: Завантаження поточної та вхідної моделі

source: Unable to open model “{filename}”.
ar: تعذر فتح النموذج "{filename}".
bn: মডেল "{filename}" খুলতে অক্ষম।
ca: No es pot obrir el model "{filename}".
cs: Nelze otevřít model "{filename}".
fi: Mallia “{filename}” ei voitu avata.
fr: Impossible d'ouvrir le modèle « {filename} ».
hi: मॉडल “{filename}” खोलने में असमर्थ।
hr: Nije moguće otvoriti model „{filename}”.
id: Tidak dapat membuka model “{filename}”.
it: Impossibile aprire il modello “{filename}”.
ja: モデル "{filename}" を開くことができません。
ko: “{filename}” 모델을 열 수 없습니다.
nl: Kan model “{filename}” niet openen.
pt_br: Não foi possível abrir o modelo “{filename}”.
ru: Не удается открыть модель “{filename}”.
sv: Det gick inte att öppna modellen {filename}.
tr: “{filename}” modeli açılamadı.
uk: Неможливо відкрити модель “{filename}”.

source: This file does not contain a valid Gaphor model.
ar: لا يحتوي هذا الملف على نموذج Gaphor صالح.
bn: এই ফাইলটিতে একটি বৈধ Gaphor মডেল নেই।
ca: Aquest fitxer no conté un model gaphor vàlid.
cs: Tento soubor neobsahuje platný model Gaphor.
fi: Tämä tiedosto ei sisällä kelvollista Gaphor-mallia.
fr: Ce fichier ne contient pas un modèle Gaphor valide.
hi: इस फाइल में मान्य गैफ़ोर मॉडल नहीं है।
hr: Ova datoteka ne sadrži valjan Gaphor model.
id: File ini tidak berisi model Gaphor yang valid.
it: Questo file non contiene un modello di Gaphor valido.
ja: このファイルには、有効な Gaphor モデルが含まれていません。
ko: 이 파일에 적절한 가포 모델이 없습니다.
nl: Dit bestand bevat geen valide Gaphor model.
pt_br: Este arquivo não contém um modelo Gaphor válido.
ru: Этот файл не содержит допустимую модель Gaphor.
sv: Den här filen innehåller ingen giltig Gaphor-modell.
tr: Bu dosya geçerli bir Gaphor modeli içermiyor.
uk: Цей файл не містить дійсної моделі Gaphor.

source: Saving…
ar: إنقاذ…
bn: সংরক্ষণ।।।
ca: Estalvi…
cs: Ukládání…
fi: Tallennetaan…
fr: Sauvegarder …
hi: सहेजा जा रहा है…
hr: Spremanje …
id: Penghematan…
it: Salvataggio…
ja: 節約。。。
ko: 저장중...
nl: Opslaan…
pt_br: Salvando…
ru: Сохранение…
sv: Besparing…
tr: Kaydediliyor…
uk: Збереження…

source: Saving model to {filename}
ar: حفظ النموذج في {filename}
bn: {filename}-এ মডেল সংরক্ষণ করা হচ্ছে
ca: S'està carregant el model des de {filename}
cs: Ukládání modelu do {filename}
fi: Tallennetaan mallia tiedostoon {filename}
fr: Enregistrer an ficher {filename}
hi: मॉडल को {filename} में सहेजा जा रहा है
hr: Spremanje modela u {filename}
id: Menyimpan model ke {filename}
it: Salvataggio del modello in {filename}
ja: モデルを {filename} に保存する
ko: {filename}으로 모델 저장하는 중
nl: Opslaan van model {filename}
pt_br: Salvando o modelo em {filename}
ru: Сохранение модели в {filename}
sv: Spara modell till {filename}
tr: Model {filename} dosyasına kaydediliyor
uk: Збереження моделі в {filename}

source: Unable to save model “{filename}”.
ar: تعذر حفظ النموذج "{filename}".
bn: মডেল "{filename}" সংরক্ষণ করতে অক্ষম।
ca: No es pot desar el model "{filename}".
cs: Nelze uložit model "{filename}".
fi: Ei voi tallentaa mallia “{filename}”.
fr: Impossible de sauvegarder le modèle "{filename}".
hi: मॉडल “{filename}” को सहेजने में असमर्थ।
hr: Nije moguće spremiti model „{filename}”.
id: Tidak dapat menyimpan model “{filename}”.
it: Impossibile salvare il modello “{filename}”.
ja: モデル"{filename}"を保存できませんでした。
ko: “{filename}” 모델을 저장할 수 없습니다.
nl: Kan model {filename} niet opslaan.
pt_br: Não foi possível salvar o modelo “{filename}”.
ru: Не удалось сохранить модель в “{filename}”.
sv: Det går inte att spara modellen "{filename}".
tr: “{filename}” modeli kaydedilemedi.
uk: Не вдалося зберегти модель “{filename}”.

source: Model has been saved.
fi: Malli on tallennettu.
fr: Le modèle a été sauvegardé.
hr: Model je spremljen.
it: Il modello è stato salvato.
nl: Model is opgeslagen.
ru: Модель сохранена.
uk: Модель збережено.

source: Save Gaphor Model As
ar: حفظ نموذج Gaphor باسم
bn: এইরূপে Gaphor মডেল সংরক্ষণ করুন
ca: Desa el model de gaphor com a
cs: Uložit model Gaphor jako
fi: Tallenna Gaphor-malli nimellä
fr: Enregistrer le modèle Gaphor sous
hi: गैफोर मॉडल ऐसे सहेजें
hr: Spremi Gaphor model kao
id: Simpan Model Gaphor Sebagai
it: Salva modello Gaphor come
ja: [名前を付けてガファー モデルを保存]
ko: 다른 이름으로 가포 모델 저장
nl: Gaphor-model opslaan als
pt_br: Salvar Modelo Gaphor Como
ru: Сохранить модель Gaphor как
sv: Spara Gaphor-modell som
tr: Gaphor Modelini Farklı Kaydet
uk: Зберегти модель Гафора як

source: New Model
fi: Uusi malli
fr: Nouveau modèle
hi: नए मॉडल
hr: Novi model
it: Nuovo modello
nl: Nieuw model
pt_br: Novo Modelo
ru: Новая Модель
tr: Yeni Model
uk: Нова Модель

source: Resolve Merge Conflict?
cs: Vyřešit konflikt sloučení?
fi: Selvitetäänkö yhdistämisen ristiriita?
fr: Résoudre le conflit de fusion ?
hi: मर्ज विवाद का समाधान करें?
hr: Riješiti konflikt sjedinjavanja?
it: Risolvere il conflitto di unione?
nl: Samenvoegingsconflict oplossen?
pt_br: Resolver Conflito de Mesclagem?
ru: Разрешить Конфликт Слияния?
tr: Birleştirme Çakışması Çözülsün Mü?
uk: Вирішити конфлікт злиття?

source: The model you are opening contains a merge conflict. Do you want to open the current model or the incoming change to the model?
cs: Otevíraný model obsahuje konflikt sloučení. Chcete otevřít aktuální model nebo příchozí změnu modelu?
fi: Malli, jonka olet avaamassa, sisältää yhdistämisen ristiriidan. Haluatko avata nykyisen mallin vai kyseiseen malliin kohdistuvan muutoksen?
fr: Le modèle que vous ouvrez contient un conflit de fusion. Voulez-vous ouvrir le modèle actuel ou la nouvelle modification du modèle ?
hi: आप जिस मॉडल को खोल रहे हैं, उसमें मर्ज विवाद है। क्या आप मौजूदा मॉडल या मॉडल में आने वाले बदलाव को खोलना चाहते हैं?
hr: Model koji otvaraš sadrži konflikt u sjedinjavanju. Želiš li otvoriti aktualni model ili dolaznu promjenu modela?
it: Il modello che stai aprendo contiene un conflitto di unione. Vorresti aprire il modello attuale o il cambiamento in arrivo al modello?
nl: Het model dat u probeert te openen bevat een samenvoegingsconflict. Wilt u het huidige model, of de inkomende wijziging van het model openen?
pt_br: O modelo que você está abrindo contém um conflito de mesclagem. Você deseja abrir o modelo atual ou a alteração recebida no modelo?
ru: Модель, которую вы открываете, содержит конфликт слияния. Вы хотите открыть текущую модель или входящие изменения в модель?
tr: Açmakta olduğunuz model birleştirme çakışması içeriyor. Geçerli modeli mi yoksa modele gelen değişikliği mi açmak istiyorsunuz?
uk: Модель, яку ви відкриваєте, містить конфлікт злиття. Бажаєте відкрити поточну модель чи вхідну зміну моделі?

source: Cancel
cs: Zrušit
fi: Peru
fr: Annuler
hi: रद्द करें
hr: Odustani
it: Annulla
nl: Annuleren
pt_br: Cancelar
ru: Отмена
tr: İptal
uk: Скасувати

source: Open Merge Editor
cs: Otevřít editor sloučení
fi: Avaa yhdistämismuokkain
fr: Ouvrir l'éditeur de fusion
hi: मर्ज संपादक खोलें
hr: Otvori uređivač sjedinjavanja
it: Apri editor di unione
nl: Samenvoegingsbewerker openen
pt_br: Abrir Editor de Mesclagem
ru: Открыть редактор слияния
tr: Birleştirme Düzenleyicisini Aç
uk: Відкрийте редактор злиття

source: Open Current
cs: Otevřít aktuální
fi: Avaa nykyinen
fr: Ouvir l'Actuel
hi: वर्तमान खोलें
hr: Otvori aktualno
it: Apri attuale
nl: Huidige openen
pt_br: Abrir Atual
ru: Открыть Текущую
tr: Geçerliyi Aç
uk: Відкрийте Current
