Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: First Class
ar: الصف الأول
bn: প্রথম শ্রেণী
ca: Primera classe
cs: První třída
fi: Ensimmäinen luokka
fr: Méta-classe
hi: मुख्य वर्ग
hr: Prva klasa
id: Kelas utama
ja: 一流
ko: 일등
nl: Eerste klasse
pt_br: Primeira Classe
ru: Первый Класс
sv: Första klass
tr: İlk Sınıf
uk: Перший клас

source: firstName
ar: الاسم الاول
bn: প্রথম নাম
ca: nom
cs: jméno
fi: etuNimi
fr: prénom
hi: प्रथमनाम
hr: ime
id: nama depan
ja: ファーストネーム
ko: 이름 이름
nl: voorNaam
pt_br: primeiroNome
ru: имя
sv: förnamn
tr: ilkAd
uk: ім'я та прізвище

source: lastName
ar: الكنية
bn: শেষ নাম
ca: últim nom
cs: příjmení
fi: sukuNimi
fr: nom de famille
hi: अंतिमनाम
hr: prezime
id: nama keluarga
ja: ラストネーム
ko: 성이름
nl: achterNaam
pt_br: sobrenome
ru: фамилия
sv: efternamn
tr: sonAd
uk: Прізвище

source: Login
ar: تسجيل الدخول
bn: লগইন
ca: Connexió
cs: Přihlásit se
fi: Kirjautuminen
fr: Connectez-vous
hi: लॉगिन
hr: Prijava
id: Gabung
ja: ログイン
ko: 로그인
nl: Inloggen
ru: Вход
sv: Logga in
tr: Giriş
uk: Логін

source: lastLogin
ar: آخر تسجيل دخول
cs: poslední přihlášení
fi: viimeisinKirjautuminen
fr: LoginPrécédent
hi: अंतिमलॉगिन
hr: zadnja prijava
id: login terakhir
ja: ラストログイン
ko: 라스트로인
nl: laatsteLogin
pt_br: últimaLogin
ru: последнийВход
tr: sonGiriş
uk: Останній Логін

source: Second Class
ar: الصف الثاني
bn: দ্বিতীয় শ্রেণী
ca: Segona classe
cs: Druhá třída
fi: Toinen luokka
fr: Classe 2
hi: द्रितीय श्रेणी
hr: Druga klasa
id: Kelas kedua
ja: 二等
ko: 두 번째 클래스
nl: Tweede klasse
pt_br: Segunda Classe
ru: Второй Класс
sv: Andra klass
tr: İkinci Sınıf
uk: Другий клас

source: released
ar: صدر
bn: মুক্তি
ca: Alliberat
cs: vydáno
fi: julkaistu
fr: libéré
hi: प्रकाशित
hr: objavljeno
id: dilepaskan
ja: リリース
ko: 출시
nl: uitgegeven
pt_br: lançado
ru: освобождённый
sv: Släppt
tr: yayınlandı
uk: звільнений

source: Implementation Architecture
ar: هيكل التنفيذ
bn: বাস্তবায়ন আর্কিটেকচার
ca: Arquitectura d'implementació
cs: Implementační architektura
fi: Toteutusarkkitehtuuri
fr: Architecture de mise en œuvre
hi: कार्यान्वयन आर्किटेक्चर
hr: Arhitektura implementacije
id: Arsitektur Implementasi
ja: 実装アーキテクチャ
ko: 구현 아키텍처
nl: Implementatie-architectuur
pt_br: Arquitetura da Implementação
ru: Архитектура Реализации
sv: Arkitektur för implementering
tr: Uygulama Mimarisi
uk: Архітектура реалізації

source: Node 1
ar: العقدة 1
bn: নোড 1
cs: Uzel 1
fi: Solmu 1
fr: Nœud 1
hr: Čvor 1
id: simpul 1
ja: ノード 1
ko: 노드 1
nl: Knoop 1
pt_br: Nó 1
ru: Узел 1
sv: Nod 1
tr: Düğüm 1
uk: Вузол 1

source: Artifact 1
ar: قطعة أثرية 1
ca: Artefacte 1
cs: Artefakt 1
fi: Artefakti 1
fr: Artéfact 1
hi: विरूपण-साक्ष्य 1
hr: Artefakt 1
id: Artefak 1
ja: アーティファクト1
ko: 아티팩트 1
nl: Artefact 1
pt_br: Artefato 1
ru: Артефакт 1
sv: Artefakt 1
tr: Yapıt 1
uk: Артефакт 1

source: Node 2
ar: العقدة 2
bn: নোড 2
cs: Uzel 2
fi: Solmu 2
fr: Nœud 2
hi: नोड 2
hr: Čvor 2
id: simpul 2
ja: ノード 2
ko: 노드 2
nl: Knoop 2
pt_br: Nó 2
ru: Узел 2
sv: Nod 2
tr: Düğüm 2
uk: Вузол 2

source: protocol
ar: بروتوكول
bn: প্রোটোকল
cs: protokol
fi: protokolla
fr: protocole
hi: प्रोटोकॉल
hr: protokol
id: protokol
ja: 議定書
ko: 프로토콜
pt_br: protocolo
ru: протокол
sv: protokoll
tr: iletişim kuralı
uk: протокол

source: Artifact 2
ar: قطعة أثرية 2
ca: Artefacte 2
cs: Artefakt 2
fi: Artefakti 2
fr: Artéfact 2
hi: विरूपण-साक्ष्य 2
hr: Artefakt 2
id: Artefak 2
ja: アーティファクト2
ko: 아티팩트 2
nl: Artefact 2
pt_br: Artefato 2
ru: Артефакт 2
sv: Artefakt 2
tr: Yapıt 2
uk: Артефакт 2

source: Analyze functional requirements by identifying user roles – actors – and associating them to their use cases.
ar: تحليل المتطلبات الوظيفية من خلال تحديد أدوار المستخدم - الجهات الفاعلة - و ربطهم بحالات الاستخدام الخاصة بهم.
bn: দ্বারা কার্যকরী প্রয়োজনীয়তা বিশ্লেষণ করুন ব্যবহারকারীর ভূমিকা সনাক্তকরণ - অভিনেতা - এবং তাদের ব্যবহারের ক্ষেত্রে তাদের সংযুক্ত করা।
ca: Analitzar els requisits funcionals per identificar rols d'usuari –actors– i associar-los als seus casos d'ús.
cs: Analyzujte funkční požadavky pomocí identifikace uživatelských rolí - aktérů - a jejich přiřazení k případům užití.
fi: Analysoi toiminnallisia vaatimuksia tunnistamalla käyttäjäroolit – toimijat – ja liittämällä roolit käyttötapauksiin.
fr: Analyser les exigences fonctionnelles en identifiant les rôles des utilisateurs - les acteurs - et en les associant à leurs cas d'utilisation.
hi: उपयोगकर्ता भूमिकाओं - अभिनेताओं - की पहचान करके और उन्हें उनके उपयोग के मामलों से जोड़कर कार्यात्मक आवश्यकताओं का विश्लेषण करें।
hr: Analiziraj funkcionalne uvjete putem prepoznavanja korisničkih uloga (sudionika) i povezivanjem sudionika s njihovim slučajevima primjene.
id: Analisis kebutuhan fungsional dengan mengidentifikasi peran pengguna – aktor – dan mengaitkannya dengan kasus penggunaan mereka.
ja: 機能要件の分析 ユーザー ロールの識別 – アクター – および ユース ケースに関連付ける。
ko: 기능 적 요구 사항을 분석합니다. 사용자 역할 식별 - 행위자 및 사용 사례에 연결합니다.
nl: Analyseer functionele vereisten door het identificeren van gebruikersrollen – actoren – en ze te associëren met hun doeleinden.
pt_br: Analise os requisitos funcionais identificando funções do usuário (atores) e associando-os aos seus casos de uso.
ru: Анализируйте функциональные требования, определив роли пользователей – акторов – и связав их с их прецедентами.
sv: Analysera funktionskrav genom att identifiera användarroller – aktörer – och associera dem med deras användningsfall.
tr: Kullanıcı rollerini – eylemcileri – tanımlayarak ve bunları kullanım durumlarıyla ilişkilendirerek işlevsel gereksinimleri analiz edin.
uk: Проаналізуйте функціональні вимоги визначення ролей користувачів – акторів – і пов’язуючи їх із варіантами використання.

source: Model abstract use case implementation by creating activity diagrams visualizing activity flows for primary and secondary use case scenarios.
ar: نموذج تنفيذ حالة استخدام مجردة من خلال إنشاء مخططات نشاط تصور تدفقات النشاط لسيناريوهات حالة الاستخدام الأساسي والثانوي.
bn: প্রাথমিক এবং মাধ্যমিক ব্যবহারের ক্ষেত্রে পরিস্থিতিগুলির জন্য ক্রিয়াকলাপ প্রবাহের ভিজ্যুয়ালাইজিং ক্রিয়াকলাপ ডায়াগ্রাম তৈরি করে মডেল বিমূর্ত ব্যবহারের ক্ষেত্রে বাস্তবায়ন।
ca: Modela la implementació de casos d'ús abstracte mitjançant la creació de diagrames d'activitat que visualitzen els fluxos d'activitat per als escenaris de casos d'ús primari i secundari.
cs: Modelování abstraktní implementace případů užití vytvořením diagramů aktivit vizualizujících toky aktivit pro primární a sekundární scénáře případů užití.
fi: Mallinna abstrakteja käyttötapaustoteutuksia luomalla aktiviteettikaavioita toimintojen virran visualisoimiseksi ensi- ja toissijaisia käyttötapausskenaarioita varten.
fr: Modélisez l’implémentation de cas d’utilisation abstraits en créant des diagrammes d’activité visualisant les flux d’activité pour les scénarios de cas d’utilisation principaux et secondaires.
hi: प्राथमिक और द्वितीयक उपयोग केस परिदृश्यों के लिए गतिविधि प्रवाह को दर्शाने वाले गतिविधि आरेख बनाकर अमूर्त उपयोग केस कार्यान्वयन का मॉडल तैयार करें।
hr: Modeliraj implementaciju apstraktnog slučaja primjene stvaranjem dijagrama aktivnosti, vizualizirajući tokove aktivnosti za scenarije primarnih i sekundarnih slučajeva primjene.
id: Modelkan implementasi kasus penggunaan abstrak dengan membuat diagram aktivitas yang memvisualisasikan alur aktivitas untuk skenario kasus penggunaan primer dan sekunder.
ja: 1 次ユース ケース シナリオと 2 次ユース ケース シナリオのアクティビティ フローを視覚化するアクティビティ図を作成して、抽象的なユース ケースの実装をモデル化します。
ko: 기본 및 보조 사용 사례 시나리오에 대한 활동 흐름을 시각화하는 활동 다이어그램을 만들어 추상 사용 사례 구현을 모델링합니다.
nl: Modelleer abstracte doeleinde-implementaties door activiteitsdiagrammen te maken die activiteitsstromen visualiseren voor primaire en secundaire doeleindescenario's.
pt_br: Modele a implementação abstrata de casos de uso criando diagramas de atividade visualizando fluxos de atividade para cenários de caso de uso primário e secundário.
ru: Моделируйте реализацию абстрактного прецедента, создав диаграммы деятельности, визуализирующие потоки действий для основных и второстепенных прецедентов.
sv: Modell abstrakt användnings fall implementering genom att skapa aktivitets diagram visualisera aktivitets flöden för primära och sekundära användnings fall scenarier.
tr: Birincil ve ikincil kullanım örneği senaryoları için etkinlik akışlarını görselleştiren etkinlik diyagramları oluşturarak soyut kullanım örneği uygulamasını modelleyin.
uk: Змоделюйте реалізацію абстрактного варіанту використання, створивши діаграми діяльності, що візуалізують потоки дій для основних і вторинних сценаріїв використання.

source: Perform domain analysis by modeling domain entities and their relationships using simplified class diagram. This diagram will serve as a visual dictionary of concepts. It will also be a starting point for your design-level data model.
ar: قم بإجراء تحليل المجال عن طريق نمذجة كيانات المجال وعلاقاتها باستخدام مخطط فئة مبسط. سيكون هذا الرسم البياني بمثابة قاموس مرئي للمفاهيم. سيكون أيضًا نقطة انطلاق لنموذج البيانات على مستوى التصميم الخاص بك.
bn: সরলীকৃত ক্লাস ডায়াগ্রাম ব্যবহার করে ডোমেন সত্তা এবং তাদের সম্পর্কগুলি মডেলিং করে ডোমেন বিশ্লেষণ সম্পাদন করুন। এই চিত্রটি ধারণাগুলির একটি চাক্ষুষ অভিধান হিসাবে কাজ করবে। এটি আপনার ডিজাইন-স্তরের ডেটা মডেলের জন্য একটি প্রারম্ভিক বিন্দুও হবে।
ca: Realitzar anàlisis de dominis modelant entitats de domini i les seves relacions utilitzant diagrama de classes simplificat. Aquest diagrama servirà com a diccionari visual de conceptes. També serà un punt de partida per al vostre model de dades a nivell de disseny.
cs: Proveďte analýzu domény modelováním entit domény a jejich vztahů pomocí zjednodušeného diagramu tříd. Tento diagram bude sloužit jako vizuální slovník pojmů. Bude také výchozím bodem pro váš datový model na úrovni návrhu.
fi: Suorita toimialueanalyysejä mallintamalla toimialueen entiteetit ja niiden suhteet käyttäen yksinkertaistettua luokkakaaviota. Tämä kaavio toimii konseptien visuaalisena sanastona. Se toimii myös aloituspisteenä suunnittelutason tietomallille.
fr: Effectuez une analyse de domaine en modélisant les entités de domaine et leurs relations à l’aide d’un diagramme de classes simplifié. Ce diagramme servira de dictionnaire visuel des concepts. Ce sera également un point de départ pour votre modèle de données au niveau de la conception.
hi: सरलीकृत वर्ग आरेख का उपयोग करके डोमेन इकाइयों और उनके संबंधों को मॉडलिंग करके डोमेन विश्लेषण करें। यह आरेख अवधारणाओं के दृश्य शब्दकोश के रूप में काम करेगा। यह आपके डिज़ाइन-स्तरीय डेटा मॉडल के लिए एक प्रारंभिक बिंदु भी होगा।
hr: Izvrši analizu domene modeliranjem entiteta domene i njihovih odnosa koristeći pojednostavljeni dijagram klasa. Ovaj dijagram poslužit će kao vizualni rječnik koncepata. To će također biti početna točka za tvoj model podataka na razini dizajna.
id: Lakukan analisis domain dengan memodelkan entitas domain dan hubungannya menggunakan diagram kelas yang disederhanakan. Diagram ini akan berfungsi sebagai kamus visual konsep. Ini juga akan menjadi titik awal untuk model data tingkat desain Anda.
ja: 簡略化されたクラス図を使用して、ドメイン エンティティとその関係をモデル化してドメイン分析を実行します。この図は、概念のビジュアル辞書として機能します。また、設計レベルのデータ モデルの出発点にもなります。
ko: 간소화된 클래스 다이어그램을 사용하여 도메인 엔터티 및 관계를 모델링하여 도메인 분석을 수행합니다. 이 다이어그램은 개념의 시각적 사전 역할을 합니다. 또한 설계 수준 데이터 모델의 시작점이 될 것입니다.
nl: Voer domeinanalyses uit door domeinentiteiten en hun relaties te modelleren met behulp van een vereenvoudigd klassendiagram. Dit diagram zal dienen als een visueel woordenboek van concepten. Het zal ook een startpunt zijn voor uw gegevensmodel op ontwerpniveau.
pt_br: Faça a análise de domínio modelando entidades de domínio e seus relacionamentos usando diagrama de classe simplificado. Este diagrama servirá como um dicionário visual de conceitos. Também será um ponto de partida para o seu modelo de dados de nível de design.
ru: Выполняйте анализ предметной области путём моделирования доменных объектов и их связей с помощью упрощённой диаграммы классов. Эта диаграмма будет служить визуальным словарём понятий. Это также станет отправной точкой для модели данных уровня проектирования.
sv: Utför domänanalys genom att modellera domänentiteter och deras relationer med hjälp av förenklat klassdiagram. Det här diagrammet fungerar som en visuell ordlista med begrepp. Det kommer också att vara en utgångspunkt för din datamodell på designnivå.
tr: Basitleştirilmiş sınıf diyagramını kullanarak etki alanı varlıklarını ve bunların ilişkilerini modelleyerek etki alanı analizi gerçekleştirin. Bu diyagram bir görsel kavram sözlüğü görevi görecektir. Aynı zamanda tasarım düzeyindeki veri modeliniz için de başlangıç noktası olacaktır.
uk: Виконуйте аналіз домену, моделюючи сутності домену та їхні зв’язки за допомогою спрощеної діаграми класів. Ця діаграма слугуватиме візуальним словником понять. Це також буде відправною точкою для вашої моделі даних на рівні проектування.

source: Prepare package dependencies diagram to group your implementation classes in appropriate way. This will help you maintain the code well structured and avoid design flaws such as cyclic dependencies or dependencies on unstable parts
ar: قم بإعداد مخطط تبعيات الحزمة لتجميع فئات التنفيذ الخاصة بك بالطريقة المناسبة. سيساعدك هذا في الحفاظ على الكود منظمًا جيدًا وتجنب عيوب التصميم مثل التبعيات الدورية أو التبعيات على الأجزاء غير المستقرة
bn: আপনার বাস্তবায়ন ক্লাসগুলি যথাযথভাবে গোষ্ঠীবদ্ধ করার জন্য প্যাকেজ নির্ভরতা ডায়াগ্রাম প্রস্তুত করুন। এটি আপনাকে কোডটি ভালভাবে কাঠামোগত বজায় রাখতে এবং ডিজাইনের ত্রুটিগুলি যেমন চক্রাকার নির্ভরতা বা অস্থিতিশীল অংশগুলির উপর নির্ভরতা এড়াতে সহায়তা করবে
ca: Prepareu el diagrama de dependències del paquet per agrupar les classes d'implementació de manera adequada. Això us ajudarà a mantenir el codi ben estructurat i evitar defectes de disseny, com ara dependències cícliques o dependències de parts inestables
cs: Připravte si diagram závislostí balíčků, abyste mohli vhodným způsobem seskupit implementační třídy. To vám pomůže udržet kód dobře strukturovaný a vyhnout se chybám v návrhu, jako jsou cyklické závislosti nebo závislosti na nestabilních částech.
fi: Valmistele paketin riippuvuuskaavio ryhmittääksesi toteutusluokat soveltuvalla tavalla. Tämä auttaa ylläpitämään koodia rakenteellisesti ja auttaa välttämään suunnitteluvirheitä kuten syklisiä riippuvuuksia tai riippuvuuksia epävakaisiin osiin
fr: Préparez le paquet du diagramme des dépendances pour regrouper vos classes d’implémentation de manière appropriée. Cela vous aidera à maintenir le code bien structuré et éviter les défauts de conception tels que les dépendances cycliques ou les dépendances sur des parties volatiles
hi: अपने कार्यान्वयन वर्गों को उचित तरीके से समूहीकृत करने के लिए पैकेज निर्भरता आरेख तैयार करें। इससे आपको कोड को अच्छी तरह से संरचित बनाए रखने और चक्रीय निर्भरता या अस्थिर भागों पर निर्भरता जैसी डिज़ाइन खामियों से बचने में मदद मिलेगी
hr: Pripremi dijagram ovisnosti paketa za grupiranje klasa implementacije na odgovarajući način. To pomaže u održavanju strukturiranog koda i izbjegava nedostatke u dizajnu kao što su cikličke ovisnosti ili ovisnosti o nestabilnim dijelovima
id: Siapkan diagram dependensi paket untuk mengelompokkan kelas implementasi Anda dengan cara yang sesuai. Ini akan membantu Anda menjaga kode terstruktur dengan baik dan menghindari cacat desain seperti ketergantungan siklik atau ketergantungan pada bagian yang tidak stabil
ja: パッケージの依存関係の図を準備して、実装クラスを適切な方法でグループ化します。これにより、コードの構造を適切に維持し、循環依存関係や不安定な部分への依存関係などの設計上の欠陥を回避できます。
ko: 패키지 종속성 다이어그램을 준비하여 구현 클래스를 적절한 방식으로 그룹화합니다. 이렇게 하면 코드를 잘 구조화하고 불안정한 부품에 대한 순환 종속성 또는 종속성과 같은 설계 결함을 방지하는 데 도움이 됩니다.
nl: Bereid een diagram met pakketafhankelijkheden voor om uw implementatieklassen op de juiste manier te groeperen. Dit helpt u de code goed gestructureerd te houden en ontwerpfouten zoals cyclische afhankelijkheden of afhankelijkheden van onstabiele onderdelen te voorkomen.
pt_br: Prepare o diagrama de dependências de pacotes para agrupar suas classes de implementação da maneira apropriada. Isso ajudará você a manter o código bem estruturado e evitar falhas de design, como dependências cíclicas ou dependências de partes instáveis
ru: Подготовьте диаграмму зависимостей пакетов, чтобы соответствующим образом сгруппировать классы реализации. Это поможет поддерживать хорошо структурированный код и избегать недостатков проектирования, таких как циклические зависимости или зависимости от нестабильных частей
sv: Förbered diagram över paket beroenden för att gruppera implementerings klasserna på lämpligt sätt. Detta hjälper dig att upprätthålla koden välstrukturerad och undvika designfel som cykliska beroenden eller beroenden av instabila delar
tr: Uygulama sınıflarınızı uygun şekilde gruplamak için paket bağımlılıkları şeması hazırlayın. Bu, kodu iyi yapılandırılmış tutmanıza ve döngüsel bağımlılıklar veya kararsız parçalara bağımlılıklar gibi tasarım kusurlarından kaçınmanıza yardımcı olur
uk: Підготуйте діаграму залежностей пакетів, щоб належним чином згрупувати ваші класи реалізації. Це допоможе вам підтримувати добре структурований код і уникнути недоліків дизайну, таких як циклічні залежності або залежності від нестабільних частин

source: Model component interactions for use case scenarios in order to find out new methods in existing classes or even new classes with specific responsibilities.
ar: نموذج تفاعلات المكون لاستخدام سيناريوهات الحالة من أجل اكتشاف طرق جديدة في الفصول الموجودة أو حتى الفئات الجديدة ذات المسؤوليات المحددة.
bn: নতুন পদ্ধতিগুলি খুঁজে বের করার জন্য কেস পরিস্থিতিগুলি ব্যবহারের জন্য মডেল কম্পোনেন্ট মিথস্ক্রিয়া বিদ্যমান ক্লাস বা এমনকি নির্দিষ্ট দায়িত্ব সঙ্গে নতুন ক্লাস।
ca: Model d'interaccions de components per a escenaris de casos d'ús per tal d'esbrinar nous mètodes en classes existents o fins i tot noves classes amb responsabilitats específiques.
cs: Modelování interakcí komponent pro scénáře případů použití s cílem nalézt nové metody ve existujících tříd nebo dokonce nových tříd se specifickými povinnostmi.
fi: Mallinna komponenttien vuorovaikutukset käyttötapausskenaarioihin löytääksesi uudet metodit olemassa olevissa luokissa tai jopa uudet luokat tietyin vastuin.
fr: Modéliser les interactions entre les composants pour les cas d'utilisation afin de trouver de nouvelles méthodes dans les classes existantes ou même de nouvelles classes avec des responsabilités spécifiques.
hi: मौजूदा कक्षाओं में नई विधियों या विशिष्ट जिम्मेदारियों के साथ नई कक्षाओं का पता लगाने के लिए उपयोग केस परिदृश्यों के लिए मॉडल घटक इंटरैक्शन।
hr: Modeliraj interakcije komponenti za scenarije slučajeva primjene za otkrivanje novih metoda u postojećim klasama ili čak u novim klasama sa specifičnim odgovornostima.
id: Model interaksi komponen untuk skenario kasus penggunaan untuk menemukan metode baru dalam kelas yang ada atau bahkan kelas baru dengan tanggung jawab tertentu.
ja: で新しいメソッドを見つけるためにユースケースシナリオのコンポーネントの相互作用をモデル化します。 既存のクラス、あるいは特定の責任を持つ新しいクラス。
ko: 새로운 방법을 찾기 위해 사례 시나리오를 사용하기 위한 구성 요소 상호 작용 모델링 특정 책임이 있는 기존 클래스 또는 새로운 클래스.
nl: Modelleer componentinteracties voor use cases om nieuwe methoden te achterhalen in bestaande klassen, of zelfs nieuwe klassen met specifieke verantwoordelijkheden.
pt_br: Modele interações dos componentes para cenários de caso de uso para descobrir novos métodos em classes existentes ou mesmo novas classes com responsabilidades específicas.
sv: Modellkomponentinteraktioner för användningsfallsscenarier för att ta reda på nya metoder i befintliga klasser eller till och med nya klasser med särskilt ansvar.
tr: Var olan sınıflarda veya hatta belirli sorumluluklara sahip yeni sınıflarda yeni metodlar bulmak için kullanım örneği senaryoları için bileşen etkileşimlerini modelleyin.
uk: Змоделюйте взаємодію компонентів для сценаріїв використання, щоб знайти нові методи існуючі класи або навіть нові класи з конкретними обов'язками.

source: Create detailed class diagrams to capture your object-oriented data model.
ar: قم بإنشاء مخططات تفصيلية للفصل لالتقاط نموذج البيانات الموجه للكائنات.
bn: আপনার অবজেক্ট-ওরিয়েন্টেড ডাটা মডেল ক্যাপচার করতে বিস্তারিত ক্লাস ডায়াগ্রাম তৈরি করুন।
ca: Creeu diagrames de classes detallats per capturar el model de dades orientat a objectes.
cs: Vytvářejte podrobné diagramy tříd pro zachycení objektově orientovaného datového modelu.
fi: Luo yksityiskohtaisia luokkakaavioita saadaksesi yhteenvedon oliosuuntautuneisuudesta tietomallista.
fr: Créez des diagrammes de classes détaillés pour capturer votre modèle de données orienté objet.
hi: अपने वस्तु-उन्मुख डेटा मॉडल को कैप्चर करने के लिए विस्तृत क्लास आरेख बनाएं।
hr: Stvori detaljne dijagrame klasa za snimanje objektnog modela podataka.
id: Buat diagram kelas terperinci untuk menangkap model data berorientasi objek Anda.
ja: オブジェクト指向のデータ モデルをキャプチャするための詳細なクラス 図を作成します。
ko: 자세한 클래스 다이어그램을 만들어 개체 지향 데이터 모델을 캡처합니다.
nl: Maak gedetailleerde klassendiagrammen om uw objectgeoriënteerde gegevensmodel vast te leggen.
pt_br: Crie diagramas detalhados de classe para capturar seu modelo de dados orientado a objetos.
ru: Создавайте подробные диаграммы классов, чтобы охватить свою объектно-ориентированную модель данных.
sv: Skapa detaljerade klassdiagram för att fånga den objektorienterade datamodellen.
tr: Nesne yönelimli veri modelinizi yakalamak için ayrıntılı sınıf diyagramları oluşturun.
uk: Створюйте детальні діаграми класів, щоб охопити свою об’єктно-орієнтовану модель даних.
