Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Licensed under the Apache License, Version 2.0 (the "License"); you may not use this application except in compliance with the License. You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.
cs: Licencováno pod Apache License, verze 2.0 (dále jen "Licence"); tuto aplikaci můžete používat pouze v souladu s Licencí. Kopii Licence můžete získat na adrese http://www.apache.org/licenses/LICENSE-2.0 Pokud to nevyžadují platné právní předpisy nebo to není písemně dohodnuto, je software distribuovaný v rámci Licence distribuován na základě stavu "JAK JE", BEZ ZÁRUK A PODMÍNEK JAKÉHOKOLIV, ať už výslovných nebo předpokládaných. Konkrétní znění upravující oprávnění a omezení v rámci Licence naleznete v Licenci.
fi: Apache License -lisenssin versio 2.0 ("Lisenssi"); et saa käyttää tätä sovellusta muutoin kuin lisenssin mukaisesti. Voit saada kopion lisenssistä osoitteessa https://www.apache.org/licenses/LICENSE-2.0 Ellei sovellettava laki edellytä tai kirjallisesti sovita, Lisenssin alaisia ohjelmistoja jaetaan "SELLAISENAAN" ILMAN MINKÄÄNLAISTA TAKUITA TAI EHTOJA, joko nimenomaisia tai oletettuja. Katso lisenssistä lisenssin alaisia käyttöoikeuksia ja rajoituksia koskevat tietyt kielet.
fr: Cette application est soumise à la licence Apache, version 2.0 (la « licence ») ; vous ne pouvez l'utiliser qu'en conformité avec la licence. Vous pouvez obtenir une copie de la licence à l'adresse suivante http://www.apache.org/licenses/LICENSE-2.0 À moins que la loi applicable ne l'exige ou que cela ne fasse l'objet d'un accord écrit, le logiciel distribué en vertu de la licence l'est en l'état, sans garantie ni condition d'aucune sorte, qu'elle soit expresse ou implicite. Voir la licence pour le langage spécifique régissant les permissions et les limitations dans le cadre de la licence.
hi: अपाचे लाइसेंस, संस्करण 2.0 ("लाइसेंस") के अंतर्गत लाइसेंस प्राप्त; आप लाइसेंस के अनुपालन के अलावा इस अनुप्रयोग का उपयोग नहीं कर सकते। आप लाइसेंस की एक प्रति यहाँ से प्राप्त कर सकते हैं http://www.apache.org/licenses/LICENSE-2.0 जब तक लागू कानून द्वारा आवश्यक न हो या लिखित रूप में सहमति न हो, लाइसेंस के तहत वितरित सॉफ़्टवेयर "जैसा है" आधार पर वितरित किया जाता है, बिना किसी प्रकार की वारंटी या शर्तों के, चाहे वह व्यक्त हो या निहित। लाइसेंस के तहत अनुमतियों और सीमाओं को नियंत्रित करने वाली विशिष्ट भाषा के लिए लाइसेंस देखें।
hr: Licenciran pod Apache licencom, verzija 2.0 („licenca”); program se smije koristiti samo u skladu s licencom. Primjerak licence se nalazi na http://www.apache.org/licenses/LICENSE-2.0 Osim ako to zahtijeva mjerodavni zakon ili ako je to pismeno dogovoreno, softver distribuiran pod ovom licencom distribuira se na osnovi stanja „KAKVO JE”, BEZ JAMSTVA ILI UVJETA BILO KOJE VRSTE izričitih ili podrazumijevanih. Pogledaj licencu za određeni jezik koja regulira dopuštenja i ograničenja u okviru licence.
it: Sotto la licenza Apache License, Versione 2.0 (la "Licenza"); potresti non poter usare questa applicazione eccetto che in conformità della Licenza. Potresti ottenere una copia della Licenza su http://www.apache.org/licenses/LICENSE-2.0 A meno che richiesto dalla legge o concordato per iscritto, il software distribuito sotto la Licenza è distribuito in base "COSÌ COMÈ", SENZA GARANZIE O CONDIZIONI DI QUALSIASI TIPO, o espresse o implicate. Vedi la Licenza per il linguaggio specifico che regolano le autorizzazioni e le limitazioni previste dalla Licenza.
nl: Gelicentieerd onder de Apache-licentie, Versie 2.0 (de ‘Licentie’); u mag deze app alleen gebruiken in overeenstemming met de Licentie. U kunt een kopie van de Licentie verkrijgen op http://www.apache.org/licenses/LICENSE-2.0 Tenzij vereist door de toepasselijke wetgeving of schriftelijk overeengekomen, wordt software gedistribueerd onder de Licentie op een ‘AS IS’-BASIS, ZONDER GARANTIES OF VOORWAARDEN VAN ENIGE SOORT, expliciet of impliciet. Zie de Licentie voor de specifieke taal die de rechten en beperkingen onder de Licentie regelen.
pt_br: Licenciado sob a Licença Apache, Versão 2.0 (a "Licença"); você não pode usar este aplicativo, exceto em conformidade com a Licença. Você pode obter uma cópia da Licença em http://www.apache.org/licenses/LICENSE-2.0 A menos que exigido pela lei aplicável ou acordado por escrito, o software distribuído sob a Licença é distribuído "COMO ESTÁ", SEM GARANTIAS OU CONDIÇÕES DE QUALQUER TIPO, expressas ou implícitas. Consulte a Licença para saber o idioma específico que rege as permissões e limitações da Licença.
ru: Лицензирован по лицензии Apache версии 2.0 (далее "Лицензия"); вы не имеете права использовать это приложение, кроме как в соответствии с лицензией. Вы можете получить копию лицензии по адресу http://www.apache.org/licenses/LICENSE-2.0 Если это не требуется применимым законодательством или не согласовано в письменной форме, программное обеспечение, распространяемое по Лицензии, распространяется по ПРИНЦИПУ "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ, явных или подразумеваемых. Смотрите Лицензию для конкретного языка, регулирующего разрешения и ограничения в соответствии с лицензией.
tr: Apache Lisansı, Sürüm 2.0 (işbu “Lisans”) ile lisanslanan bu dosyayı, işbu lisansla uyumlu olan durumlar dışında kullanamazsınız. Lisansın bir kopyasını şu adresten temin edebilirsiniz: http://www.apache.org/licenses/LICENSE-2.0 Yürürlükteki bir yasada belirtilmediği veya yazılı olarak beyan edilmediği sürece, işbu lisans altında dağıtılan yazılım “hiçbir değişiklik yapılmadan” esasıyla dağıtılmış olup, açıkça veya üstü kapalı olarak, HİÇBİR TEMİNAT VEYA KOŞUL İÇERMEZ. Özel dil uygulama izinleri ve işbu lisans altındaki kısıtlamalar için lisansa bakınız.
uk: Ліцензовано згідно з ліцензією Apache, версія 2.0 («Ліцензія»); ви не можете використовувати цю програму, окрім як відповідно до Ліцензії. Ви можете отримати копію Ліцензії за адресою http://www.apache.org/licenses/LICENSE-2.0 Якщо цього не вимагає застосовне законодавство чи письмово не погоджено, програмне забезпечення, що розповсюджується за Ліцензією, розповсюджується на ОСНОВІ «ЯК Є», БЕЗ БУДЬ-ЯКИХ ГАРАНТІЙ АБО УМОВ, явних чи непрямих. Див. Ліцензію, щоб дізнатися про дозволи й обмеження, що регулюють конкретну мову.

source: No errors have been intercepted. We’re good.
cs: Nebyly zachyceny žádné chyby. Jsme v pořádku.
fi: Virheitä ei ole havaittu. Kaikki kunnossa.
fr: Aucune erreur n’a été relevée. Tout va bien.
hi: कोई भी त्रुटि नहीं पकड़ी गई है। हम ठीक हैं।
hr: Nema grešaka. Sve je u redu.
it: Nessun errore è stato intercettato. Tutto apposto.
nl: Er zijn geen fouten onderschept. Alles is ok.
pt_br: Nenhum erro foi interceptado. Tudo certo.
ru: Не было перехвачено никаких ошибок. Всё хорошо.
tr: Hiçbir hata bulunamadı. İyiyiz.
uk: Жодної помилки не виявлено. Ми в порядку.

source: Errors:
cs: Chyby:
fi: Virheet:
fr: Erreurs :
hi: त्रुटियां:
hr: Greške:
it: Errori:
nl: Fouten:
pt_br: Erros:
ru: Ошибки:
tr: Hatalar:
uk: Помилки:

source: Appearance
fi: Ulkoasu
fr: Apparence
hi: दिखावट
hr: Izgled
it: Aspetto
nl: Weergave
pt_br: Aparência
ru: Внешний вид
tr: Görünüm
uk: Зовнішній вигляд

source: Colors
fi: Värit
fr: Couleurs
hi: रंग
hr: Boje
it: Colori
nl: Kleuren
pt_br: Cores
ru: Цвета
tr: Renkler
uk: Кольори

source: Dark
fi: Tumma
fr: Sombre
hi: गहरा
hr: Tamno
it: Scuro
nl: Donker
pt_br: Escuro
ru: Тёмный
tr: Koyu
uk: Темний

source: Light
fi: Vaalea
fr: Clair
hi: हल्का
hr: Svijetlo
it: Chiaro
nl: Licht
pt_br: Claro
ru: Светлый
tr: Açık
uk: Світло

source: Language
cs: Jazyk
fi: Kieli
fr: Langage
hi: भाषा
hr: Jezik
it: Lingua
nl: Taal
pt_br: Idioma
ru: Язык
tr: Dil
uk: Мова

source: Change from System Language to English
fi: Vaihda järjestelmän kielestä englantiin
fr: Passer de la langue du système à l'anglais
hi: सिस्टम भाषा से अंग्रेजी में बदलें
hr: Promijeni s jezika sustava na engleski
it: Cambia dalla lingua di sistema all'inglese
nl: Van systeem­taal naar Engels wijzigen
pt_br: Alterar do Idioma do Sistema para Inglês
ru: Переключить с системного языка на английский
tr: Sistem Dilinden İngilizceye değiştir
uk: Змінити мову системи на англійську

source: Editing
fi: Muokkaus
fr: Édition
hr: Uređivanje
nl: Bewerken
ru: Редактирование
uk: Редагування

source: Reset Tool Automatically
ar: إعادة تعيين الأداة تلقائيًا
bn: স্বয়ংক্রিয়ভাবে টুল রিসেট করুন
ca: Reinicialitza l'eina automàticament
cs: Automaticky resetovat nástroj
fi: Nollaa työkalu automaattisesti
fr: Réinitialiser l’outil automatiquement
hi: उपकरण को स्वचालित रूप से रीसेट करें
hr: Automatski resetiraj alat
id: Atur Ulang Alat Secara Otomatis
it: Reimposta strumento automaticamente
ja: ツールを自動的にリセット
ko: 도구 자동 재설정
nl: Gereedschap automatisch resetten
pt_br: Redefinir ferramenta automaticamente
ru: Перезапускать Инструмент Автоматически
sv: Återställ verktyget automatiskt
tr: Aracı Kendiliğinden Sıfırla
uk: Скинути інструмент автоматично

source: After an element is created, switch back to the pointer tool.
fi: Vaihda takaisin osoitintyökaluun elementin luomisen jälkeen.
fr: Après la création d'un élément, revenez à l'outil pointeur.
hr: Nakon što se element stvori, vrati se na alat pokazivača.
it: Dopo che un elemento è creato, torna indietro allo strumento puntatore.
nl: Na het toevoegen van een element, selecteer het aanwijs hulpmiddel.
ru: После создания элемента вернитесь к инструменту указателя.
uk: Після створення елемента поверніться до інструменту вказівника.

source: Remove Unused Elements
ar: إزالة العناصر غير المستخدمة
bn: অব্যবহৃত উপাদানগুলি অপসারণ করুন
ca: Suprimeix els elements no desitjats
cs: Odstranit nepoužívané prvky
fi: Poista käyttämättömät elementit
fr: Supprimer les éléments inutilisés
hi: अप्रयुक्त तत्वों को हटाएं
hr: Ukloni nekorištene elemente
id: Hapus Elemen yang Tidak Digunakan
it: Rimuovi elementi non utilizzati
ja: 未使用の要素を削除する
ko: 사용하지 않은 요소 제거
nl: Ongebruikte elementen verwijderen
pt_br: Remover elementos não usados
ru: Удалять Неиспользуемые Элементы
sv: Ta bort oanvända element
tr: Kullanılmayan Ögeleri Kaldır
uk: Видалити невикористані елементи

source: Automatically remove elements no longer in use in any diagram.
ar: قم بإزالة العناصر التي لم تعد قيد الاستخدام في أي رسم تخطيطي تلقائيًا.
bn: স্বয়ংক্রিয়ভাবে কোনও ডায়াগ্রামে আর ব্যবহৃত হয় না এমন উপাদানগুলি অপসারণ করুন।
ca: Elimina automàticament els elements que ja no s'utilitzen en cap diagrama.
cs: Automaticky odstranit prvky, které se již nepoužívají v žádném diagramu.
fi: Poista automaattisesti elementit, jotka eivät ole käytössä yhdessäkään kaaviossa.
fr: Supprimez automatiquement les éléments qui ne sont plus utilisés dans aucun diagramme.
hi: किसी भी आरेख में अब उपयोग में न आने वाले तत्वों को स्वचालित रूप से हटाएं।
hr: Automatski ukloni elemente koji se više ne koriste u nijednom dijagramu.
id: Hapus elemen yang tidak lagi digunakan dalam diagram apa pun secara otomatis.
it: Rimuove automaticamente gli elementi non più in uso in qualsiasi diagramma.
ja: 図で使用されなくなった要素を自動的に削除します。
ko: 다이어그램에서 더 이상 사용되지 않는 요소를 자동으로 제거합니다.
nl: Verwijder automatisch elementen die niet langer in gebruik zijn in enig diagram.
pt_br: Remove automaticamente elementos que não estão mais em uso em nenhum diagrama.
ru: Автоматически удалять элементы, которые больше не используются ни в одной диаграмме.
sv: Ta bort element som inte längre används i något diagram.
tr: Herhangi bir diyagramda artık kullanılmayan öğeleri kendiliğinden kaldır.
uk: Автоматично видаляйте елементи, які більше не використовуються на будь-якій схемі.

source: Shortcuts
fi: Pikanäppäimet
fr: Raccourcis clavier
hr: Prečaci
it: Scorciatoie
nl: Snel­toetsen
ru: Сочетания клавиш
uk: Ярлики

source: Quit Gaphor
ar: قم بإنهاء Gaphor
bn: Gaphor থেকে প্রস্থান করুন
ca: Surt del gaphor
cs: Ukončit Gaphor
fi: Lopeta Gaphor
fr: Quitter Gaphor
hi: गैफ़ोर छोड़ें
hr: Zatvori Gaphor
id: Keluar dari Gaphor
it: Esci da Gaphor
ja: ガプホルを終了
ko: 가포 끝내기
nl: Gaphor sluiten
pt_br: Sair do Gaphor
ru: Выйти из Gaphor
sv: Avsluta Gaphor
tr: Gaphorʼdan Çık
uk: Вийти з Гафора

source: Rename
cs: Přejmenovat
fi: Nimeä uudelleen
fr: Renommer
hi: नाम बदलें
hr: Preimenuj
it: Rinomina
nl: Hernoemen
pt_br: Renomear
ru: Переименовать
tr: Yeniden adlandır
uk: Перейменувати

source: Search
cs: Hledat
fi: Etsi
fr: Rechercher
hi: खोजें
hr: Traži
it: Cerca
nl: Zoeken
pt_br: Pesquisar
ru: Поиск
tr: Arama
uk: Пошук

source: Toggle Model Preferences
fi: Näytä/piilota mallin ominaisuudet
fr: Basculer les préférences du modèle
hr: Uklj./Isklj. postavke modela
it: Attiva/Disattiva preferenze modello
ru: Переключить параметры модели
uk: Перемкнути параметри моделі

source: Close Diagram
ar: إغلاق الرسم التخطيطي
bn: ডায়াগ্রাম বন্ধ করুন
ca: Tanca el diagrama
cs: Zavřít Diagram
fi: Sulje kaavio
fr: Fermer le Diagramme
hi: आरेख बंद करें
hr: Zatvori dijagram
id: Tutup Diagram
it: Chiudi diagramma
ja: ダイアグラムを閉じる
ko: 다이어그램 닫기
nl: Diagram sluiten
pt_br: Fechar Diagrama
ru: Закрыть Диаграмму
sv: Stäng diagram
tr: Diyagramı Kapat
uk: Закрити діаграму

source: Toggle Fullscreen
fi: Koko näyttö päälle/pois
fr: Basculer le plein écran
hi: पूर्णस्क्रीन टॉगल करें
hr: Uklj./Isklj. cjeloekranski prikaz
it: Attiva/Disattiva schermo intero
nl: Wissel Volledig Scherm
pt_br: Alternar Tela Cheia
ru: Во весь экран
tr: Tam Ekranı Aç/Kapat
uk: Перемкнути повноекранний режим

source: Undo and Redo
cs: Zpět a Znovu
fi: Kumoa ja tee uudelleen
fr: Annuler et Refaire
hi: पूर्ववत और पुनः करें
hr: Poništi i ponovi
it: Annulla e Rifai
nl: Ongedaan maken en opnieuw
pt_br: Desfazer e Refazer
ru: Отменить и Повторить
tr: Geri Al ve Yinele
uk: Скасувати та повторити

source: Selections
cs: Výběry
fi: Valinnat
fr: Sélections
hi: चयन
hr: Odabiri
it: Selezioni
nl: Selecties
pt_br: Seleções
ru: Выделение
tr: Seçimler
uk: Вибірки

source: Deselect All
ar: الغاء تحديد الكل
bn: সব নির্বাচনমুক্ত করুন
ca: Anul·la la selecció de tots
cs: Zrušit výběr všeho
fi: Älä valitse mitään
fr: Tout Désélectionner
hi: सभी अचयनित करें
hr: Odznači sve
id: Batalkan Pilihan Semua
it: Deseleziona tutti
ja: すべて選択解除
ko: 모두 선택 취소
nl: Alles deselecteren
pt_br: Desselecionar Tudo
ru: Отменить Выделение
sv: Avmarkera alla
tr: Tüm Seçimi Kaldır
uk: Зняти вибір із усіх

source: Copy and Paste
cs: Kopírovat a vložit
fi: Kopioi ja liitä
fr: Copier et Coller
hi: कॉपी और पेस्ट
hr: Kopiraj i umetni
it: Copia e Incolla
nl: Kopiëren en plakken
pt_br: Copiar e Colar
ru: Копирование и Вставка
tr: Kopyala ve Yapıştır
uk: Копіювати та вставляти

source: Paste (link defining elements)
ar: لصق (ارتباط تحديد العناصر)
bn: প্রতিলেপন করুন (লিঙ্ক সংজ্ঞায়িত উপাদান)
ca: Enganxa (elements que defineixen l'enllaç)
cs: Vložit (prvky definující odkaz)
fi: Liitä (linkitä määrittelevät elementit)
fr: Coller (le lien éléments de définition)
hi: पेस्ट करें (तत्वों को परिभाषित करने वाला लिंक)
hr: Umetni (poveži definirajuće elemente)
id: Tempel (elemen penentu tautan)
it: Incolla (collega elementi di definizione)
ja: 貼り付け (要素を定義するリンク)
ko: 붙여넣기(링크 정의 요소)
nl: Plakken (definiërende elementen linken)
pt_br: Colar (vincula elementos de definição)
ru: Вставить (ссылки на определяющие элементы)
sv: Klistra in (länkdefinierande element)
tr: Yapıştır (tanımlayıcı ögeleri bağlantıla)
uk: Вставити (елементи визначення посилання)

source: Zoom
ar: تكبير
bn: দৃশ্যমান
cs: Zvětšení
fi: Mittakaava
hi: ज़ूम
hr: Uvećanje
id: Perbesar
ja: ズーム
ko: 확대/축소
nl: Zoomen
pt_br: Ampliar
ru: Масштабирование
sv: Zooma
tr: Yakınlaştırma
uk: Зум

source: Files
ar: الملفات
bn: ফাইল
ca: ﬁtxers
cs: Soubory
fi: Tiedostot
fr: Fichiers
hi: फाइलें
hr: Datoteke
id: File
it: File
ja: ファイル
ko: 파일
nl: Bestanden
pt_br: Arquivos
ru: Файлы
sv: ﬁler
tr: Dosyalar
uk: Файли

source: Open a Model…
ar: فتح نموذج …
bn: একটি মডেল খুলুন…
ca: Obre un model…
cs: Otevřít model…
fi: Avaa malli…
fr: Ouvrir un modèle …
hi: एक मॉडल खोलें…
hr: Otvori jedan model …
id: Buka Model…
it: Apri un modello…
ja: モデルを開きます。
ko: 모델 열기…
nl: Model openen…
pt_br: Abrir um Modelo…
ru: Открыть Модель…
sv: Öppna en modell…
tr: Model Aç…
uk: Відкрийте модель…

source: Update diagram “{name}”
cs: Aktualizovat diagram "{name}"
fi: Päivitä kaavio “{name}”
fr: Mettre à jour le diagramme "{name}"
hi: आरेख “{name}” अपडेट करें
hr: Aktualiziraj dijagram „{name}”
it: Aggiorna il diagramma “{name}”
nl: Diagram ‘{name}’ bijwerken
pt_br: Atualizar diagrama “{name}”
ru: Обновить диаграмму «{name}»
tr: “{name}” diyagramını güncelle
uk: Діаграма оновлення “{name}”

source: Update element “{name}”
cs: Aktualizovat prvek "{name}"
fi: Päivitä elementti “{name}”
fr: Mettre à jour l'élément "{name}"
hi: तत्व “{name}” अपडेट करें
hr: Aktualiziraj element „{name}”
it: Aggiorna l'elemento “{name}”
nl: Element ‘{name}’ bijwerken
pt_br: Atualizar elemento “{name}”
ru: Обновить элемент «{name}»
tr: “{name}” ögesini güncelle
uk: Елемент оновлення “{name}”

source: Update element of type “{type}”
cs: Aktualizovat prvku typu "{type}"
fi: Päivitä elementti tyyppiä “{type}”
fr: Mettre à jour l'élément de type "{type}"
hi: “{type}” प्रकार का तत्व अपडेट करें
hr: Aktualiziraj element vrste „{type}”
it: Aggiorna l'elemento di tipo “{type}”
nl: Element van type ‘{type}’ bijwerken
pt_br: Atualizar elemento do tipo “{type}”
ru: Обновить элемент типа «{type}»
tr: “{type}” türündeki ögeyi güncelle
uk: Оновити елемент типу “{type}”

source: Update presentation “{type}”
cs: Aktualizovat prezentaci "{type}"
fi: Päivitä esitys “{type}”
fr: Mettre à jour la présentation "{type}"
hi: प्रस्तुतिकरण “{type}” अपडेट करें
hr: Aktualiziraj prezentaciju „{type}”
it: Aggiorna presentazione “{type}”
nl: Presentatie ‘{type}’ bijwerken
pt_br: Atualizar apresentação “{type}”
ru: Обновить представление «{type}»
tr: “{type}” sunumunu güncelle
uk: Оновити презентацію “{type}”

source: Add presentation of type {type}
cs: Přidat typ prezentace {type}
fi: Lisää esitys tyyppiä {type}
fr: Ajouter la présentation de type {type}
hi: {type} प्रकार की प्रस्तुति जोड़ें
hr: Dodaj prezentaciju vrste {type}
it: Aggiungi presentazione di tipo {type}
nl: Presentatie van type {type} toevoegen
pt_br: Adicionar apresentação do tipo {type}
ru: Добавить представление типа {type}
tr: {type} türünde sunum ekle
uk: Додати презентацію типу {type}

source: Remove presentation of type {type}
cs: Odstranit prezentaci typu {type}
fi: Poista esitys tyyppiä {type}
fr: Supprimer la présentation de type {type}
hi: {type} प्रकार की प्रस्तुति हटाएं
hr: Ukloni prezentaciju vrste {type}
it: Rimuovi presentazione di tipo {type}
nl: Presentatie van type {type} verwijderen
pt_br: Remover apresentação do tipo {type}
ru: Удалить представление типа {type}
tr: {type} türünün sunumunu kaldır
uk: Видалення презентації типу {type}

source: Update presentation “{name}”
cs: Aktualizovat prezentaci “{name}”
fi: Päivitä esitys “{name}”
fr: Mettre à jour la présentation de type "{name}"
hi: प्रस्तुतिकरण “{name}” अपडेट करें
hr: Aktualiziraj prezentaciju „{name}”
it: Aggiorna presentazione “{name}”
nl: Presentatie ‘{name}’ bijwerken
pt_br: Atualizar apresentação “{name}”
ru: Обновить представление «{name}»
tr: “{name}” sunumunu güncelle
uk: Оновити презентацію “{name}”

source: Update presentation of type {type}
cs: Aktualizovat prezentaci typu {type}
fi: Päivitä esitys tyyppiä {type}
fr: Mettre à jour la présentation de type {type}
hi: {type} प्रकार की प्रस्तुति अपडेट करें
hr: Aktualiziraj prezentaciju vrste {type}
it: Aggiorna presentazione di tipo {type}
nl: Presentatie van type {type} bijwerken
pt_br: Atualizar apresentação do tipo {type}
ru: Обновить представление типа {type}
tr: {type} türünün sunumunu güncelle
uk: Оновити презентацію типу {type}

source: Add {type} “{name}”
cs: Přidat {type} “{name}”
fi: Lisää {type} “{name}”
fr: Ajouter {type} "{name}"
hi: {type} “{name}” जोड़ें
hr: Dodaj {type} „{name}”
it: Aggiungi {type} “{name}”
nl: {type} ‘{name}’ toevoegen
pt_br: Adicionar {type} “{name}”
ru: Добавить {type} «{name}»
tr: {type} “{name}” ekle
uk: Додати {type} “{name}”

source: Add element of type {type}
cs: Přidat element typu {type}
fi: Lisää elementti tyyppiä {type}
fr: Ajouter l'élément de type {type}
hi: {type} प्रकार का तत्व जोड़ें
hr: Dodaj element vrste {type}
it: Aggiungi elemento di tipo {type}
nl: Element van type {type} toevoegen
pt_br: Adicionar elemento do tipo {type}
ru: Добавить элемент типа {type}
tr: {type} türünde öge ekle
uk: Додайте елемент типу {type}

source: Remove element “{name}”
cs: Odstranit element “{name}”
fi: Poista elementti “{name}”
fr: Supprimer l'élément "{name}"
hi: तत्व “{name}” निकालें
hr: Ukloni element „{name}”
it: Rimuovi elemento “{name}”
nl: Element ‘{name}’ verwijderen
pt_br: Remover elemento “{name}”
ru: Удалить элемент «{name}»
tr: “{name}” ögesini kaldır
uk: Видалити елемент “{name}”

source: Remove element of type {type}
cs: Odstranit element typu {type}
fi: Poista elementti tyyppiä {type}
fr: Supprimer l'élément de type {type}
hi: {type} प्रकार का तत्व हटाएं
hr: Ukloni element vrste {type}
it: Rimuovi elemento di tipo {type}
nl: Element van type {type} verwijderen
pt_br: Remover elemento do tipo {type}
ru: Удалить элемент типа {type}
tr: {type} türündeki öğeyi kaldır
uk: Видалити елемент типу {type}

source: Update element of type {type}
cs: Aktualizovat element typu {type}
fi: Päivitä elementti tyyppiä {type}
fr: Mettre à jour l'élément de type {type}
hi: {type} प्रकार का तत्व अपडेट करें
hr: Aktualiziraj element vrste {type}
it: Aggiorna elemento di tipo {type}
nl: Element van type {type} bijwerken
pt_br: Atualizar elemento do tipo {type}
ru: Обновить элемент типа {type}
tr: {type} türündeki ögeyi güncelle
uk: Оновити елемент типу {type}

source: Add relation “{name}” to “{ref_name}”
cs: Přidat relaci “{name}” do “{ref_name}”
fi: Lisää relaatio “{name}” kohteeseen “{ref_name}”
fr: Ajouter la relation "{name}" à "{ref_name}"
hi: संबंध “{name}” को “{ref_name}” में जोड़ें
hr: Dodaj „{ref_name}” vezu „{name}”
it: Aggiungi relazione “{name}” a “{ref_name}”
nl: Relatie ‘{name}’ aan ‘{ref_name}’ toevoegen
pt_br: Adicionar relação “{name}” a “{ref_name}”
ru: Добавить отношение «{name}» к «{ref_name}»
tr: “{name}” ögesine “{ref_name}” ilişkisi ekle
uk: Додайте відношення “{name}” до “{ref_name}”

source: Remove relation “{name}” to “{ref_name}”
cs: Odstranit relaci “{name}” na “{ref_name}”
fi: Poista relaatio “{name}” kohteeseen “{ref_name}”
fr: Supprimer la relation "{name}" à "{ref_name}"
hi: “{name}” से “{ref_name}” का संबंध हटाएं
hr: Ukloni vezu „{name}” s „{ref_name}”
it: Rimuovi relazione “{name}” a “{ref_name}”
nl: Relatie ‘{name}’ van ‘{ref_name}’ verwijderen
pt_br: Remover relação “{name}” a “{ref_name}”
ru: Удалить отношение «{name}» к «{ref_name}»
tr: “{name}” ile “{ref_name}” arasındaki ilişkiyi kaldır
uk: Видалити зв’язок “{name}” з “{ref_name}”

source: Update relation “{name}” to “{ref_name}”
cs: Aktualizovat relaci “{name}” na “{ref_name}”
fi: Päivitä relaatio “{name}” kohteeseen “{ref_name}”
fr: Mettre à jour la relation "{name}" à "{ref_name}"
hi: संबंध “{name}” को “{ref_name}” में अपडेट करें
hr: Aktualiziraj vezu „{name}” s „{ref_name}”
it: Aggiorna relazione “{name}” a “{ref_name}”
nl: Relatie ‘{name}’ naar ‘{ref_name}’ bijwerken
pt_br: Atualizar relação “{name}” a “{ref_name}”
ru: Обновить отношение «{name}» к «{ref_name}»
tr: “{name}” ilişkisini “{ref_name}” olarak güncelle
uk: Оновити відношення “{name}” до “{ref_name}”

source: Add relation “{name}”
cs: Přidat relaci “{name}”
fi: Lisää relaatio “{name}”
fr: Ajouter la relation "{name}"
hi: संबंध “{name}” जोड़ें
hr: Dodaj vezu „{name}”
it: Aggiungi relazione “{name}”
nl: Relatie ‘{name}’ toevoegen
pt_br: Adicionar relação “{name}”
ru: Добавить отношение «{name}»
tr: “{name}” ilişkisi ekle
uk: Додайте відношення “{name}”
