Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Open Incoming
cs: Otevřít příchozí
fi: Avaa muutos
fr: Ouvrir l'Entrant
hi: आवक खोलें
hr: Otvori dolazno
it: Apri in arrivo
nl: Inkomende openen
pt_br: Abrir Entrante
ru: Открыть Входящую
tr: Geleni Aç
uk: Відкрийте Вхідні

source: Save Changes?
cs: Uložit změny?
fi: Tallennetaanko muutokset?
fr: Enregistrer les modifications ?
hi: परिवर्तन सहेजें?
hr: Spremiti promjene?
it: Salvare le modifiche?
nl: Wijzigingen opslaan?
pt_br: Salvar Alterações?
ru: Сохранить изменения?
tr: Değişiklikler Kaydedilsin Mi?
uk: Зберегти зміни?

source: The open model contains unsaved changes. Changes which are not saved will be permanently lost.
cs: Otevřený model obsahuje neuložené změny. Neuložené změny budou trvale ztraceny.
fi: Avoinna oleva malli sisältää tallentamattomia muutoksia. Tallentamattomat muutokset katoavat pysyvästi.
fr: Le modèle ouvert contient des modifications non enregistrées. Les modifications qui ne sont pas enregistrées sont définitivement perdues.
hi: खुले मॉडल में बिना सहेजे गए परिवर्तन शामिल हैं। जो परिवर्तन सहेजे नहीं गए हैं, वे स्थायी रूप से खो जाएंगे।
hr: Otvoreni model sadrži nespremljene promjene. Promjene koje nisu spremljene će se zauvijek izgubiti.
it: Il modello aperto contiene modifiche non salvate. Modifiche che non sono salvate verranno perse permanentemente.
nl: Het geopende model bevat niet-opgeslagen wijzigingen. Wijzigingen die niet worden opgeslagen gaan definitief verloren.
pt_br: O modelo aberto contém alterações não salvas. As alterações que não forem salvas serão perdidas permanentemente.
ru: Открытая модель содержит несохраненные изменения. Изменения, которые не будут сохранены, будут безвозвратно потеряны.
tr: Açık model kaydedilmemiş değişiklikler içeriyor. Kaydedilmeyen değişiklikler kalıcı olarak yitirilecek.
uk: Відкрита модель містить незбережені зміни. Незбережені зміни буде остаточно втрачено.

source: Discard
cs: Zahodit
fi: Hylkää
fr: Rejeter
hi: त्यागें
hr: Odbaci
it: Scarta
nl: Verwerpen
pt_br: Descartar
ru: Отклонить
tr: Gözden Çıkar
uk: Відкинути

source: Save
ar: يحفظ
bn: সংরক্ষণ
ca: Salvar
cs: Uložit
fi: Tallenna
fr: Enregistrer
hi: सहेजें
hr: Spremi
id: Menyimpan
it: Salva
ja: セーブ
ko: 저장
nl: Opslaan
pt_br: Salvar
ru: Сохранить
sv: Spara
tr: Kaydet
uk: Зберегти

source: Generic
ar: نوعي
bn: সাধারণ
ca: Genèric
cs: Obecné
fi: Yleinen
fr: Générique
hi: जेनेरिक
hr: Opći
id: Umum
it: Generico
ja: ジェネリック
ko: 일반적인
nl: Algemeen
pt_br: Genérico
ru: Общая
sv: Allmän
tr: Genel
uk: Загальні

source: An empty model
cs: Prázdný model
fi: Tyhjä malli
fr: Un modèle vide
hi: एक खाली मॉडल
hr: Prazan model
it: Un modello vuoto
nl: Leeg model
pt_br: Um modelo vazio
ru: Пустая модель
tr: Boş bir model
uk: Порожня модель

source: Unified Modeling Language template
cs: Šablona jednotného modelovacího jazyka
fi: Unified Modeling Language -mallipohja
fr: Modèle de langage de modélisation unifié
hi: एकीकृत मॉडलिंग भाषा टेम्पलेट
hr: Predložak za Unified Modeling Language
it: Template di Unified Modeling Language
nl: Sjabloon voor Unified Modeling Language
pt_br: Predefinição de Linguagem de Modelagem Unificada
ru: Шаблон Унифицированного Языка Моделирования
tr: Birleşik Modelleme Dili şablonu
uk: Шаблон уніфікованої мови моделювання

source: Systems Modeling Language template
cs: Šablona pro modelování jazyka systemů
fi: Systems Modeling Language -mallipohja
fr: Modèle de langage de modélisation des systèmes
hi: सिस्टम मॉडलिंग भाषा टेम्पलेट
hr: Predložak za Systems Modeling Language
it: Template di Systems Modeling Language
nl: Sjabloon voor Systems Modeling Language
pt_br: Predefinição de Linguagem de Modelagem de Sistemas
ru: Шаблон Языка Моделирования Систем
tr: Sistem Modelleme Dili şablonu
uk: Шаблон мови моделювання систем

source: Risk Analysis and Assessment Modeling Language template
cs: Šablona jazyka pro modelování analýzy a hodnocení rizik
fi: Risk Analysis and Assessment Modeling Language -mallipohja
fr: Modèle de langage d'analyse et d'évaluation des risques
hi: जोखिम विश्लेषण और मूल्यांकन मॉडलिंग भाषा टेम्पलेट
hr: Predložak za Risk Analysis i Assessment Modeling Language
it: Template di Risk Analysis and Assessment Modeling Language
nl: Sjabloon voor Risk Analysis and Assessment Modeling Language
pt_br: Predefinição de Linguagem de Modelagem de Análise e Avaliação de Risco
ru: Шаблон Языка Моделирования Анализа и Оценки Рисков
tr: Risk Analizi ve Değerlendirme Modelleme Dili şablonu
uk: Шаблон мови моделювання аналізу та оцінки ризиків

source: Layered C4 Model template
cs: Vrstvená šablona modelu C4
fi: Layered C4 Model -mallipohja
fr: Modèle à plusieurs niveaux C4
hi: स्तरित C4 मॉडल टेम्पलेट
hr: Predložak za slojevit C4 model
it: Template di modello C4 a strati
nl: Sjabloon voor Layered C4 Model
pt_br: Predefinição da Modelo C4 com Camadas
ru: Многоуровневый шаблон Модели C4
tr: Katmanlı C4 Modeli şablonu
uk: Багатошаровий шаблон моделі C4

source: UML Example
fi: UML-esimerkki
fr: Exemple UML
hi: UML उदाहरण
hr: UML primjer
it: Esempio UML
nl: UML-voorbeeld
pt_br: Exemplo UML
ru: Пример UML
tr: UML Örneği
uk: Приклад UML

source: Unified Modeling Language example model
fi: Unified Modeling Language -mallipohja
fr: Exemple de modèle en langage de modélisation unifié
hi: एकीकृत मॉडलिंग भाषा उदाहरण मॉडल
hr: Primjer modela za Unified Modeling Language
it: Modello Unified Modeling Language di esempio
nl: Voorbeeld­model voor Unified Modeling Language
pt_br: Modelo de exemplo de Linguagem de Modelagem Unificada
ru: Пример модели Унифицированного Языка Моделирования
tr: Birleşik Modelleme Dili örnek modeli
uk: Приклад моделі Unified Modeling Language

source: SysML Example
fi: SysML-esimerkki
fr: Exemple SysML
hi: SysML उदाहरण
hr: SysML primjer
it: Esempio SysML
nl: SysML-voorbeeld
pt_br: Exemplo de SysML
ru: Пример SysML
tr: SysML Örneği
uk: Приклад SysML

source: Systems Modeling Language example model
fi: Systems Modeling Language -mallipohja
fr: Exemple de modèle dans le langage de modélisation des systèmes
hi: सिस्टम मॉडलिंग भाषा उदाहरण मॉडल
hr: Primjer modela za Systems Modeling Language
it: Modello Systems Modeling Language di esempio
nl: Voorbeeld­model voor Systems Modeling Language
pt_br: Modelo de exemplo de Linguagem de Modelagem de Sistemas
ru: Пример модели Языка Моделирования Систем
tr: Sistem Modelleme Dili örnek modeli
uk: Приклад моделі мови моделювання систем

source: RAAML Example
fi: RAAML-esimerkki
fr: Exemple RAAML
hi: RAAML उदाहरण
hr: RAAML primjer
it: Esempio RAAML
nl: RAAML-voorbeeld
pt_br: Exemplo de RAAML
ru: Пример RAAML
tr: RAAML Örneği
uk: Приклад RAAML

source: Risk Analysis and Assessment Modeling Language example model
fi: Risk Analysis and Assessment Modeling Language -mallipohja
fr: Exemple de Modèle pour Langage de Modélisation de l'Analyse et de l'Évaluation des Risques
hi: जोखिम विश्लेषण और मूल्यांकन मॉडलिंग भाषा उदाहरण मॉडल
hr: Primjer modela za Risk Analysis i Assessment Modeling Language
it: Modello Risk Analysis and Assessment Modeling Language di esempio
nl: Voorbeeld­model voor Risk Analysis and Assessment Modeling Language
pt_br: Modelo de exemplo de Linguagem de Modelagem de Análise e Avaliação de Risco
ru: Пример модели языка Моделирования Анализа и Оценки Рисков
tr: Risk Analizi ve Değerlendirme Modelleme Dili örnek modeli
uk: Приклад моделі мови аналізу та оцінки моделювання

source: C4 Model Example
fi: C4-esimerkki
fr: Exemple de Modèle C4
hr: Primjer modela C4
it: Modello C4 di esempio
ru: Пример Модели С4
uk: Приклад моделі C4

source: C4 Model example of a banking system
fi: C4-mallin esimerkki pankkijärjestelmästä
fr: Exemple de modèle C4 du système bancaire
hr: Primjer modela C4 sustava bankarstva
it: Modello C4 di esempio di un sistema bancario
ru: Пример Модели С4 банковской системы
uk: C4 Приклад моделі банківської системи

source: Open Model…
cs: Otevřít Model…
fi: Avaa malli…
fr: Ouvrir le modèle …
hi: मॉडल खोलें…
hr: Otvori model …
it: Apri un modello…
nl: Model openen…
pt_br: Abrir Modelo…
ru: Открыть Модель…
tr: Model Aç…
uk: Відкрити модель…

source: Preferences
ar: التفضيلات
bn: অগ্রাধিকার
ca: Preferències
cs: Předvolby
fi: Asetukset
fr: Préférences
hi: प्राथमिकताएं
hr: Postavke
id: Preferensi
it: Preferenze
ja: 設定
ko: 선호
nl: Voorkeuren
pt_br: Preferências
ru: Параметры
sv: Inställningar
tr: Tercihler
uk: Уподобання

source: Keyboard Shortcuts
ar: اختصارات لوحة المفاتيح
bn: কীবোর্ড শর্টকাট
ca: Dreceres de teclat
cs: Klávesové zkratky
fi: Pikanäppäimet
fr: Raccourcis clavier
hi: कीबोर्ड शॉर्टकट
hr: Tipkovni prečaci
id: Pintasan Keyboard
it: Scorciatoie da tastiera
ja: キーボード ショートカット
ko: 키보드 바로 가기 키
nl: Sneltoetsen
pt_br: Atalhos do teclado
ru: Сочетания клавиш
sv: Kortkommandon
tr: Klavye Kısayolları
uk: Комбінації клавіш

source: About Gaphor
ar: عن غافور
bn: Gaphor সম্পর্কে
ca: Quant a Gaphor
cs: O programu Gaphor
fi: Tietoja - Gaphor
fr: À propos de Gaphor
hi: गैफोर के बारे में
hr: O programu Gaphor
id: Tentang Gaphor
it: Informazioni su Gaphor
ja: ガプホルについて
ko: 가포 정보
nl: Over Gaphor
pt_br: Sobre Gaphor
ru: О Gaphor
sv: Om Gaphor
tr: Gaphor Hakkında
uk: Про Gaphor

source: Recently Opened
fi: Viimeksi avattu
fr: Ouvert récemment
hr: Nedavno otvoreno
it: Aperto di recente
nl: Onlangs geopend
ru: Недавно открыто
uk: Нещодавно відкрито

source: Create New Model
cs: Vytvořit nový model
fi: Luo uusi malli
fr: Créer un Nouveau Modèle
hi: नया मॉडल बनाएं
hr: Stori novi model
it: Crea nuovo modello
nl: Nieuw model aanmaken
pt_br: Criar Novo Modelo
ru: Создать Новую Модель
tr: Yeni Model Oluştur
uk: Створити нову модель

source: Press F11 to exit Fullscreen
fi: Paina F11 poistuaksesi koko näytön tilasta
fr: Appuyer sur F11 pour quitter le plein écran
hi: पूर्णस्क्रीन से बाहर निकलने के लिए F11 दबाएं
hr: Pritisni F11 za napuštanje cjeloekranskog prikaza
it: Premi F11 per uscire dallo schermo intero
nl: Druk F11 om volledig schem te verlaten
pt_br: Pressione F11 para sair da tela cheia
ru: Нажмите F11 для выхода из полноэкранного режима
tr: Tam Ekrandan Çıkmak İçin F11 Tuşuna Basın
uk: Натисніть F11, щоб вийти з повноекранного режиму

source: Change modeling profile
fi: Vaihda mallinnusprofiilia
fr: Modifier le profil de modélisation
hr: Promijeni profil modeliranja
it: Cambia profilo di modello
ru: Изменить профиль моделирования
uk: Змінити профіль моделювання

source: Open application menu
cs: Otevřít nabídku aplikace
fi: Avaa sovellusvalikko
fr: Ouvrir le menu de l'application
hi: अनुप्रयोग मेनू खोलें
hr: Otvori izbornik programa
it: Apri menu applicazione
nl: App-menu openen
pt_br: Abre o menu do aplicativo
ru: Открыть меню приложения
tr: Uygulama menüsünü aç
uk: Відкрити меню програми

source: New diagram menu
cs: Nová nabídka diagramů
fi: Uusi kaavio -valikko
fr: Menu Nouveau diagramme
hi: नया आरेख मेनू
hr: Izbornik za novi dijagram
it: Menù nuovo diagramma
nl: Nieuw-diagram-menu
pt_br: Menu de novo diagrama
ru: Новое меню диаграммы
tr: Yeni diyagram menüsü
uk: Меню нової діаграми

source: Undo
ar: الغاء التحميل
bn: পূর্বাবস্থা
ca: Desfer
cs: Zpět
fi: Kumoa
fr: Annuler
hi: पूर्ववत करें
hr: Poništi
id: Membuka
it: Annulla
ja: 外す
ko: 실행 취소
nl: Herstel
pt_br: Desfazer
ru: Отменить
sv: Ångra
tr: Geri Al
uk: Відмінити

source: Redo
ar: إعادة
bn: পুনঃকরণ
ca: Refer
cs: Znovu
fi: Tee uudelleen
fr: Refaire
hi: पुनः करें
hr: Ponovi
id: Mengulangi
it: Rifai
ja: やり直す
ko: 다시 실행
nl: Opnieuw
pt_br: Refazer
ru: Повторить
sv: Göra om
tr: Yinele
uk: Повторити

source: Align selected elements
fi: Tasaa valitut elementit
fr: Aligner les éléments sélectionnés
hr: Poravnaj odabrane elemente
it: Allinea gli elementi selezionati
ru: Выровнять выбранные элементы
uk: Вирівняти виділені елементи

source: Toggle Property Editor
cs: Přepnout editor vlastností
fi: Ominaisuusmuokkain päälle/pois
fr: Basculer l'éditeur de propriétés
hi: प्रॉपर्टी संपादक टॉगल करें
hr: Uklj./Isklj. uređivač svojstva
it: Attiva/Disattiva l'editor delle proprietà
nl: Eigenschapsbewerker omschakelen
pt_br: Alterna o Editor de Propriedades
ru: Переключить редактор свойств
tr: Özellik düzenleyiciyi aç/kapat
uk: Перемкнути редактор властивостей

source: New Model…
ar: نموذج جديد …
bn: নতুন মডেল…
ca: Nou model…
cs: Nový model…
fi: Uusi malli…
fr: Nouveau modèle …
hi: नया मॉडल…
hr: Novi model …
id: Model baru…
it: Nuovo modello…
ja: 新型。。。
ko: 새로운 모델…
nl: Nieuw model…
pt_br: Novo Modelo…
ru: Новая Модель…
sv: Ny modell…
tr: Yeni Model…
uk: Нова модель…

source: Save As…
ar: حفظ باسم …
bn: এইরূপে সংরক্ষণ করুন…
ca: Anomena i desa…
cs: Uložit jako…
fi: Tallenna nimellä…
fr: Enregistrer sous…
hi: ऐसे सहेजें…
hr: Spremi kao …
id: Simpan Sebagai…
it: Salva come…
ja: 名前を付けて保存します。
ko: 다른 이름으로 저장…
nl: Opslaan als…
pt_br: Salvar Como…
ru: Сохранить Как…
sv: Spara som…
tr: Farklı Kaydet…
uk: Зберегти як…

source: Preferences…
fi: Asetukset…
fr: Préférences…
hr: Postavke …
it: Preferenze…
ru: Параметры…
uk: Уподобання…

source: Align Left
fi: Tasaa vasemmalle
fr: Aligner à gauche
hi: बाएं संरेखित करें
hr: Poravnaj lijevo
it: Allinea alla sinistra
nl: Links uitlijnen
pt_br: Alinhar à esquerda
ru: Выровнять по левому краю
tr: Sola hizala
uk: Вирівняти по лівому краю

source: Align Right
fi: Tasaa oikealle
fr: Aligner à droite
hi: दाएं संरेखित करें
hr: Poravnaj desno
it: Allinea alla destra
nl: Rechts uitlijnen
pt_br: Alinhar à direita
ru: Выровнять по правому краю
tr: Sağa hizala
uk: Вирівняти праворуч

source: Align Vertical Center
fi: Tasaa vaakasuunnassa keskelle
fr: Aligner le centre vertical
hr: Poravnaj okomito centrirano
it: Allinea al centro verticale
ru: Выровнять вертикально по центру
uk: Вирівняти вертикально по центру

source: Align Top
fi: Tasaa ylös
fr: Aligner le haut
hi: ऊपर संरेखित करें
hr: Poravnaj gore
it: Allinea in alto
nl: Boven uitlijnen
pt_br: Alinhar ao topo
ru: Выровнять по верхнему краю
tr: Üste hizala
uk: Вирівняти зверху

source: Align Bottom
fi: Tasaa alas
fr: Aligner le bas
hi: नीचे संरेखित करें
hr: Poravnaj dolje
it: Allinea in fondo
nl: Onder uitlijnen
pt_br: Alinhar à parte inferior
ru: Выровнять по нижнему краю
tr: Alta hizala
uk: Вирівняти нижню частину

source: Align Horizontal Center
fi: Tasaa vaakasuunnassa keskelle
fr: Aligner le centre horizontal
hi: क्षैतिज केंद्र संरेखित करें
hr: Poravnaj vodoravno centrirano
nl: Horizontaal centreren
pt_br: Alinhar centro na horizontal
ru: Выровнять горизонтально по центру
tr: Yatay merkeze hizala
uk: Вирівняти по центру по горизонталі

source: Max Width
fi: Enimmäisleveys
fr: Largeur maximale
hi: अधि चौड़ाई
hr: Maks. širina
it: Larghezza massima
nl: Maximale breedte
pt_br: Largura máxima
ru: Максимальная ширина
tr: Azami genişlik
uk: Максимальна ширина

source: Max Height
fi: Enimmäiskorkeus
fr: Hauteur maximale
hi: अधि ऊंचाई
hr: Maks. visina
it: Altezza massima
nl: Maximale hoogte
pt_br: Altura máxima
ru: Максимальная высота
tr: Azami yükseklik
uk: Максимальна висота

source: Max Size
fi: Enimmäiskoko
fr: Taille maximale
hi: अधि आकार
hr: Maks. veličina
it: Dimensione massima
nl: Maximale grootte
pt_br: Tamanho máximo
ru: Максимальный размер
tr: Azami boyut
uk: Максимальний розмір

source: _File
fi: _Tiedosto
fr: _Fichier
hr: _Datoteka
nl: _Archief
ru: _Файл
uk: _Файл

source: _Edit
fi: _Muokkaa
fr: _Edition
hr: _Uredi
it: _Modifica
nl: _Wijzig
ru: _Правка
uk: _Редагувати

source: Cut
cs: Střih
fi: Leikkaa
fr: Couper
hi: काटें
hr: Izreži
it: _Taglia
nl: Knippen
pt_br: Cortar
ru: Вырезать
tr: Kes
uk: Вирізати

source: Copy
ar: ينسخ
bn: অনুলিপি
ca: Copiar
cs: Kopírovat
fi: Kopioi
fr: Copier
hi: कॉपी करें
hr: Kopiraj
id: Salinan
it: _Copia
ja: 写し
ko: 복사
nl: Kopiëren
pt_br: Copiar
ru: Копировать
sv: Kopia
tr: Kopyala
uk: Копіювати

source: Paste
fi: Liitä
fr: Coller
hr: Umetni
it: _Incolla
nl: Plakken
ru: Вставить
uk: Вставити

source: Paste (copy defining elements)
ar: لصق (نسخ تحديد العناصر)
bn: প্রতিলেপন করুন (সংজ্ঞায়িত উপাদানগুলি অনুলিপি করুন)
ca: Enganxa (copia els elements definitoris)
cs: Vložit (kopírování definujících prvků)
fi: Liitä (kopioi määrittelevät elementit)
fr: Coller (copie éléments de définition)
hi: पेस्ट करें (तत्वों को परिभाषित करने वाली प्रतिलिपि बनाएं)
hr: Umetni (kopiraj definirajuće elemente)
id: Tempel (salin elemen penentu)
it: Incolla (copia elementi di definizione)
ja: 貼り付け (要素をコピーする)
ko: 붙여넣기(요소를 정의하는 복사)
nl: Plakken (definiërende elementen kopiëren)
pt_br: Colar (copia elementos de definição)
ru: Вставить (копировать определяющие элементы)
sv: Klistra in (kopiera definiera element)
tr: Yapıştır (tanımlayıcı ögeleri kopyala)
uk: Вставити (копіювати визначальні елементи)

source: Select All
ar: اختر الكل
bn: সব নির্বাচন করুন
ca: Selecciona-ho tot
cs: Vybrat vše
fi: Valitse kaikki
fr: Tout Sélectionner
hi: सभी चुनें
hr: Označi sve
id: Pilih Semua
it: Seleziona tutti
ja: すべて選択
ko: 모두 선택
nl: Alles selecteren
pt_br: Selecionar Tudo
ru: Выделить Всё
sv: Välj Alla
tr: Tümünü Seç
uk: Виберіть усі

source: Unselect All
fi: Älä valitse mitään
fr: Tout désélectionner
hr: Odznači sve
it: Deseleziona tutti
nl: Alles deselecteren
ru: Снять выделение со всего
uk: Скасувати вибір усіх

source: _View
fi: _Näytä
fr: _Vue
hr: _Prikaz
it: _Visualizza
nl: _Weergave
ru: _Вид
uk: _Перегляд

source: Actual Size
ar: الحجم الأصلي
bn: প্রকৃত আকার
ca: Mida real
fi: Todellinen koko
fr: Taille actuelle
hr: Stvarna veličina
id: Ukuran sebenarnya
it: Dimensione reale
ja: 実物大
ko: 실제 크기
nl: Ware grootte
ru: Фактический размер
sv: Faktisk storlek
uk: Фактичний розмір

source: _Window
fi: _Ikkuna
fr: _Fenêtre
hr: P_rozor
it: _Finestra
nl: _Venster
ru: _Окно
uk: _Вікно

source: Maximize
fi: Suurenna
fr: Maximiser
hr: Maks. rastvori prozor
it: Massimizza
nl: Maximaliseer
ru: Развернуть
uk: Максимізувати

source: Full screen
fi: Koko näyttö
fr: Plein écran
hr: Cjeloekranski prikaz
it: Schermo intero
nl: Volledig scherm
ru: Во весь экран
uk: Повний екран

source: _Help
fi: _Ohje
fr: _Aide
hr: Po_moć
it: _Aiuto
ru: _Справка
uk: _Допомога

source: Online Documentation
fi: Verkko-ohje
fr: Documentation en ligne
hr: Online dokumentacija
it: Documentazione online
nl: Online documentatie
ru: Он-лайн документация
uk: Онлайн-документація

source: _Open
ar: _فتح
cs: _Otevřít
fi: _Avaa
fr: _Ouvrir
hi: खोलें (_O)
hr: _Otvori
id: _Membuka
it: _Apri
ko: 열기(_O)
nl: _Openen
pt_br: _Abrir
ru: _Открыть
tr: _Aç
uk: _Відчинено

source: Add to diagram
cs: Přidat do diagramu
fi: Lisää kaavioon
fr: Ajouter au diagramme
hi: आरेख में जोड़ें
hr: Dodaj u dijagram
it: Aggiungi al diagramma
nl: Aan diagram toevoegen
pt_br: Adicionar ao diagrama
ru: Добавить к диаграмме
tr: Diyagrama ekle
uk: Додайте до діаграми

source: _Rename
cs: _Přejmenovat
fi: _Nimeä uudelleen
fr: _Renommer
hi: नाम बदलें (_R)
hr: Pre_imenuj
id: _Ganti nama
it: _Rinomina
ko: 이름 바꾸기(_R)
nl: _Hernoemen
pt_br: _Renomear
ru: _Переименовать
sv: _Byt namn
tr: Yeniden _Adlandır
uk: _Перейменувати

source: New _Diagram
ar: _مخطط جديد
bn: নতুন _Diagram
ca: Nova _Diagram
cs: Nový _Diagram
fi: Uusi k_aavio
fr: Nouveau _Diagramme
hi: नया आरेख (_D)
hr: Novi _dijagram
id: _Diagram . baru
it: Nuovo _Diagrama
ja: 新しい_Diagram
ko: 새 다이어그램(_D)
nl: Nieuw _diagram
pt_br: Novo _Diagrama
ru: Новая _Диаграмма
sv: Nytt _Diagram
tr: Yeni _Diyagram
uk: Нова _діаграма

source: New _Element
fi: Uusi _elementti
fr: Nouvel _Elément
hi: नया तत्व (_E)
hr: Novi _element
it: Nuovo _Elemento
nl: Nieuw _element
pt_br: Novo _Elemento
ru: Новый _Элемент
tr: Yeni Ö_ge
uk: Новий _елемент

source: De_lete
ar: حذف
cs: _Odstranit
fi: Po_ista
fr: _Supprimer
hi: मिटाएं (_e)
hr: Iz_briši
id: Menghapus
it: Can_cella
ko: 삭제(_L)
nl: _Verwijderen
pt_br: _Excluir
ru: _Удалить
tr: _Sil
uk: Видалити

source: Show in “{diagram}”
ar: إظهار في “{diagram}”
bn: "{diagram}" এ দেখান
ca: Mostra-ho a "{diagram}"
cs: Zobrazit v "{diagram}"
fi: Näytä kaaviossa "{diagram}"
fr: Montrer dans "{diagram}"
hi: “{diagram}” में दिखाएं
hr: Prikaži u „{diagram}”
id: Tampilkan di “{diagram}”
it: Mostra in “{diagram}”
ja: "{diagram}" で表示する
ko: "{diagram}"에 표시
nl: Tonen in ‘{diagram}’
pt_br: Mostrar em “{diagram}”
ru: Показать в «{diagram}»
sv: Visa i "{diagram}"
tr: “{diagram}” diyagramında göster
uk: Показати в “{diagram}”

source: Model Changed on Disk
fi: Malli muuttui levyllä
fr: Modèle modifié sur disque
hi: डिस्क पर मॉडल बदला गया
hr: Model je promijenjen na disku
it: Modello cambiato nel disco
nl: Model is gewijzigd op schijf
pt_br: Modelo Alterado no Disco
ru: Модель Изменена на Диске
tr: Diskteki Model Değiştirildi
uk: Модель змінена на диску

source: Discard Changes and Reload
fi: Hylkää muutokset ja lataa uudelleen
fr: Rejeter les modifications et recharger
hi: परिवर्तन त्यागें और पुनः लोड करें
hr: Odbaci promjene i učitaj ponovo
it: Scarta modifiche e ricarica
nl: Wijzigingen verwerpen en herladen
pt_br: Descartar Alterações e Recarregar
ru: Отменить изменения и перезагрузить
tr: Değişiklikleri At ve Yeniden Yükle
uk: Скасувати зміни та перезавантажити

source: Restart Gaphor to enable language changes
fi: Käynnistä Gaphor uudelleen, jotta kielimuutokset tulevat voimaan
fr: Redémarrer Gaphor pour activer les changements de langue
hi: भाषा परिवर्तन सक्षम करने के लिए गैफोर को पुनः आरंभ करें
hr: Za aktiviranje promjene jezika ponovo pokreni Gaphor
it: Riavvia Gaphor per abilitare i cambiamenti di lingua
nl: Herstart Gaphor om taal­wijzigingen toe te passen
pt_br: Reinicie Gaphor para habilitar as alterações de idioma
ru: Перезапустите Gaphor, чтобы применить изменения языка
tr: Dil değişikliklerini etkinleştirmek için Gaphor'u yeniden başlat
uk: Перезапустіть Gaphor, щоб увімкнути зміни мови

source: Copyright © 2001 The Gaphor Development Team. UML, SysML, and RAAML are either registered trademarks or trademarks of Object Management Group, Inc. in the United States and/or other countries.
fi: Tekijänoikeus © 2001 Gaphor Development Team. UML, SysML ja RAAML ovat Object Management Group, Inc:n rekisteröityjä tavaramerkkejä tai tavaramerkkejä Yhdysvalloissa ja/tai muissa maissa.
fr: Copyright © 2001 L'équipe de développement Gaphor. UML, SysML et RAAML sont des marques déposées ou des marques commerciales d'Object Management Group, Inc. aux États-Unis et/ou dans d'autres pays.
hi: कॉपीराइट © 2001 गैफोर डेवलपमेंट टीम। UML, SysML, और RAAML संयुक्त राज्य अमेरिका और/या अन्य देशों में ऑब्जेक्ट मैनेजमेंट ग्रुप, इंक. के पंजीकृत ट्रेडमार्क या ट्रेडमार्क हैं।
hr: Autorska prava © 2001. The Gaphor Development Team. UML, SysML i RAAML su registrirani zaštitni znakovi ili zaštitni znakovi organizacije Object Management Group, Inc. u SAD-u i/ili drugim zemljama.
it: Copyright © 2001 Il team di sviluppo di Gaphor. UML, SysML, e RAAML sono marchi registrati o trademark di Object Management Group, Inc. negli Stati Uniti e/o in altri paesi.
nl: Copyright © 2001, het Gaphor-ontwikkel­team. UML, SysML en RAAML zijn geregistreerde handels­merken of handels­merken van Object Management Group, Inc. in de Verenigde Staten en/of andere landen.
pt_br: Copyright © 2001 A Equipe de Desenvolvimento do Gaphor. UML, SysML e RAAML são marcas registradas ou marcas comerciais da Object Management Group, Inc. nos Estados Unidos e/ou em outros países.
ru: Авторское право © 2001 The Gaphor Development Team. UML, SysML и RAAML являются либо зарегистрированными товарными знаками, либо товарными знаками Object Management Group, Inc. в Соединенных Штатах и/или других странах.
tr: Telif Hakkı © 2001 Gaphor Geliştirme Takımı UML, SysML ve RAAML, Object Management Group, Inc. şirketinin Amerika Birleşik Devletleri ve/veya diğer ülkelerdeki tescilli ticari markaları veya ticari markalarıdır.
uk: Copyright © 2001 Команда розробки Gaphor. UML, SysML і RAAML є зареєстрованими товарними знаками або товарними знаками Object Management Group, Inc. у Сполучених Штатах та/або інших країнах.
