Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Description
ar: وصف
bn: বর্ণনা
ca: Descripció
cs: Popis
fi: Kuvaus
hi: विवरण
hr: Opis
id: Keterangan
it: Descrizione
ja: 形容
ko: 설명
nl: Beschrijving
pt_br: Descrição
ru: Описание
sv: Beskrivning
tr: Açıklama
uk: Опис

source: Technology
ar: تكنولوجيا
bn: টেকনোলজি
ca: Tecnologia
cs: Technologie
fi: Teknologia
fr: Technologie
hi: प्रौद्योगिकी
hr: Tehnologija
id: Teknologi
it: Tecnologia
ja: テクノロジー
ko: 기술
nl: Technologie
pt_br: Tecnologia
ru: Технология
sv: Teknik
tr: Teknoloji
uk: Технології

source: New Software System
ar: نظام برمجيات جديد
bn: নতুন সফ্টওয়্যার সিস্টেম
ca: Nou sistema de programari
cs: Nový softwarový systém
fi: Uusi ohjelmistojärjestelmä
fr: Nouveau Système Logiciel
hi: नया सॉफ्टवेयर सिस्टम
hr: Novi softverski sustav
id: Sistem Perangkat Lunak Baru
it: Nuovo Sistema Software
ja: 新しいソフトウェアシステム
ko: 새로운 소프트웨어 시스템
nl: Nieuw software­systeem
pt_br: Novo Sistema de Software
ru: Новая Программная Система
sv: Nytt programvarusystem
tr: Yeni Yazılım Sistemi
uk: Нова система програмного забезпечення

source: New Container
ar: حاوية جديدة
bn: নতুন ধারক
ca: Contenidor nou
cs: Nový kontejner
fi: Uusi kontti
fr: Nouveau Conteneur
hi: नया कंटेनर
hr: Novi kontejner
id: Kontainer Baru
it: Nuovo container
ja: 新しいコンテナ
ko: 새 컨테이너
nl: Nieuwe container
pt_br: Novo Contêiner
ru: Новый контейнер
sv: Ny behållare
tr: Yeni Taşıyıcı
uk: Новий контейнер

source: Database
ar: قاعدة البيانات
bn: ডাটাবেস
ca: Base de dades
cs: Databáze
fi: Tietokanta
fr: Base de données
hi: डेटाबेस
hr: Baza podataka
id: Basis Data
ja: データベース
ko: 데이터베이스
pt_br: Banco de Dados
ru: База данных
sv: Databas
tr: Veri Tabanı
uk: База даних

source: New Database
ar: قاعدة بيانات جديدة
bn: নতুন ডাটাবেস
ca: Nova base de dades
cs: Nová databáze
fi: Uusi tietokanta
fr: Nouvelle base de données
hi: नया डेटाबेस
hr: Nova baza podataka
id: Basis Data Baru
it: Nuovo Database
ja: 新しいデータベース
ko: 새 데이터베이스
nl: Nieuwe database
pt_br: Novo Banco de Dados
ru: Новая База данных
sv: Ny databas
tr: Yeni Veri Tabanı
uk: Нова база даних

source: New Component
ar: مكون جديد
bn: নতুন কম্পোনেন্ট
ca: Component nou
cs: Nová komponenta
fi: Uusi komponentti
fr: Nouveau composant
hi: नया घटक
hr: Nova komponenta
id: Komponen Baru
it: Nuovo componente
ja: 新しいコンポーネント
ko: 새 구성 요소
nl: Nieuwe component
pt_br: Novo Componente
ru: Новый Компонент
sv: Ny komponent
tr: Yeni Bileşen
uk: Новий компонент

source: Person
ar: شخص
bn: ব্যক্তি
ca: Persona
cs: Osoba
fi: Henkilö
fr: Personne
hi: व्यक्ति
hr: Osoba
id: Orang
it: Persona
ja: 人
ko: 인간
nl: Persoon
pt_br: Pessoa
ru: Человек
tr: Kişi
uk: Особа

source: Software System
ar: نظام البرمجيات
bn: সফ্টওয়্যার সিস্টেম
ca: Sistema de programari
cs: Softwarový systém
fi: Ohjelmistojärjestelmä
fr: Système logiciel
hi: सॉफ्टवेयर सिस्टम
hr: Softverski sustav
id: Sistem Perangkat Lunak
it: Sistema Software
ja: ソフトウェアシステム
ko: 소프트웨어 시스템
nl: Softwaresysteem
pt_br: Sistema de Software
ru: Программная Система
sv: Programvarusystem
tr: Yazılım Sistemi
uk: Програмна система

source: Container
ar: وعاء
bn: ধারক
ca: Contenidor
cs: Kontejner
fi: Kontti
fr: Conteneur
hi: कंटेनर
hr: Kontejner
id: Wadah
it: Contenitore
ja: コンテナ
ko: 컨테이너
pt_br: Contêiner
ru: Контейнер
sv: Behållare
tr: Taşıyıcı
uk: Контейнер

source: Container: Database
ar: الحاوية: قاعدة البيانات
bn: ধারক: ডাটাবেস
ca: Contenidor: Base de dades
cs: Kontejner: databáze
fi: Kontti: tietokanta
fr: Conteneur : base de données
hi: कंटेनर: डेटाबेस
hr: Kontejner: Baza podataka
id: Wadah: Basis Data
it: Contenitore: Database
ja: コンテナ: データベース
ko: 컨테이너: 데이터베이스
pt_br: Contêiner: Banco de Dados
ru: Контейнер: База данных
sv: Behållare: Databas
tr: Taşıyıcı: Veri tabanı
uk: Контейнер: база даних

source: Component
ar: مكون
bn: অঙ্গ
cs: Komponenta
fi: Komponentti
fr: Composant
hi: घटक
hr: Komponenta
id: Komponen
it: Componente
ja: コンポーネント
ko: 구성요소
pt_br: Componente
ru: Компонент
sv: Komponent
tr: Bileşen
uk: Компонент

source: Dependency
ar: الاعتماد
bn: নির্ভরতা
ca: Dependència
cs: Závislost
fi: Riippuvuus
fr: Dépendance
hi: निर्भरता
hr: Ovisnost
id: Ketergantungan
it: Dipendenze
ja: 属国
ko: 의존요소
nl: Afhankelijkheid
pt_br: Dependência
ru: Зависимость
sv: Beroende
tr: Bağımlılık
uk: Залежність

source: C4 Diagram
fi: C4-kaavio
fr: Diagramme C4
hr: C4 dijagram
it: Diagramma C4
pt_br: Novo Diagrama C4
ru: Диаграмма C4
uk: Діаграма C4

source: Class Diagram
fi: Luokkakaavio
fr: Classe Diagramme
hr: Dijagram klasa
it: Diagramma classi
nl: Klassendiagram
pt_br: Novo Diagrama de Classe
ru: Диаграмма Классов
uk: Діаграма класів

source: Activity Diagram
fi: Aktiviteettikaavio
fr: Diagramme d’Activité
hr: Dijagram aktivnosti
it: Diagramma attività
nl: Activiteitendiagram
ru: Диаграмма Деятельности
uk: Діаграма діяльності

source: Sequence Diagram
fi: Sekvenssikaavio
fr: Diagramme de Séquence
hr: Dijagram slijeda
it: Diagramma di sequenza
nl: Sequentiediagram
ru: Диаграмма Последовательности
uk: Діаграма послідовності

source: State Machine Diagram
fi: Tilakaavio
fr: Diagramme d'État
hr: Novi dijagram automata konačnih stanja
it: Diagrama Macchina a Stati
nl: Staatmachinediagram
ru: Диаграмма Конечного Автомата
uk: Діаграма державного автомата

source: Generic Diagram
fi: Yleinen kaavio
fr: Diagramme Générique
hr: Opći dijagram
it: Diagramma generico
nl: Algemeen diagram
ru: Общая Диаграмма
uk: Загальна діаграма

source: Package
ar: طرد
bn: প্যাকেজ
ca: Paquet
cs: Balíček
fi: Pakkaus
fr: Paquet
hi: पैकेज
hr: Paket
id: Kemasan
it: Pacchetto
ja: パッケージ
ko: 패키지
nl: Pakket
pt_br: Pacote
ru: Пакет
sv: Paket
tr: Paket
uk: Пакет

source: Activity
ar: نشاط
bn: কার্যকলাপ
ca: Activitat
cs: Aktivita
fi: Aktiviteetti
fr: Activité
hi: गतिविधि
hr: Aktivnost
id: Aktivitas
it: Attività
ja: 活動
ko: 활동
nl: Activiteit
pt_br: Atividade
ru: Деятельность
sv: Aktivitet
tr: Etkinlik
uk: Діяльність

source: Interaction
ar: تفاعل
bn: মিথস্ক্রিয়া
ca: Interacció
cs: Interakce
fi: Interaktio
hi: इंटरैक्शन
hr: Interakcija
id: Interaksi
it: Interazione
ja: 相互作用
ko: 상호작용
nl: Interactie
pt_br: Interação
ru: Взаимодействие
sv: Interaktion
tr: Etkileşim
uk: Взаємодія

source: State Machine
ar: آلة الدولة
bn: রাষ্ট্র মেশিন
ca: Màquina d'estat
cs: Státní stroj
fi: Tilakone
fr: État Machine
hi: मशीन अवस्था
hr: Automat konačnih stanja
id: Mesin Negara
it: Macchina stato
ja: ステートマシン
ko: 상태 기계
nl: Staatmachine
pt_br: Máquina de Estado
ru: Конечный Автомат
sv: Tillståndsdator
tr: Durum makinesi
uk: Державна машина

source: Class
ar: فصل
bn: শ্রেণী
ca: Classe
cs: Třída
fi: Luokka
fr: Classe
hi: वर्ग
hr: Klasa
id: Kelas
it: Classe
ja: クラス
ko: 클래스
nl: Klasse
pt_br: Classe
ru: Класс
sv: Klass
tr: Sınıf
uk: Клас

source: Data Type
fi: Datatyyppi
fr: Type de données
hr: Vrsta podatka
it: Tipo dato
nl: GegevensType
ru: Тип Данных
uk: Тип даних

source: Enumeration
ar: تعداد
bn: গণনা
ca: Enumeració
cs: Výčet
fi: Enumeraatio
fr: Énumération
hi: गणना
hr: Nabrajanje
id: Pencacahan
it: Enumerazione
ja: 列挙
ko: 열거
nl: Opsomming
pt_br: Enumeração
ru: Перечисление
sv: Uppräkning
tr: Numaralandırma
uk: Перерахування

source: Primitive Type
fi: Primitiivityyppi
fr: Type Primitive
hr: Vrsta osnovnog elementa
it: Tipo primitivo
nl: Primitief type
ru: Примитивный тип
uk: Примітивний тип

source: FTA Diagram
fi: FTA-kaavio
fr: Diagramme FTA
hr: Dijagram analize kvarova
it: Diagramma FTA
ru: Диаграмма FTA
uk: Діаграма ЗВТ

source: STPA Diagram
fi: STPA-kaavio
fr: Diagramme STPA
hr: Dijagram sustavno-teoretske analize procesa (STPA)
it: Diagramma STPA
ru: Диаграмма STPA
uk: Діаграма STPA

source: Top Event
ar: أهم حدث
bn: শীর্ষ ইভেন্ট
ca: Esdeveniment superior
cs: Top událost
fi: Ylätapahtuma
fr: Évènement de premier plan
hi: शीर्ष घटना
hr: Top događaj
id: Acara Teratas
it: Evento in alto
ja: トップイベント
ko: 최상단 이벤트
nl: Topgebeurtenis
pt_br: Evento de Topo
ru: Верхнее Событие
sv: Topphändelse
tr: En Üst Olay
uk: Головна подія

source: Loss
ar: خسارة
bn: ক্ষতি
ca: Pèrdua
cs: Ztráta
fi: Menetys
fr: Perte
hi: हानि
hr: Gubitak
id: Kehilangan
it: Perdita
ja: 損失
ko: 손실
nl: Verlies
pt_br: Perda
ru: Потеря
sv: Förlust
tr: Kayıp
uk: Втрата

source: Hazard
ar: خطر
bn: বিপত্তি
ca: Perill
cs: Nebezpečí
fi: Hasardi
fr: Accident
hi: खतरा
hr: Opasnost
id: Bahaya
it: Pericolo
ja: ハザード
ko: 위험
nl: Gevaar
pt_br: Risco
ru: Опасность
sv: Fara
tr: Tehlike
uk: Небезпека

source: Situation
ar: قارة
bn: অবস্থা
ca: Situació
cs: Situace
fi: Tilanne
hi: परिस्थिति
hr: Situacija
id: Situasi
it: Situazione
ja: 状況
ko: 상황
nl: Situatie
pt_br: Situação
ru: Ситуация
tr: Durum
uk: Ситуація

source: AND Gate
ar: والبوابة
bn: এবং গেট
ca: I porta
cs: Brána AND
fi: AND-portti
fr: Porte ET
hi: AND गेट
hr: Sklopka I
id: Gerbang DAN
it: Porta AND
ja: アンドゲート
ko: AND 게이트
nl: AND-poort
pt_br: Porta AND
ru: Элемент И
sv: OCH Grind
tr: VE (AND) Geçidi
uk: І Ворота

source: Basic Event
ar: حدث أساسي
bn: মৌলিক ঘটনা
ca: Esdeveniment bàsic
cs: Základní událost
fi: Perustapahtuma
fr: Évènement basique
hi: मूल घटना
hr: Osnovni događaj
id: Acara Dasar
it: Evento basico
ja: 基本イベント
ko: 기본 이벤트
nl: Basisgebeurtenis
pt_br: Evento Básico
ru: Обычное Событие
sv: Grundläggande händelse
tr: Temel Olay
uk: Основна подія

source: Conditional Event
ar: حدث مشروط
bn: শর্তসাপেক্ষ ঘটনা
ca: Esdeveniment condicional
cs: Podmíněná událost
fi: Ehdollinen tapahtuma
fr: Évènement conditionnel
hi: सशर्त घटना
hr: Uvjetni događaj
id: Acara Bersyarat
it: Evento condizionale
ja: 条件付きイベント
ko: 조건 이벤트
nl: Conditionele gebeurtenis
pt_br: Evento Condicional
ru: Условное Событие
sv: Villkorlig händelse
tr: Şartlı Olay
uk: Умовна подія

source: Dormant Event
ar: حدث نائم
bn: সুপ্ত ঘটনা
ca: Esdeveniment inactiu
cs: Spící událost
fi: Uinuva tapahtuma
fr: Évènement dormant
hi: निष्क्रिय घटना
hr: Neaktivni događaj
id: Acara tidak aktif
it: Evento dormiente
ja: 休眠イベント
ko: 휴면 이벤트
nl: Slapende gebeurtenis
pt_br: Evento Dormente
ru: Спящее Событие
sv: Vilande händelse
tr: Hareketsiz Olay
uk: Спляча подія

source: Fault Tree Analysis
ar: تحليل شجرة الأعطال
bn: ত্রুটি গাছ বিশ্লেষণ
ca: Anàlisi de l'arbre de fallades
cs: Analýza stromu poruch
fi: Vikapuuanalyysi
fr: Analyse de l'arbre de défaillance
hi: त्रुटि ट्री विश्लेषण
hr: Analiza kvarova
id: Analisis Pohon Kesalahan
it: Analisi dell'albero dei guasti
ja: フォルトツリー分析
ko: 결함 트리 분석
nl: Foutenboomanalyse
pt_br: Análise de Árvore de Falhas
ru: Анализ Дерева Отказов
sv: Analys av felträd
tr: Arıza Ağacı Analizi
uk: Аналіз дерева несправностей

source: AND
ar: و
bn: এবং
ca: I
fi: JA
fr: ET
hr: I
id: DAN
ja: そして
ko: 그리고
ru: И
sv: OCH
tr: VE (AND)
uk: І

source: OR Gate
ar: بوابة OR
bn: OR গেট
ca: Porta OR
cs: Brána OR
fi: OR-portti
fr: Porte OU
hi: OR गेट
hr: Sklopka ILI
id: Gerbang ATAU
it: Porta OR
ja: OR ゲート
ko: OR 게이트
nl: OR-poort
pt_br: Porta OR
ru: Элемент ИЛИ
sv: ELLER Grind
tr: VEYA (OR) Geçidi
uk: АБО ворота

source: OR
ar: أو
bn: বা
ca: O
cs: NEBO
fi: TAI
fr: OU
hr: ILI
id: ATAU
ja: 又は
ko: 또는
ru: ИЛИ
sv: ELLER
tr: VEYA (OR)
uk: Або

source: NOT Gate
ar: ليس بوابة
bn: নট গেট
ca: NO porta
cs: NE Brána
fi: NOT-portti
fr: Porte NON
hi: NOT गेट
hr: Sklopka NE
id: BUKAN Gerbang
it: Porta NOT
ja: NOT ゲート
ko: NOT 게이트
nl: NOT-poort
pt_br: Porta NOT
ru: Элемент НЕ
sv: INTE grind
tr: DEĞİL (NOT) Geçidi
uk: НЕ ворота

source: NOT
ar: ليس
bn: না
ca: NO
cs: NE
fi: EI
fr: NON
hr: NE
id: BUKAN
ja: じゃない
ko: 안
ru: НЕ
sv: INTE
tr: DEĞİL (NOT)
uk: НЕ

source: Sequence Enforcing (SEQ) Gate
ar: بوابة إنفاذ التسلسل (SEQ)
bn: Sequence Enforcing (SEQ) গেট
ca: Porta d'aplicació de seqüències (SEQ)
cs: Brána vynucení sekvence (SEQ)
fi: Sekvenssin pakottava portti (SEQ)
fr: Porte d’application de séquence (SEQ)
hi: अनुक्रम प्रवर्तन (SEQ) गेट
hr: Sklopka sprovođenja slijeda (SEQ)
id: Gerbang Penegakan Urutan (SEQ)
it: Porta Sequence Enforcing (SEQ)
ja: シーケンス強制(SEQ)ゲート
ko: 시퀀스 강제(SEQ) 게이트
nl: Sequence Enforcing (SEQ)-poort
pt_br: Porta SEQ
ru: Последовательный Элемент
sv: Seq-porten (SequenceForcing)
tr: Sıra Zorlama (SEQ) Geçidi
uk: Шлюз забезпечення послідовності (SEQ)

source: SEQ
hr: SEQ (sprovođenja slijeda)
ja: セク
ru: Последовательный
tr: Sıra Zorlama (SEQ)

source: Exclusive OR Gate
ar: بوابة OR الحصرية
bn: এক্সক্লুসিভ OR গেট
ca: Porta EXCLUSIVA OR
cs: Exkluzivní brána OR
fi: Poissulkeva portti (XOR)
fr: Porte OU exclusive
hi: अनन्य OR गेट
hr: Sklopka isključivo ILI
id: Gerbang ATAU Eksklusif
it: Porta Exlcusive OR
ja: エクスクルーシブ OR ゲート
ko: 배타 OR 게이트
nl: Exclusieve OR-poort
pt_br: Porta OR Exclusiva
ru: Элемент Исключающее ИЛИ
sv: Exklusiv ELLER Grind
tr: Dışlayan Özel VEYA (XOR) Geçidi
uk: Ексклюзивні ворота

source: XOR
fr: OU Exclusif
hr: XILI
ru: ИскИЛИ
tr: Dışlayan Özel VEYA (XOR)

source: Majority Vote Gate
ar: بوابة تصويت الأغلبية
bn: সংখ্যাগরিষ্ঠ ভোট গেট
ca: Porta de vot de la majoria
cs: Brána majoritního hlasování
fi: Enemmistön äänestysportti
fr: Porte du vote majoritaire
hi: बहुमत वोट गेट
hr: Sklopka većina glasova
id: Gerbang Suara Mayoritas
it: Porta del voto di maggioranza
ja: マジョリティ投票ゲート
ko: 다수결 투표 게이트
nl: Meerderheidsstemmingspoort
pt_br: Porta de Voto da Maioria
ru: Элемент Большинства Голосов
sv: Majoritetsröst gate
tr: Çoğunluk Oy Geçidi
uk: Ворота більшості голосів

source: Inhibit Gate
ar: بوابة المنع
bn: বাধা গেট
ca: Inhibeix la porta
cs: Inhibiční brána
fi: Rajoittava portti
fr: Porte d'Inhibition
hi: अवरोध गेट
hr: Sklopka I s uvjetom
id: Menghambat Gerbang
it: Porta di inibizione
ja: ゲートを抑制する
ko: 억제 게이트
nl: Blokkeerpoort
pt_br: Porta de Inibição
ru: Блокирующий Элемент
sv: Hämma grind
tr: Engelleme Geçidi
uk: Заборонити ворота

source: Transfer In
ar: نقل في
bn: স্থানান্তর করুন
ca: Transferència a
cs: Přenést dovnitř
fi: Siirto sisään
fr: Transfert Entrée
hi: अंदर स्थानांतरण
hr: Prijenos u
id: Transfer Masuk
it: Trasferimento in entrata
ja: 転送先
ko: 수신
nl: Overdracht in
pt_br: Transferir para
ru: Вход
sv: Överför in
tr: İçeriye Aktar
uk: Трансфер в

source: Transfer Out
ar: انقله خارجا
bn: ট্রান্সফার আউট
ca: Transferència fora
cs: Přenést ven
fi: Siirto ulos
fr: Transfert sortant
hi: बाहर स्थानांतरण
hr: Prijenos iz
id: Transfer Keluar
it: Trasferimento in uscita
ja: 転送アウト
ko: 송신
nl: Overdracht uit
pt_br: Transferir de
ru: Выход
sv: Överför ut
tr: Dışarıya Aktar
uk: Перенесіть вихід

source: Undeveloped Event
ar: حدث غير مطور
bn: অনুন্নত ঘটনা
ca: Esdeveniment no desenvolupat
cs: Nerozvinutá událost
fi: Kehittymätön tapahtuma
fr: Évènement non-développé
hi: अविकसित घटना
hr: Nerazvijeni događaj
id: Acara yang belum dikembangkan
it: Evento non sviluppato
ja: 未開発のイベント
ko: 미개발 이벤트
nl: Onontwikkelde gebeurtenis
pt_br: Evento Não-desenvolvido
ru: Неразработанное Событие
sv: Outvecklad händelse
tr: Gelişmemiş Olay
uk: Нерозвинена подія

source: House Event
ar: حدث البيت
bn: হাউস ইভেন্ট
ca: Esdeveniment de la Casa
cs: Domácí událost
fi: Talotapahtuma
fr: Évènement maison
hi: गृह घटना
hr: Kućni događaj
id: Acara Rumah
it: Evento casa
ja: ハウスイベント
ko: 하우스 이벤트
nl: Huisgebeurtenis
pt_br: Evento Local
ru: Внешнее Событие
sv: Hushändelse
tr: Ev Olayı
uk: Домашня подія

source: Zero Event
ar: حدث صفر
bn: জিরো ইভেন্ট
ca: Esdeveniment zero
cs: Žádná událost
fi: Nollatapahtuma
fr: Évènement Zéro
hi: शून्य घटना
hr: Nula događaj
id: Acara Nol
it: Evento zero
ja: ゼロイベント
ko: 제로 이벤트
nl: Nulgebeurtenis
pt_br: Evento Zero
ru: Нулевое Событие
sv: Noll händelse
tr: Sıfır Olay
uk: Нульова подія

source: Intermediate Event
ar: حدث متوسط
bn: ইন্টারমিডিয়েট ইভেন্ট
ca: Esdeveniment intermedi
cs: Přechodná událost
fi: Välitason tapahtuma
fr: Évènement intermédiaire
hi: मध्यवर्ती घटना
hr: Intermedijarni događaj
id: Acara Menengah
it: Evento intermediario
ja: 中間イベント
ko: 중간 이벤트
nl: Tussentijdse gebeurtenis
pt_br: Evento Intermediário
ru: Промежуточное Событие
sv: Mellanliggande händelse
tr: Ara Olay
uk: Проміжна подія

source: Sequence Enforcing Gate
ar: بوابة إنفاذ التسلسل
ca: Porta d'aplicació de seqüències
cs: Brána vynucující sekvenci
fi: Sekvenssin pakottava portti
fr: Porte de renforcement des séquences
hi: अनुक्रम प्रवर्तन गेट
hr: Sklopka sprovođenja slijeda
id: Gerbang Penegakan Urutan
it: Porta SEQ
ja: シーケンス強制ゲート
ko: 시퀀스 적용 게이트
nl: Volgordeafdwangpoort
pt_br: Porta Sequencial
ru: Последовательный Элемент
sv: Sekvens som framtvingar gate
tr: Sıra Zorlama Geçidi
uk: Ворота забезпечення послідовності

source: XOR Gate
ar: بوابة XOR
bn: XOR গেট
ca: Porta XOR
cs: Brána XOR
fi: Poissulkeva portti (XOR)
fr: Porte OU Exclusif
hi: XOR गेट
hr: Sklopka XILI
id: Gerbang XOR
it: Porta XOR
ja: XOR ゲート
ko: XOR 게이트
nl: XOR-poort
pt_br: Porta XOR
ru: Элемент ИскИЛИ
sv: XOR-porten
tr: Dışlayan Özel VEYA (XOR) Geçidi
uk: Ворота XOR

source: Control Action
ar: إجراء التحكم
bn: নিয়ন্ত্রণ কর্ম
ca: Acció de control
cs: Ovládací akce
fi: Kontrollitoiminto
fr: Action de contrôle
hi: नियंत्रण कार्रवाई
hr: Kontrolna radnja
id: Tindakan Kontrol
it: Azione di controllo
ja: コントロールアクション
ko: 제어 동작
nl: Controleactie
pt_br: Ação de Controle
ru: Управляющее Действие
sv: Kontrollåtgärd
tr: Denetim Eylemi
uk: Контрольна дія

source: Operational Situation
ar: الوضع التشغيلي
bn: অপারেশনাল পরিস্থিতি
ca: Situació operativa
cs: Provozní situace
fi: Operationaalinen tilanne
fr: Situation Opérationnelle
hi: परिचालन स्थिति
hr: Operacijska situacija
id: Situasi Operasional
it: Situazione operativa
ja: 運用状況
ko: 처리 상황
nl: Operationele situatie
pt_br: Situação Operacional
ru: Оперативная Обстановка
sv: Operativ situation
tr: İşletim Durumu
uk: Оперативна обстановка

source: Abstract Operational Situation
ar: مجردة الوضع التشغيلي
bn: বিমূর্ত কর্মক্ষম পরিস্থিতি
ca: Situació operativa abstracta
cs: Abstraktní provozní situace
fi: Abstrakti operationaalinen tilanne
fr: Situation Opérationnelle Abstraite
hi: सार परिचालन स्थिति
hr: Apstraktna operacijska situacija
id: Situasi Operasional Abstrak
it: Situazione operativa astratta
ja: 抽象的な運用状況
ko: 추상 처리 상황
nl: Abstracte operationele situatie
pt_br: Situação Operacional Abstrata
ru: Абстрактная Оперативная Обстановка
sv: Abstrakt operativ situation
tr: Soyut İşletim Durumu
uk: Абстрактна оперативна ситуація

source: Generalization
ar: تعميم
bn: সাধারণীকরণ
ca: Generalització
cs: Zobecnění
fi: Yleistys
fr: Généralisation
hi: सामान्यकरण
hr: Generalizacija
id: Generalisasi
it: Generalizzazione
ja: 概括
ko: 일반화
nl: Generalisatie
pt_br: Generalização
ru: Обобщение
sv: Generalisering
tr: Genelleme
uk: Узагальнення

source: Control Structure
ar: هيكل التحكم
bn: নিয়ন্ত্রণ কাঠামো
ca: Estructura de control
cs: Struktura řízení
fi: Kontrollirakenne
fr: Structure de Contrôle
hi: नियंत्रण संरचना
hr: Struktura kontrole
id: Struktur Kontrol
it: Struttura di controllo
ja: 制御構造
ko: 제어 구조
nl: Controlestructuur
pt_br: Estrutura de Controle
ru: Структура Управления
sv: Kontrollstruktur
tr: Denetim Yüzeyleri
uk: Структура контролю

source: Controller
ar: مراقب
bn: নিয়ন্ত্রক
ca: Controlador
cs: Ovladač
fi: Kontrolleri
fr: Contrôleur
hi: नियंत्रक
hr: Kontroler
id: Pengontrol
it: Controllore
ja: コントローラ
ko: 컨트롤러
nl: Regelaar
pt_br: Controlador
ru: Контроллер
sv: Kontrollant
tr: Denetleyici
uk: Контролер

source: Actuator
ar: المحرك
ca: Actuador
cs: Pohon
fi: Aktuaattori
fr: Actionneur
hi: एक्चुएटर
hr: Upravljač
id: Aktuator
it: Attuatore
ja: アクチュエータ
ko: 액츄에이터
pt_br: Atuador
ru: Привод
sv: Ställdon
tr: Çalıştırıcı
uk: Актуатор

source: Controlled Process
ar: عملية خاضعة للرقابة
bn: নিয়ন্ত্রিত প্রক্রিয়া
ca: Procés controlat
cs: Řízený proces
fi: Kontrolloitu prosessi
fr: Processus Contrôlé
hi: नियंत्रित प्रक्रिया
hr: Kontrolirani proces
id: Proses Terkendali
it: Processo controllato
ja: 制御されたプロセス
ko: 제어 프로세스
nl: Gecontroleerd proces
pt_br: Processo Controlado
ru: Контролируемый Процесс
sv: Kontrollerad process
tr: Denetimli Süreç
uk: Контрольований процес

source: Unsafe Control Action
ar: إجراء تحكم غير آمن
bn: অনিরাপদ নিয়ন্ত্রণ কর্ম
ca: Acció de control insegura
cs: Nebezpečná kontrolní akce
fi: Epäturvallinen kontrollitoiminto
fr: Action de contrôle dangereuse
hi: असुरक्षित नियंत्रण कार्रवाई
hr: Nesigurna kontrolna radnja
id: Tindakan Kontrol Tidak Aman
it: Azione di controllo non sicura
ja: 安全でないコントロール アクション
ko: 안전하지 않은 제어 동작
nl: Onveilige controleactie
pt_br: Ação de Controle Insegura
ru: Небезопасное Действие Управления
sv: Åtgärd för osäker kontroll
tr: Güvensiz Denetim Eylemi
uk: Небезпечна контрольна дія

source: Relevant To
ar: لدية علاقة ب
bn: প্রাসঙ্গিক
ca: Rellevant per a
cs: Relevantní pro
fi: Relevantti kenelle
fr: Concerne
hi: इसके प्रासंगिक
hr: Relevantno za
id: Berkaitan dengan
it: Rilevante per
ja: 関連する
ko: 관련 대상
nl: Relevant voor
pt_br: Relevante para
ru: Относится К
sv: Relevant för
tr: İlgili
uk: Що стосується

source: Can’t create “{name}” nested under a “{elem}”
fi: Ei voi luoda sisäkkäistä "{name}" "{elem}":n alle
fr: Impossible de créer un « {name} » imbriqué dans un « {elem} »
hr: Nije moguće stvoriti „{name}” ugniježđen ispod „{elem}”
it: Impossibile creare "{name}" annidato sotto a "{elem}"
pt_br: Não é possível criar “{name}” aninhado sob um “{elem}”
ru: Невозможно создать элемент «{name}», вложенный в «{elem}»
uk: Неможливо створити «{name}», вкладений у «{elem}»

source: Item Flow
ar: تدفق العنصر
bn: আইটেম ফ্লো
ca: Flux d'elements
cs: Průtok položky
fi: Tietuevirta
fr: Flux de l'élément
hi: आइटम प्रवाह
hr: Tok elementa
id: Aliran Barang
it: Flusso elemento
ja: アイテムフロー
ko: 항목 흐름
nl: Item-stroom
pt_br: Fluxo de Itens
ru: Поток Элементов
sv: Artikelflöde
tr: Öge Akışı
uk: Потік предметів

source: Enable Item Flow
cs: Povolit průtok položky
fi: Ota tuotevirta käyttöön
fr: Autorise le Flux de l'Élément
hi: आइटम प्रवाह सक्षम करें
hr: Aktiviraj tok elementa
it: Abilita flusso elemento
nl: Activeer Item-stroom
pt_br: Habilitar Fluxo de Itens
ru: Включить Поток Элементов
tr: Öge Akışını Etkinleştir
uk: Увімкнути потік елементів

source: Item Property
ar: خاصية العنصر
bn: আইটেম বৈশিষ্ট্য
ca: Propietat de l'element
cs: Vlastnost položky
fi: Tietueominaisuus
fr: Propriété de l'Élément
hi: आइटम प्रॉपर्टी
hr: Svojstvo elementa
id: Barang Properti
it: Proprietà elemento
ja: アイテムプロパティ
ko: 항목 속성
nl: Item Eigenschap
pt_br: Propriedades do Item
ru: Свойство Элемента
sv: Egenskap för artikel
tr: Öge Özelliği
uk: Властивість елемента

source: Invert direction
ar: عكس الاتجاه
bn: দিক পরিবর্তন করুন
ca: Inverteix la direcció
cs: Obrátit směr
fi: Käänteinen suunta
fr: Inverser la direction
hi: दिशा उलटें
hr: Preokreni smjer
id: Membalikkan arah
it: Inverti direzione
ja: 方向を反転する
ko: 방향 반전
nl: Keer richting om
pt_br: Inverter direção
ru: Инвертировать направление
sv: Inverterad riktning
tr: Yönü tersine çevir
uk: Інвертувати напрямок

source: Allocated Type
ar: النوع المخصص
bn: বরাদ্দকৃত প্রকার
ca: Tipus assignat
cs: Přidělený typ
fi: Allokoitu tyyppi
fr: Type Alloué
hi: आवंटित प्रकार
hr: Dodijeljena vrsta
id: Jenis yang dialokasikan
it: Tipo allocato
ja: 割り当てられたタイプ
ko: 할당된 유형
nl: Toegewezen type
pt_br: Tipo Alocado
ru: Выделенный Тип
sv: Tilldelad typ
tr: Ayrılan Tür
uk: Виділений тип

source: Compartments
ar: مقصورات
bn: কম্পার্টমেন্ট
ca: Compartiments
cs: Přihrátky
fi: Osastot
fr: Compartiments
hi: डिब्बे
hr: Odjeljci
id: Kompartemen
it: Compartimenti
ja: コンパートメント
ko: 구획
nl: Compartementen
pt_br: Compartimentos
ru: Отделения
sv: Fack
tr: Bölmeler
uk: Відсіки

source: Show Parts
ar: إظهار الأجزاء
bn: অংশসমূহ প্রদর্শন করুন
ca: Mostra les parts
cs: Zobrazit části
fi: Näytä osat
fr: Montrer les Pièces
hi: भाग दिखाएं
hr: Prikaži dijelove
id: Tampilkan Bagian
it: Mostra parti
ja: 部品を表示
ko: 일부 표시
nl: Onderdelen tonen
pt_br: Mostrar Partes
ru: Показывать Части
sv: Visa delar
tr: Parçaları Göster
uk: Показати частини

source: Show References
ar: إظهار المراجع
bn: তথ্যসূত্র প্রদর্শন করুন
ca: Mostra les referències
cs: Zobrazit Reference
fi: Näytä viittaukset
fr: Afficher les Références
hi: संदर्भ दिखाएं
hr: Prikaži reference
id: Tampilkan Referensi
it: Mostra riferimenti
ja: 参照を表示
ko: 참조 표시
nl: Verwijzingen tonen
pt_br: Mostrar Referências
ru: Показать Ссылки
sv: Visa referenser
tr: Referansları Göster
uk: Показати літературу
