Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Add and edit class operations according to UML syntax. • <tt>call()</tt> • <tt>+ call(a: int[*], b: str): bool</tt> (public, parameters) • <tt># call(a: int, b: str) # a note</tt> (protected, with remark) Press <b>Enter</b> to edit, <b>Backspace</b>/<b>Delete</b> to remove items. Use <b>-</b>/<b>=</b> to move items up or down.
ar: قم بإضافة وتحرير عمليات الفصل وفقًا لبناء جملة UML. • مكالمة <tt> () </tt> • <tt> + استدعاء (a: int [*]، b: str): bool </tt> (عام ، معلمات) • <tt> # call (a: int، b: str) # a note </tt> (محمية ، مع ملاحظة) اضغط على <b> أدخل </b> للتعديل ، <b> مسافة للخلف </b> / <b> احذف </b> لإزالة العناصر. استخدم <b> - </b> / <b> = </b> لنقل العناصر لأعلى أو لأسفل.
bn: UML সিনট্যাক্স অনুযায়ী ক্লাস অপারেশন যোগ করুন এবং সম্পাদনা করুন। • <tt>কল()</tt> • <tt>+ কল(a: int[*], b: str): bool</tt> (সর্বজনীন, পরামিতি) • <tt># কল(a: int, b: str) # একটি নোট</tt> (সুরক্ষিত, মন্তব্য সহ) সম্পাদনা করতে <b>Enter</b> টিপুন, <b>ব্যাকস্পেস</b>/<b>মুছুন</b> আইটেমগুলি সরাতে। আইটেমগুলি উপরে বা নীচে সরাতে <b>-</b>/<b>=</b> ব্যবহার করুন।
ca: Afegeix i edita les operacions de classe segons la sintaxi UML. • <tt>call()</tt> • <tt>+ call(a: int[*], b: str): bool</tt> (públic, paràmetres) • <tt># call(a: int, b: str) # a note</tt> (protegida, amb observació) Premeu <b>Enter</b> per editar, <b>Retrocés</b>/<b>Suprimeix</b> per eliminar elements. Utilitzeu <b>-</b>/<b>=</b> per moure els elements amunt o avall.
cs: Přidávat a upravovat operace tříd podle syntaxe UML. - <tt>call()</tt> - <tt>+ call(a: int[*], b: str): bool</tt> (public, parameters) - <tt># call(a: int, b: str) # poznámka</tt> (protected, s poznámkou) Stiskněte <b>Enter</b> pro úpravu, <b>Backspace</b>/<b>Delete</b> pro odstranění položek. Pomocí <b>-</b>/<b>=</b> přesunete položky nahoru nebo dolů.
fi: Lisää ja muokkaa luokan operaatioita UML-syntaksin mukaan. • <tt>soita()</tt> • <tt>+ kutsu(a: int[*], b: str): bool</tt> (julkinen, parametrit) • <tt># kutsu(a: int, b: str) # muistiinpano</tt> (suojattu, huomautuksella) Paina <b>Syötä</b> muokataksesi, <b>askelpalautin</b>/<b>Delete</b> poistaa kohteita. Käytä <b>-</b>/<b>=</b> siirtääksesi kohteita ylös tai alas.
fr: Ajouter et modifier les opérations de classe conformément à la syntaxe UML. • <tt>call()</tt> • <tt>+ call(a: int[*], b : str) : bool</tt> (publique, paramètres) • <tt># call(a: int, b : str) # a note</tt> (protégé, avec remarques) Appuyer sur <b>Entrée</b> pour modifier, <b>Retour arrière</b>/<b>Suppr.</b> pour supprimer des éléments. Utiliser <b>-</b>/<b>=</b> pour déplacer les éléments plus haut ou plus bas.
hi: UML वाक्यविन्यास के अनुसार वर्ग संचालन जोड़ें और संपादित करें। • <tt>call()</tt> • <tt>+ call(a: int[*], b: str): bool</tt> (सार्वजनिक, पैरामीटर) • <tt># call(a: int, b: str) # एक टिप्पणी</tt> (संरक्षित, टिप्पणी के साथ) संपादित करने के लिए <b>Enter</b> दबाएं, आइटम हटाने के लिए <b>Backspace</b>/<b>Delete</b> दबाएं। आइटम को ऊपर या नीचे ले जाने के लिए <b>-</b>/<b>=</b> का उपयोग करें।
hr: Dodaj i uredi operacije klasa u skladu s UML sintaksom. • <tt>call()</tt> • <tt>+ call(a: int[*], b: str): bool</tt> (javno, parametri) • <tt># call(a: int, b: str) # bilješka</tt> (zaštićeno, uz napomenu) Pritisni <b>Enter</b> za uređivanje, <b>Backspace</b>/<b>Delete</b> za uklanjanje elemenata. Koristi <b>-</b>/<b>=</b> za premještanje elemenata prema gore ili dolje.
id: Menambah dan mengedit operasi kelas sesuai dengan sintaks UML. • <tt>panggilan()</tt> • <tt>+ panggilan(a: int[*], b: str): bool</tt> (publik, parameter) • <tt># panggilan(a: int, b: str) # a note</tt> (dilindungi, dengan komentar) Tekan <b>Enter</b> untuk mengedit, <b>Backspace</b>/<b>Delete</b> untuk menghapus item. Gunakan <b>-</b>/<b>=</b> untuk memindahkan item ke atas atau ke bawah.
it: Aggiungi e modifica le operazioni della classe secondo la sintassi UML. • <tt>call()</tt> • <tt>+ call(a: int[*], b: str): bool</tt> (pubblica, parametri) • <tt># call(a: int, b: str) # a note</tt> (protetta, con remark) Premi <b>Enter</b> per modificare, <b>Backspace</b>/<b>Delete</b> per rimuovere gli elementi. Usa <b>-</b>/<b>=</b> per spostare gli elementi su o giù.
ja: UML 構文に従ってクラスの操作を追加および編集します。 •<tt>コール()</tt> • <tt>+ コール(a: int[*], b: str): bool</tt> (パブリック、パラメータ) • <tt>#コール(a:int、b:str)#ノート</tt>(保護された、注釈付き) <b>Enter</b>を押して編集し、<b>バックスペース</b>/<b>削除</b>項目を削除します。 <b>-</b>/<b>=</b>を使用して、アイテムを上下に移動します。
ko: UML 구문에 따라 클래스 작업을 추가하고 편집합니다. • <tt>콜()</tt> • <tt>+ 전화(a: int[*], b: str): bool</tt> (공개, 매개 변수) • <tt># 전화 (a: int, b: str) # 메모</tt> (보호, 발언) <b>Enter</b>를 눌러 편집하고, <b>백스페이스</b>/<b>삭제</b>를 눌러 항목을 제거합니다. <b>-</b>/<b>=</b>를 사용하여 항목을 위 또는 아래로 이동합니다.
nl: Klasse operaties volgens de UML syntax. • <tt>call()</tt> • <tt>+ call(a: int[*], b: str): bool</tt> (publiek, parameters) • <tt># call(a: int, b: str) # a note</tt> (beschermd, met opmerking) Druk <b>Enter</b> om te wijzigen, <b>Backspace</b>/<b>Delete</b> om items te verwijderen. Gebruik <b>-</b>/<b>=</b> om items naar boven of beneden te verplaatsen.
pt_br: Adicione e edite as operações da classe de acordo com a sintaxe UML. • <tt>chamada()</tt> • <tt>+ chamada(a: int[*], b: str): bool</tt> (público, parâmetros) • <tt># chamada(a: int, b: str) # uma nota</tt> (protegido, com observação) Pressione <b>Enter</b> para editar, <b>Backspace</b>/<b>Delete</b> para remover itens. Use <b>-</b>/<b>=</b> para mover itens para cima ou para baixo.
ru: Добавляйте и редактируйте методы класса в соответствии с синтаксисом UML. • <tt>вызов()</tt> • <tt>+ вызов(a: int[*], b: str): bool</tt> (публичный, параметры) • <tt># вызов(a: int, b: str) # пометка</tt> (защищённый, с пометкой) Нажмите <b>Enter</b> для редактирования, <b>Backspace</b>/<b>Delete</b> для удаления элементов. Используйте <b>-</b>/<b>=</b> для перемещения элементов вверх и вниз.
sv: Lägg till och redigera klassåtgärder enligt UML-syntax. • <tt>call()</tt> • <tt>+ anrop(a: int[*], b: str): bool</tt> (offentliga, parametrar) • <tt># anrop(a: int, b: str) # a note</tt> (skyddad, med anmärkning) Tryck på <b>Enter</b> för att redigera ,<b>Backsteg</b>/<b>Delete</b> för att ta bort objekt. Använd <b>-</b>/<b>=</b> för att flytta objekt uppåt eller nedåt.
tr: UML sözdizimine göre sınıf işlemlerini ekleyin ve düzenleyin. • <tt>call()</tt> • <tt>+ call(a: int[*], b: str): bool</tt> (public, parametreler) • <tt># call(a: int, b: str) # bir not</tt> (protected, not ile) Düzenlemek için <b>Enter</b>ʼa basın, Ögeleri kaldırmak için <b>Geri Sil</b>/<b>Sil</b>ʼe basın. Öğeleri yukarı veya aşağı taşımak için <b>-</b>/<b>=</b> kullanın.
uk: Додавати та редагувати операції класу відповідно до синтаксису UML. • <tt>call()</tt> • <tt>+ call(a: int[*], b: str): bool</tt> (публічний, параметри) • <tt># виклик(a: int, b: str) # примітка</tt> (захищена, із зауваженням) Натисніть <b>Enter</b>, щоб редагувати, <b>Backspace</b>/<b>Delete</b>, щоб видалити елементи. Використовуйте <b>-</b>/<b>=</b>, щоб перемістити елементи вгору або вниз.

source: Show Operations
ar: إظهار العمليات
bn: ক্রিয়াকলাপসমূহ প্রদর্শন করুন
ca: Mostra les operacions
cs: Zobrazit operace
fi: Näytä operaatiot
fr: Afficher les opérations
hi: अभियान दिखाएं
hr: Prikaži operacije
id: Tampilkan Operasi
it: Mostra Operazioni
ja: 操作の表示
ko: 동작 표시
nl: Handelingen tonen
pt_br: Mostrar Operações
ru: Показывать Методы
sv: Visa åtgärder
tr: İşlemleri Göster
uk: Показати операції

source: Enumeration Literals
ar: التعداد الحرفي
bn: গণনা আক্ষরিক
ca: Literals d'enumeració
cs: Literály výčtu
fi: Enumeraation literaalit
fr: Énumération littérales
hi: गणना शाब्दिक
hr: Elementi nabrajanja
id: Enumerasi Literal
it: Letterali di enumerazione
ja: 列挙リテラル
ko: 열거 문자
nl: Enumeratie Literals
pt_br: Literais de Enumeração
ru: Значения
sv: Uppräkning literaler
tr: Numaralandırma Sabit Değerleri
uk: Літерали перерахування

source: Add and edit enumeration literals according to UML syntax. • <tt>enum</tt> Press <b>Enter</b> to edit, <b>Backspace</b>/<b>Delete</b> to remove items. Use <b>-</b>/<b>=</b> to move items up or down.
ar: قم بإضافة وتحرير حرفية التعداد وفقًا لبناء جملة UML. • <tt> تعداد </tt> اضغط على <b> أدخل </b> للتعديل ، <b> مسافة للخلف </b> / <b> احذف </b> لإزالة العناصر. استخدم <b> - </b> / <b> = </b> لنقل العناصر لأعلى أو لأسفل.
bn: UML সিনট্যাক্স অনুযায়ী গণনা আক্ষরিক যোগ করুন এবং সম্পাদনা করুন। • <tt>enum</tt> সম্পাদনা করতে <b>Enter</b> টিপুন, <b>Backspace</b>/<b>মুছুন</b> আইটেমগুলি সরাতে। আইটেমগুলি উপরে বা নীচে সরাতে <b>-</b>/<b>=</b> ব্যবহার করুন।
ca: Afegeix i edita literals d'enumeració segons la sintaxi UML. • <tt>enum</tt> Premeu <b>Enter</b> per editar, <b>Retrocés</b>/<b>Suprimeix</b> per eliminar elements. Utilitzeu <b>-</b>/<b>=</b> per moure els elements amunt o avall.
cs: Přidávání a úprava výčtových literálů podle syntaxe UML. - <tt>enum</tt> Stiskněte <b>Enter</b> pro úpravu, <b>Backspace</b>/<b>Delete</b> pro odstranění položek. Pomocí <b>-</b>/<b>=</b> přesunete položky nahoru nebo dolů.
fi: Lisää ja muokkaa numeraatioliteraaaleja UML-syntaksin mukaan. • <tt>enum</tt> Paina <b>Syötä</b> muokataksesi, <b>askelpalautin</b>/<b>Delete</b> poistaa kohteita. Käytä <b>-</b>/<b>=</b> siirtääksesi kohteita ylös tai alas.
fr: Ajoutez et modifiez l'énumération littérales selon la syntaxe UML. • <tt>enum</tt> Appuyez sur <b>Entrée</b> pour modifier, <b>Retour arrière</b>/<b>Supprimer</b> pour supprimer des éléments. Utilisez <b>-</b>/<b>=</b> pour déplacer des éléments vers le haut ou vers le bas.
hi: UML वाक्यविन्यास के अनुसार गणना अक्षर जोड़ें और संपादित करें। • <tt>enum</tt> संपादित करने के लिए <b>Enter</b> दबाएं, आइटम हटाने के लिए <b>Backspace</b>/<b>Delete</b> दबाएं। आइटम को ऊपर या नीचे ले जाने के लिए <b>-</b>/<b>=</b> का उपयोग करें।
hr: Dodaj i uredi elemente nabrajanja u skladu s UML sintaksom. • <tt>enum</tt> Pritisni <b>Enter</b> za uređivanje, <b>Backspace</b>/<b>Delete</b> za uklanjanje elemenata. Koristi <b>-</b>/<b>=</b> za premještanje elemenata prema gore ili dolje.
id: Tambahkan dan edit literal enumerasi sesuai dengan sintaks UML. • <tt>enum</tt> Tekan <b>Enter</b> untuk mengedit, <b>Backspace</b>/<b>Delete</b> untuk menghapus item. Gunakan <b>-</b>/<b>=</b> untuk memindahkan item ke atas atau ke bawah.
it: Aggiungi e modifica i letterali di enumerazioni secondo la sintassi UML. • <tt>enum</tt> Premi <b>Enter</b> per modificare, <b>Backspace</b>/<b>Delete</b> per rimuovere gli elementi. Usa <b>-</b>/<b>=</b> per spostare gli elementi su o giù.
ja: UML 構文に従って列挙リテラルを追加および編集します。 • <tt>列挙</tt> <b>Enter</b>を押して編集し、<b>バックスペース</b>/<b>削除</b>を押してアイテムを削除します。 <b>-</b>/<b>=</b>を使用して、アイテムを上下に移動します。
ko: UML 구문에 따라 열거 문자 용 문자용을 추가하고 편집합니다. • <tt></tt> <b>Enter</b>를 눌러 편집하고, <b>백스페이스</b>/<b>삭제</b>를 눌러 항목을 제거합니다. <b>-</b>/<b>=</b>를 사용하여 항목을 위 또는 아래로 이동합니다.
nl: Enumeratie literals volgens de UML syntax. • <tt>enum</tt> Druk <b>Enter</b> om te wijzigen, <b>Backspace</b>/<b>Delete</b> om items te verwijderen. Gebruik <b>-</b>/<b>=</b> om items naar boven of beneden te verplaatsen.
pt_br: Adicione e edite literais de enumeração de acordo com a sintaxe UML. • <tt>enum</tt> Pressione <b>Enter</b> para editar, <b>Backspace</b>/<b>Delete</b> para remover itens. Use <b>-</b>/<b>=</b> para mover itens para cima ou para baixo.
ru: Добавляйте и изменяйте значения перечисления в соответствии с синтаксисом UML. • <tt>перечисление</tt> Нажмите <b>Enter</b> для редактирования, <b>Backspace</b>/<b>Delete</b> для удаления элементов. Используйте <b>-</b>/<b>=</b> для перемещения элементов вверх и вниз.
sv: Lägg till och redigera uppräkningslittergrannerna enligt UML-syntaxen. • <tt>enum</tt> Tryck på <b>Enter</b> för att redigera <b>Backsteg</b>/<b>Delete</b> för att ta bort objekt. Använd <b>-</b>/<b>=</b> för att flytta objekt uppåt eller nedåt.
tr: UML sözdizimine göre numaralandırma sabit değerleri ekleyin ve düzenleyin. • <tt>enum</tt> Düzenlemek için <b>Enter</b>ʼa basın, Ögeleri kaldırmak için <b>Geri Sil</b>/<b>Sil</b>ʼe basın. Öğeleri yukarı veya aşağı taşımak için <b>-</b>/<b>=</b> kullanın.
uk: Додавайте та редагуйте літерали перерахування відповідно до синтаксису UML. • <tt>enum</tt> Натисніть <b>Enter</b>, щоб редагувати, <b>Backspace</b>/<b>Delete</b>, щоб видалити елементи. Використовуйте <b>-</b>/<b>=</b>, щоб перемістити елементи вгору або вниз.

source: Show Enumeration Literals
ar: إظهار التعداد الحرفي
bn: গণনার আক্ষরিক বিষয়গুলি দেখান
ca: Mostra les literalitats de l'enumeració
cs: Zobrazit výčtové literály
fi: Näytä enumeraation literaalit
fr: Afficher les énumérations littérales
hi: गणना अक्षर दिखाएं
hr: Prikaži elemente nabrajanja
id: Tampilkan Literasi Pencacahan
it: Mostra letterali di enumerazioni
ja: 列挙リテラルの表示
ko: 열거 문자 표시
nl: Opsommings­tekens tonen
pt_br: Mostrar Literais de Enumeração
ru: Показывать Значения
sv: Visa uppräkningslitteraler
tr: Numaralandırma Sabit Değerlerini Göster
uk: Показати літерали перерахування

source: Indirectly Instantiated
ar: تم تجسيدها بشكل غير مباشر
bn: পরোক্ষভাবে তাত্ক্ষণিক
ca: Instanciació indirecta
cs: Nepřímo instanční
fi: Epäsuorasti luotu ilmentymä
fr: Instancié indirectement
hi: अप्रत्यक्ष रूप से तात्कालिक
hr: Indirektno izrađeno
id: Instansiasi Secara Tidak Langsung
it: Istanziato indirettamente
ja: 間接的にインスタンス化
ko: 간접 초기화
nl: Indirect Geïnstantieerd
pt_br: Instanciado Indiretamente
ru: Косвенный Экземпляр
sv: Indirekt instansierad
tr: Dolaylı Örneklenen
uk: Опосередковано створений

source: Deployments
cs: Nasazení
fi: Käyttöönotot
fr: Déploiements
hi: तैनाती
hr: Implementacije
it: Implementazioni
nl: Implementaties
ru: Реализация
tr: Dağıtım
uk: Розгортання

source: device
ar: جهاز
bn: ডিভাইস
ca: dispositiu
cs: zařízení
fi: laite
fr: dispositif
hi: उपकरण
hr: uređaj
id: perangkat
it: dispositivo
ja: デバイス
ko: 장치
nl: apparaat
pt_br: dispositivo
ru: устройство
sv: apparat
tr: aygıt
uk: пристрій

source: New Image
fi: Uusi kuva
fr: Nouvelle Image
hr: Nova slika
it: Nuova immagine
nl: Nieuwe Afbeelding
ru: Новое изображение
uk: Нове зображення

source: General
ar: عام
bn: সাধারণ
cs: Obecné
fi: Yleiset
fr: Général
hi: सामान्य
hr: Opće
id: Umum
it: Generali
ja: 全般
ko: 일반
nl: Algemeen
pt_br: Geral
ru: Общее
sv: Allmänt
tr: Genel
uk: Загальний

source: Pointer
ar: المؤشر
bn: নির্দেশক
ca: Punter
cs: Ukazatel
fi: Osoitin
fr: Pointeur
hi: सूचक
hr: Pokazivač
id: penunjuk
it: Puntatore
ja: ポインタ
ko: 점
nl: Aanwijzer
pt_br: Ponteiro
ru: Указатель
sv: Pekare
tr: İmleç
uk: Покажчик

source: Line
ar: خط
bn: লাইন
ca: Línia
cs: Řádek
fi: Viiva
fr: Ligne
hi: रेखा
hr: Crta
id: Garis
it: Linea
ja: 線
ko: 선
nl: Lijn
pt_br: Linha
ru: Линия
sv: Linje
tr: Çizgi
uk: Лінія

source: Box
ar: صندوق
bn: বাক্স
ca: Caixa
fi: Boksi
fr: Boîte
hi: बॉक्स
hr: Okvir
id: Kotak
it: Scatola
ja: 箱
ko: 상자
nl: Rechthoek
pt_br: Caixa
ru: Контейнер
sv: Låda
tr: Kutu
uk: Коробка

source: Ellipse
ar: الشكل البيضاوي
bn: উপবৃত্তাকার
ca: Eŀlipsi
cs: Elips
fi: Ellipsi
hi: दीर्घवृत्त
hr: Elipsa
id: Elips
it: Ellisse
ja: 楕円
ko: 직사각형
nl: Ellips
pt_br: Elipse
ru: Эллипс
sv: Ellips
tr: Elips
uk: Еліпс

source: Comment
ar: تعليق
bn: মন্তব্য
ca: Comentari
cs: Komentář
fi: Kommentti
fr: Commentaire
hi: टिप्पणी
hr: Komentar
id: Komentar
it: Commento
ja: コメント
ko: 설명
nl: Opmerking
pt_br: Comentário
ru: Комментарий
sv: Kommentar
tr: Yorum
uk: Коментар

source: Comment line
ar: سطر التعليق
bn: মন্তব্য লাইন
ca: Línia de comentari
cs: Řádek komentáře
fi: Kommenttirivi
fr: Ligne de commentaire
hi: टिप्पणी पंक्ति
hr: Redak komentara
id: Baris komentar
it: Riga di commento
ja: コメント行
ko: 설명줄
nl: Commentaarlijn
pt_br: Linha de comentário
ru: Линия к комментарию
sv: Kommentarrad
tr: Yorum satırı
uk: Рядок коментаря

source: Diagram metadata
cs: Metadata diagramu
fi: Kaavion metatieto
fr: Diagramme de Méta-data
hi: आरेख मेटाडेटा
hr: Metapodaci dijagrama
it: Metadati diagramma
nl: Diagram-metagegevens
pt_br: Metadados do diagrama
ru: Метаданные диаграммы
tr: Diyagram üst verisi
uk: Метадані діаграми

source: Picture
fi: Kuva
fr: Image
hi: तस्वीर
hr: Slika
it: Immagine
nl: Afbeelding
pt_br: Imagem
ru: Изображение
tr: Resim
uk: Малюнок

source: Select a picture...
fi: Valitse kuva…
fr: Sélectionner une image...
hi: एक चित्र चुनें…
hr: Odaberi jednu sliku …
it: Seleziona un'immagine...
nl: Afbeelding selecteren…
pt_br: Selecionar uma imagem...
ru: Выбрать изображение...
tr: Resim seç...
uk: Виберіть картинку...

source: Unable to parse picture “{filename}”.
fi: Ei voi jäsentää kuvaa “{filename}”.
fr: Impossible d'analyser l'image "{filename}".
hi: चित्र “{filename}” विश्लेषित करने में असमर्थ।
hr: Neuspjela obrada slike „{filename}”.
it: Impossibile analizzare l'immagine “{filename}”.
nl: Kon afbeelding ‘{filename}’ niet parsen.
pt_br: Não foi possível analisar a imagem “{filename}”.
ru: Не удалось проанализировать изображение «{filename}».
tr: “{filename}” resmi ayrıştırılamadı.
uk: Неможливо проаналізувати зображення “{filename}”.

source: call()
ar: يتصل()
bn: কল()
ca: trucada()
fr: appel()
hr: poziv()
id: panggilan()
ja: 呼び出し()
ko: 전화()
nl: aanroepen()
pt_br: chamada()
ru: вызов()
sv: samtal()

source: Interactions
ar: التفاعلات
bn: মিথস্ক্রিয়া
ca: Interaccions
cs: Interakce
fi: Interaktiot
hi: इंटरैक्शन
hr: Interakcije
id: Interaksi
it: Interazioni
ja: 相互 作用
ko: 상호작용
nl: Interacties
pt_br: Interações
ru: Взаимодействия
sv: Interaktioner
tr: Etkileşimler
uk: Взаємодії

source: Lifeline
ar: شريان الحياة
bn: লাইফলাইন
ca: Línia de vida
fi: Elämänlanka
fr: Ligne de vie
hi: जीवनचक्र
hr: Crta života
id: Garis hidup
ja: 命綱
ko: 생명선
nl: Reddingslijn
pt_br: Linha de vida
ru: Линия жизни
sv: Livslinje
tr: Yaşam çizgisi
uk: Лінійка життя

source: Execution Specification
ar: مواصفات التنفيذ
bn: এক্সিকিউশন স্পেসিফিকেশন
ca: Especificació d'execució
cs: Specifikace provedení
fi: Suorituspesifikaatio
fr: Spécification d'exécution
hi: निष्पादन विनिर्देश
hr: Specifikacija izvršavanja
id: Spesifikasi Eksekusi
it: Specifica di esecuzione
ja: 実行仕様
ko: 실행 명세
nl: Uitvoeringsspecificatie
pt_br: Especificação de Execução
ru: Спецификация Исполнения
sv: Specifikation för körning
tr: Çalıştırma Teknik Özellikleri
uk: Специфікація виконання

source: Message
ar: رسالة
bn: বার্তা
ca: Missatge
cs: Zpráva
fi: Viesti
hi: संदेश
hr: Poruka
id: Pesan
it: Messaggio
ja: メッセージ
ko: 메시지
nl: Bericht
pt_br: Mensagem
ru: Сообщение
sv: Meddelande
tr: ileti
uk: Повідомлення

source: Reflexive message
ar: رسالة انعكاسية
bn: রিফ্লেক্সিভ বার্তা
ca: Missatge reflexiu
cs: Reflexivní zpráva
fi: Refleksiivinen viesti
fr: Message réflexif
hi: प्रतिवर्ती संदेश
hr: Refleksivna poruka
id: Pesan refleksif
it: Messaggio riflessivo
ja: 再帰メッセージ
ko: 반사 메시지
nl: Reflexief bericht
pt_br: Mensagem reflexiva
ru: Рефлексивное сообщение
sv: Reflexivt meddelande
tr: Dönüşlü ileti
uk: Рефлексивне повідомлення

source: Message Sort
ar: فرز الرسائل
bn: বার্তা বাছাই
ca: Ordenació del missatge
cs: Třídění zpráv
fi: Viestien lajittelu
fr: Tri des messages
hi: संदेश छांटें
hr: Razvrstavanje poruka
id: Sortir Pesan
it: Ordinamento dei messaggi
ja: メッセージの並べ替え
ko: 메시지 정렬
nl: Berichtsortering
pt_br: Classificação de mensagens
ru: Сортировка Сообщений
sv: Sortera meddelande
tr: İleti Sıralaması
uk: Сортування повідомлень

source: Call
fi: Kutsu
fr: Appel
hi: कॉल
hr: Poziv
it: Chiamata
nl: Aanroepen
pt_br: Chamada
ru: Вызов
tr: Çağrı
uk: Телефонуйте

source: Asynchronous
fi: Asynkroninen
fr: Asynchrone
hi: अतुल्यकालिक
hr: Asinkrono
it: Asincrono
nl: Asynchroon
pt_br: Assíncrona
ru: Асинхронный
tr: Eşzamansız
uk: Асинхронний

source: Reply
fi: Vastaa
fr: Répondre
hi: जवाब
hr: Odgovori
it: Risposta
nl: Antwoord
pt_br: Resposta
ru: Ответить
tr: Yanıt
uk: Відповісти

source: Create
fi: Luo
fr: Créer
hi: बनाएं
hr: Stvori
it: Crea
nl: Aanmaken
pt_br: Criação
ru: Создать
tr: Oluştur
uk: Створити

source: Delete
ar: حذف
bn: বিলোপ
ca: Esborrar
fi: Poista
fr: Supprimer
hi: मिटाएं
hr: Izbriši
id: Menghapus
it: Elimina
ja: 削除
ko: 삭제
nl: Verwijderen
pt_br: Exclusão
ru: Удалить
sv: Ta bort
tr: Sil
uk: Видалити

source: Connectable Element
fi: Yhdistettävä elementti
fr: Élément connectable
hi: जोड़ने-योग्य तत्व
hr: Poveziv element
it: Elemento collegabile
nl: Verbindbaar element
pt_br: Elemento Conectável
ru: Новый подключаемый элемент
tr: Bağlanabilir Öge
uk: Підключається елемент

source: import
ar: يستورد
bn: আমদানি
ca: importació
fi: tuo
fr: importer
hi: आयात करें
hr: uvoz
id: impor
it: importa
ja: 輸入
ko: 수입
nl: importeren
pt_br: Importa
ru: импорт
tr: içe aktar
uk: імпорт

source: Profiles
ar: مظهر
bn: প্রোফাইলগুলি
ca: Perfils
cs: Profily
fi: Profiilit
hi: प्रोफाइल
hr: Profili
id: Profil
it: Profili
ja: プロファイル
ko: 프로파일(복수)
nl: Profielen
pt_br: Perfis
ru: Профили
sv: Profiler
tr: Profiller
uk: Профілі

source: Metaclass
ar: ميتاكلاس
bn: মেটাক্লাস
ca: Metaclasse
cs: Metatřída
fi: Metaluokka
fr: Méta-classe
hi: मेटाक्लास
hr: Metaklasa
id: kelas meta
it: Metaclasse
ja: メタクラス
ko: 메타클래스
nl: Meta-klasse
pt_br: Metaclasse
ru: Метакласс
sv: Metaklass
tr: Üstsınıf
uk: Метаклас

source: Extension
ar: إطالة
bn: বর্ধিতাংশ
ca: Extensió
cs: Rozšíření
fi: Laajennus
hi: एक्सटेंशन
hr: Proširenje
id: Perpanjangan
it: Estensione
ja: 延長
ko: 확장
nl: Uitbreiding
pt_br: Extensão
ru: Расширение
sv: Förlängning
tr: Uzantı
uk: Розширення

source: Import
ar: يستورد
bn: আমদানি
ca: Importació
cs: Importovat
fi: Tuonti
fr: Importer
hi: आयात करें
hr: Uvoz
id: Impor
it: Importa
ja: 輸入
ko: 가져오기
nl: Importeren
pt_br: Importar
ru: Импорт
tr: İçe Aktar
uk: Імпорт

source: Show Stereotypes
ar: عرض القوالب النمطية
bn: স্টেরিওটাইপগুলি দেখান
ca: Mostra els estereotips
cs: Zobrazit stereotypy
fi: Näytä stereotyypit
fr: Afficher les stéréotypes
hi: स्टीरियोटाइप दिखाएं
hr: Prikaži stereotipe
id: Tampilkan Stereotip
it: Mostra stereotipi
ja: ステレオタイプを表示する
ko: 이중형 표시
nl: Stereotypen tonen
pt_br: Mostrar Estereótipos
ru: Показать Стереотипы
sv: Visa stereotyper
tr: Stereotipleri Göster
uk: Показати стереотипи

source: New Slot Value…
fi: Uusi liittimen arvo…
fr: Nouvelle Valeur du Slot…
hi: नया स्लॉट मान…
hr: Nova „slot” vrijednost …
it: Nuovo slot di valore…
nl: Nieuwe slot­waarde…
pt_br: Novo valor do slot…
ru: Новое значение слота…
tr: Yeni Yuva Değeri…
uk: Нове значення слота…

source: Activities
ar: أنشطة
bn: ক্রিয়াকলাপসমূহ
ca: Activitats
cs: Činnosti
fi: Aktiviteetit
fr: Activités
hi: गतिविधियां
hr: Aktivnosti
id: Kegiatan
it: Attività
ja: 活動
ko: 활동
nl: Activiteiten
pt_br: Atividades
ru: Деятельности
sv: Verksamhet
tr: Etkinlikler
uk: Діяльністі

source: Entry
ar: دخول
bn: প্রবেশকার্য
ca: Entrada
cs: Položka
fi: Sisään
fr: Entrée
hi: प्रवेश
hr: Ulaz
id: Pintu masuk
it: Entrata
ja: エントリ
ko: 항목
nl: Ingang
pt_br: Entrada
ru: Вход
sv: Inträde
tr: Girdi
uk: Вхід

source: Exit
ar: مخرج
bn: প্রস্থান
ca: Sortida
cs: Odejít
fi: Ulos
fr: Sortie
hi: निकास
hr: Izlaz
id: keluar
it: Uscita
ja: 出口
ko: 퇴장
nl: Uitgang
pt_br: Sair
ru: Выход
sv: Utgång
tr: Çıkış
uk: Вихід

source: Do activity
fi: Tee-aktiviteetti
fr: Faire une activité
hi: गतिविधियां निष्पादित करें
hr: Izvrši aktivnost
it: Fai attività
nl: Activiteit uitvoeren
pt_br: Fazer a atividade
ru: Выполнить деятельность
tr: Etkinlik yap
uk: Виконуйте дії

source: Trigger
fi: Laukaise
fr: Déclencheur
hr: Pokretač
it: Innesco
ru: Триггер
uk: Тригер

source: Regions
cs: Regiony
fi: Alueet
fr: Régions
hi: क्षेत्र
hr: Regije
it: Regioni
nl: Gebieden
pt_br: Regiões
ru: Регионы
tr: Bölgeler
uk: Регіони

source: Show Regions
cs: Zobrazit regiony
fi: Näytä alueet
fr: Montrer les Régions
hi: क्षेत्र दिखाएं
hr: Prikaži regije
it: Mostra regioni
nl: Regio's tonen
pt_br: Mostrar Regiões
ru: Показать Регионы
tr: Bölgeleri Göster
uk: Показати регіони

source: statemachine
cs: státní stroj
fi: tilakone
fr: état machine
hi: मशीनअवस्था
hr: automat konačnih stanja
nl: staatmachine
pt_br: máquinaestado
ru: конечный автомат
tr: durummakinesi
uk: державна машина

source: State
ar: ولاية
bn: অবস্থা
ca: Estat
cs: Stát
fi: Tila
fr: État
hi: अवस्था
hr: Stanje
id: Negara
it: Stato
ja: 状態
ko: 상태
nl: Staat
pt_br: Estado
ru: Состояние
sv: Stat
tr: Durum
uk: Держава
