Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Head:
ar: رأس:
bn: মাথা:
ca: Cap:
cs: Vedoucí:
fi: Pää:
fr: Entête :
hi: शीर्ष:
hr: Glava:
id: Kepala:
it: Intestazione:
ja: 頭：
ko: 머리:
nl: Kop:
pt_br: Cabeça:
ru: Голова:
sv: Huvud:
tr: Baş:
uk: Голова:

source: Add and edit association ends according to UML syntax. • <tt>+ name</tt> • <tt>+ name[1]</tt> • <tt>- name[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Press <b>Enter</b> to edit, <b>Backspace</b>/<b>Delete</b> to remove items. Use <b>-</b>/<b>=</b> to move items up or down.
ar: تنتهي إضافة وتحرير الاقتران وفقًا لبنية UML. • <tt> + الاسم </tt> • <tt> + الاسم [1] </tt> • <tt> - الاسم [1..2] </tt> • <tt> 1..2 </tt> • <tt> - [1..2] </tt> اضغط على <b> أدخل </b> للتعديل ، <b> مسافة للخلف </b> / <b> احذف </b> لإزالة العناصر. استخدم <b> - </b> / <b> = </b> لنقل العناصر لأعلى أو لأسفل.
bn: ইউএমএল সিনট্যাক্স অনুযায়ী এসোসিয়েশন যোগ করুন এবং সম্পাদনা করুন। • <tt>+ নাম</tt> • <tt>+ নাম[১][X৯৩X] • <tt>- নাম[১..২]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> সম্পাদনা করতে <b>Enter</b> টিপুন, <b>ব্যাকস্পেস</b>/<b>মুছুন</b> আইটেমগুলি সরাতে। আইটেমগুলি উপরে বা নীচে সরাতে <b>-</b>/<b>=</b> ব্যবহার করুন।
ca: Afegeix i edita l'associació acaba segons la sintaxi UML. • <tt>+ nom</tt> • <tt>+ nom[1]</tt> • <tt>- nom[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Premeu <b>Enter</b> per editar, <b>Retrocés</b>/<b>Suprimeix</b> per eliminar elements. Utilitzeu <b>-</b>/<b>=</b> per moure els elements amunt o avall.
cs: Přidávání a úprava konců asociací podle syntaxe UML. - <tt>+ název</tt> - <tt>+ name[1]</tt> - <tt>- name[1..2]</tt> - <tt>1..2</tt> - <tt>- [1..2]</tt> Stiskněte <b>Enter</b> pro úpravu, <b>Backspace</b>/<b>Delete</b> pro odstranění položek. Pomocí <b>-</b>/<b>=</b> přesunete položky nahoru nebo dolů.
fi: Lisää ja muokkaa liitospäätteitä UML-syntaksin mukaan. • <tt>+ nimi</tt> • <tt>+ nimi[1]</tt> • <tt>- nimi[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Paina <b>Syötä</b> muokataksesi, <b>askelpalautin</b>/<b>Delete</b> poistaa kohteita. Käytä <b>-</b>/<b>=</b> siirtääksesi kohteita ylös tai alas.
fr: Ajouter et modifier les fins d'association conformément à la syntaxe UML. • <tt>+ name</tt> • <tt>+ name[1]</tt> • <tt>- name[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Appuyer sur <b>Entrée</b> pour modifier, <b>Retour arrière</b>/<b>Suppr.</b> pour supprimer des éléments. Utiliser <b>-</b>/<b>=</b> pour déplacer les éléments plus haut ou plus bas.
hi: UML वाक्यविन्यास के अनुसार संबद्धता अंत जोड़ें और संपादित करें। • <tt>+ name</tt> • <tt>+ name[1]</tt> • <tt>- name[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> संपादित करने के लिए <b>Enter</b> दबाएं, आइटम हटाने के लिए <b>Backspace</b>/<b>Delete</b> दबाएं। आइटम को ऊपर या नीचे ले जाने के लिए <b>-</b>/<b>=</b> का उपयोग करें।
hr: Dodaj i uredi krajeve veza u skladu s UML sintaksom. • <tt>+ ime</tt> • <tt>+ ime[1]</tt> • <tt>- ime[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Pritisni <b>Enter</b> za uređivanje, <b>Backspace</b>/<b>Delete</b> za uklanjanje elemenata. Koristi <b>-</b>/<b>=</b> za premještanje elemenata prema gore ili dolje.
id: Tambah dan edit asosiasi berakhir sesuai dengan sintaks UML. • <tt>+ nama</tt> • <tt>+ nama[1]</tt> • <tt>- nama[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Tekan <b>Enter</b> untuk mengedit, <b>Backspace</b>/<b>Delete</b> untuk menghapus item. Gunakan <b>-</b>/<b>=</b> untuk memindahkan item ke atas atau ke bawah.
it: Aggiungi e modifica l'estremità dell'associazione secondo la sintassi UML. • <tt>+ name</tt> • <tt>+ name[1]</tt> • <tt>- name[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Premi <b>Enter</b> per modificare, <b>Backspace</b>/<b>Delete</b> per rimuovere gli elementi. Usa <b>-</b>/<b>=</b> per spostare gli elementi su o giù.
ja: UML 構文に従って、関連付けの追加と編集の終了を行います。 •<tt>+名前</tt> • <tt>+名前[1]</tt> •<tt>- 名前[1.2]</tt> • <tt> 1..2 </tt> •<tt>-[1..2]</tt> <b>Enter</b>を押して編集し、<b>バックスペース</b>/<b>削除</b>アイテムを削除します。 <b>-</b>/<b>=</b>を使用して、アイテムを上下に移動します。
ko: UML 구문에 따라 연결을 추가하고 편집합니다. • <tt>+ 이름</tt> • 【X80X】+ 이름[1]</tt> • <tt>- 이름[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> <b>Enter</b>를 눌러 편집하고, <b>백스페이스</b>/<b>삭제</b>를 눌러 항목을 제거합니다. <b>-</b>/<b>=</b>를 사용하여 항목을 위 또는 아래로 이동합니다.
nl: Association ends volgens de UML syntax. • <tt>+ naam</tt> • <tt>+ naam[1]</tt> • <tt>- naam[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Druk <b>Enter</b> om te wijzigen, <b>Backspace</b>/<b>Delete</b> om items te verwijderen. Gebruik <b>-</b>/<b>=</b> om items naar boven of beneden te verplaatsen.
pt_br: Adicione e edite extremidades da associação de acordo com a sintaxe UML. • <tt>+ nome</tt> • <tt>+ nome[1]</tt> • <tt>- nome[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Pressione <b>Enter</b> para editar, <b>Backspace</b>/<b>Delete</b> para remover itens. Use <b>-</b>/<b>=</b> para mover itens para cima ou para baixo.
ru: Добавляйте и редактируйте концы ассоциаций в соответствии с синтаксисом UML. • <tt>+ имя</tt> • <tt>+ имя[1]</tt> • <tt>- имя[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Нажмите <b>Enter</b> для редактирования, <b>Backspace</b>/<b>Delete</b> для удаления элементов. Используйте <b>-</b>/<b>=</b> для перемещения элементов вверх и вниз.
sv: Lägg till och redigera association slutar enligt UML-syntaxen. • <tt>+ namn</tt> • <tt>+ namn[1]</tt> • <tt>- namn[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Tryck på <b>Enter</b> för att redigera ,<b>Backsteg</b>/<b>Delete</b> för att ta bort objekt. Använd <b>-</b>/<b>=</b> för att flytta objekt uppåt eller nedåt.
tr: İlişkilendirme uçlarını UML sözdizimine göre ekleyin ve düzenleyin. • <tt>+ name</tt> • <tt>+ name[1]</tt> • <tt>- name[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Düzenlemek için <b>Enter</b>ʼa basın, Ögeleri kaldırmak için <b>Geri Sil</b>/<b>Sil</b>ʼe basın. Öğeleri yukarı veya aşağı taşımak için <b>-</b>/<b>=</b> kullanın.
uk: Додавання та редагування кінців асоціації відповідно до синтаксису UML. • <tt>+ ім'я</tt> • <tt>+ ім'я[1]</tt> • <tt>- назва[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Натисніть <b>Enter</b>, щоб редагувати, <b>Backspace</b>/<b>Delete</b>, щоб видалити елементи. Використовуйте <b>-</b>/<b>=</b>, щоб перемістити елементи вгору або вниз.

source: Unknown navigation
ar: تنقل غير معروف
bn: অজানা নেভিগেশন
ca: Navegació desconeguda
cs: Neznámá navigace
fi: Tuntematon navigaatio
fr: Navigation inconnue
hi: अज्ञात नेविगेशन
hr: Nepoznata dostupnost
id: Navigasi tidak diketahui
it: Navigazione sconosciuta
ja: 不明なナビゲーション
ko: 알 수 없는 탐색
nl: Onbekende navigeerbaar­heid
pt_br: Navegação desconhecida
ru: Неизвестная навигация
sv: Okänd navigering
tr: Bilinmeyen gezinim
uk: Невідома навігація

source: Not navigable
ar: غير صالح للملاحة
bn: নাব্যতাযোগ্য নয়
ca: No navegable
cs: Nesplavné
fi: Ei navigoitavissa
fr: Non navigable
hi: नौगम्य नहीं
hr: Nedostupno
id: Tidak dapat dinavigasi
it: Non navigabile
ja: 航行不可
ko: 탐색불가
nl: Niet navigeerbaar
pt_br: Não navegável
ru: Не навигационный
sv: Inte farbar
tr: Gezinilemez
uk: Не судноплавний

source: Navigable
ar: صالح للملاحة
bn: নাব্যতাযোগ্য
ca: Navegable
cs: Splavné
fi: Navigoitavissa
hi: नौगम्य
hr: Dostupno
id: dapat dinavigasi
it: Navigabile
ja: 可 航
ko: 탐색가능
nl: Navigeerbaar
pt_br: Navegável
ru: Навигационный
sv: Farbar
tr: Gezinilebilir
uk: Судноплавний

source: Stereotypes
ar: الأفكار النمطية
bn: স্টেরিওটাইপগুলি
ca: Estereotips
cs: Stereotypy
fi: Stereotyypit
fr: Stéréotypes
hi: टकसाली
hr: Stereotipi
id: Stereotip
it: Stereotipi
ja: ステレオタイプ
ko: 이중형
nl: Stereotypen
pt_br: Estereótipos
ru: Стереотипы
sv: Stereotyper
tr: Stereotipler
uk: Стереотипи

source: Values
fi: Arvot
fr: Valeurs
hi: मान
hr: Vrijednosti
it: Valori
nl: Waarden
pt_br: Valores
ru: Значения
tr: Değerler
uk: Цінності

source: Tail:
ar: ذيل:
bn: লেজ:
ca: Cua:
cs: Ocas:
fi: Häntä:
fr: Queue :
hi: पीछे का भाग:
hr: Rep:
id: Ekor:
it: Estremità:
ja: 尾：
ko: 꼬리:
nl: Staart:
pt_br: Cauda:
ru: Хвост:
sv: Svans:
tr: Kuyruk:
uk: Хвіст:

source: Attributes
ar: صفات
bn: গুণমানসমূহ
ca: Atributs
cs: Atributy
fi: Attribuutit
fr: Attributs
hi: विशेषताएं
hr: Svojstva
id: Atribut
it: Attributi
ja: 属性
ko: 속성(복수)
nl: Attributen
pt_br: Atributos
ru: Атрибуты
sv: Attribut
tr: Öznitelikler
uk: Атрибути

source: Add and edit class attributes according to UML syntax. • <tt>attr</tt> (name, defaults to public visibility) • <tt>+ attr: int</tt> (public with type) • <tt>+ attr: int[0..1]</tt> (public, type, and multiplicity) • <tt>+ attr: int | bool</tt> (public, union type) • <tt># /attr: int # a note</tt> (protected, derived, with remark) Press <b>Enter</b> to edit, <b>Backspace</b>/<b>Delete</b> to remove items. Use <b>-</b>/<b>=</b> to move items up or down.
cs: Přidávat a upravovat atributy tříd podle syntaxe UML. - <tt>attr</tt> (název, výchozí hodnota je public visibility) - <tt>+ attr: int</tt> (veřejný s typem) - <tt>+ attr: int[0..1]</tt> (public, typ a násobnost) - <tt>+ attr: int | bool</tt> (veřejný, typ unie) - <tt># /attr: int # a note</tt> (chráněný, odvozený, s poznámkou) Stiskněte <b>Enter</b> pro úpravu, <b>Backspace</b>/<b>Delete</b> pro odstranění položek. Pomocí <b>-</b>/<b>=</b> přesunete položky nahoru nebo dolů.
fi: Lisää ja muokkaa luokan attribuutteja UML-syntaksin mukaan. • <tt>attr</tt> (nimi, oletusarvoisesti julkinen näkyvyys) • <tt>+ attr: int</tt> (julkinen ja tyyppi) • <tt>+ attr: int[0..1]</tt> (julkinen, tyyppi ja moninkertaisuus) • <tt>+ attr: int | bool</tt> (julkinen, ammattiliittotyyppi) • <tt># /attr: int # huomautus</tt> (suojattu, johdettu, huomautuksen kanssa) Paina <b>Syötä</b> muokataksesi, <b>askelpalautin</b>/<b>Delete</b> poistaa kohteita. Käytä <b>-</b>/<b>=</b> siirtääksesi kohteita ylös tai alas.
fr: Ajouter et modifier les attributs de la classe conformément à la syntaxe UML. • <tt>attr</tt> (nom, par défaut en visibilité publique) • <tt>+ attr: int</tt> (publique avec un type) • <tt>+ attr: int[0..1]</tt> (publique, type, et multiplicité) • <tt>+ attr: int | bool</tt> (public, union type) • <tt># /attr: int # a note</tt> (protégé, dérivé, avec remarques) Appuyer sur <b>Entrée</b> pour modifier, <b>Retour arrière</b>/<b>Suppr.</b> pour supprimer des éléments. Utiliser <b>-</b>/<b>=</b> pour déplacer les éléments plus haut ou plus bas.
hi: UML वाक्यविन्यास के अनुसार वर्ग विशेषताओं को जोड़ें और संपादित करें। • <tt>attr</tt> (नाम, तयशुदा रूप से सार्वजनिक दृश्यता) • <tt>+ attr: int</tt> (प्रकार के साथ सार्वजनिक) • <tt>+ attr: int[0..1]</tt> (सार्वजनिक, प्रकार, और बहुलता) • <tt>+ attr: int | bool</tt> (सार्वजनिक, संघ प्रकार) • <tt># /attr: int # a note</tt> (संरक्षित, व्युत्पन्न, टिप्पणी के साथ) संपादित करने के लिए <b>Enter</b> दबाएं, आइटम हटाने के लिए <b>Backspace</b>/<b>Delete</b> दबाएं। आइटम को ऊपर या नीचे ले जाने के लिए <b>-</b>/<b>=</b> का उपयोग करें।
hr: Dodaj i uredi svojstva klasa u skladu s UML sintaksom. • <tt>attr</tt> (ime, zadano za javnu vidljivost) • <tt>+ attr: int</tt> (javno s vrstom) • <tt>+ attr: int[0..1]</tt> (javno, vrsta i mnogostrukost) • <tt>+ attr: int | bool</tt> • <tt># /attr: int # nota</tt> (zaštićeno, izvedeno, s napomenom) Pritisni <b>Enter</b> za uređivanje, <b>Backspace</b>/<b>Delete</b> za uklanjanje elemenata. Koristi <b>-</b>/<b>=</b> za premještanje elemenata prema gore ili dolje.
it: Aggiungi e modifica gli attributi della classe secondo la sintassi UML. • <tt>attr</tt> (nome, di base la visibilità è pubblica) • <tt>+ attr: int</tt> (pubblico con tipo) • <tt>+ attr: int[0..1]</tt> (pubblico, tipo, e cardinalità) • <tt>+ attr: int | bool</tt> (pubblico, tipo di unione) • <tt># /attr: int # a note</tt> (protetto, derivato, con remark) Premi <b>Enter</b> per modificare, <b>Backspace</b>/<b>Delete</b> per rimuovere gli elementi. Usa <b>-</b>/<b>=</b> per spostare gli elementi su o giù.
nl: Klasse attributen volgens de UML syntax. • <tt>attr</tt> (naam, standaard publieke zichtbaarheid) • <tt>+ attr: int</tt> (publiek met type) • <tt>+ attr: int[0..1]</tt> (publiek, type, en multiplicity) • <tt>+ attr: int | bool</tt> (publiek, union type) • <tt># /attr: int # a note</tt> (beschermd, afgeleid, met opmerking) Druk <b>Enter</b> om te wijzigen, <b>Backspace</b>/<b>Delete</b> om items te verwijderen. Gebruik <b>-</b>/<b>=</b> om items naar boven of beneden te verplaatsen.
pt_br: Adicione ou edite atributos da classe de acordo com a sintaxe UML. • <tt>atributo</tt> (nome, usa como padrão a visibilidade pública) • <tt>+ atributo: int</tt> (público com tipo) • <tt>+ atributo: int[0..1]</tt> (público, tipo e multiplicidade) • <tt>+ atributo: int | bool</tt> (público, tipo união) • <tt># /atributo: int # uma nota</tt> (protegido, derivado, com observação) Pressione <b>Enter</b> para editar, <b>Backspace</b>/<b>Delete</b> para remover itens. Use <b>-</b>/<b>=</b> para mover itens para cima ou para baixo.
ru: Добавляйте и изменяйте атрибуты класса в соответствии с синтаксисом UML. • <tt>атрибут</tt> (имя, по умолчанию публичная видимость) • <tt>+ атрибут: int</tt> (публичный с типом) • <tt>+ атрибут: int[0..1]</tt> (публичный, тип, множественность) • <tt>+ атрибут: int | bool</tt> (публичный, тип - объединение) • <tt># /атрибут: int # пометка</tt> (защищённый, производный, с пометкой) Нажмите <b>Enter</b> для редактирования, <b>Backspace</b>/<b>Delete</b> для удаления элементов. Используйте <b>-</b>/<b>=</b> для перемещения элементов вверх и вниз.
tr: UML sözdizimine göre sınıf niteliklerini ekleyin ve düzenleyin. • <tt>attr</tt> (ad, public görümüne varsayılan) • <tt>+ attr: int</tt> (tür ile public) • <tt>+ attr: int[0..1]</tt> (public, tür, ve çeşitlilik) • <tt>+ attr: int | bool</tt> (public, union türü) • <tt># /attr: int # bir not</tt> (protected, derived, not ile) Düzenlemek için <b>Enter</b>ʼa basın, Ögeleri kaldırmak için <b>Geri Sil</b>/<b>Sil</b>ʼe basın. Öğeleri yukarı veya aşağı taşımak için <b>-</b>/<b>=</b> kullanın.
uk: Додавайте та редагуйте атрибути класу відповідно до синтаксису UML. • <tt>attr</tt> (ім'я, за замовчуванням загальнодоступний) • <tt>+ attr: int</tt> (публічний із типом) • <tt>+ attr: int[0..1]</tt> (публічний, тип і множинність) • <tt>+ attr: int | bool</tt> (публічний, тип об'єднання) • <tt># /attr: int # примітка</tt> (захищена, похідна, із зауваженням) Натисніть <b>Enter</b>, щоб редагувати, <b>Backspace</b>/<b>Delete</b>, щоб видалити елементи. Використовуйте <b>-</b>/<b>=</b>, щоб перемістити елементи вгору або вниз.

source: ReadOnly
fi: Vain luku
fr: LectureSeulement
hr: Samo za čitanje
nl: Alleen lezen
ru: Только для чтения
uk: Тільки для читання

source: Static
ar: ثابتة
bn: স্থির
ca: Estàtic
cs: Statické
fi: Staattinen
fr: Statique
hi: स्थिर
hr: Statički
id: Statis
it: Statica
ja: 静的
ko: 정적
nl: Statisch
pt_br: Estático
ru: Статический
sv: Statisk
tr: Sabit
uk: Статичний

source: Show Attributes
ar: إظهار السمات
bn: বৈশিষ্ট্যসমূহ প্রদর্শন করুন
ca: Mostra els atributs
cs: Zobrazit atributy
fi: Näytä attribuutit
fr: Afficher les attributs
hi: विशेषताएं दिखाएं
hr: Prikaži svojstva
id: Tampilkan Atribut
it: Mostra Attributi
ja: 属性の表示
ko: 속성 표시
nl: Attributen tonen
pt_br: Mostrar Atributos
ru: Показывать Атрибуты
sv: Visa attribut
tr: Öznitelikleri Göster
uk: Показати атрибути

source: Abstract
ar: الملخص
bn: বিমূর্ত
ca: Resum
cs: Abstraktní
fi: Abstrakti
fr: Résumé
hi: सार
hr: Apstrakt
id: Abstrak
it: Astratta
ja: 要約
ko: 추상
pt_br: Abstrato
ru: Абстрактный
sv: Abstrakt
tr: Soyut
uk: Анотація

source: Final specialization
fi: Lopullinen erikoistuminen
fr: Spécialisation finale
hr: Završna specijalizacija
it: Specializzazione finale
nl: Finale Specificatie
ru: Итоговая специализация
uk: Підсумкова спеціалізація

source: Source:
fi: Lähde:
hr: Izvor:
it: Fonte:
nl: Bron:
ru: Источник:
uk: Джерело:

source: Target:
fi: Kohde:
fr: Cible :
hr: Cilj:
it: Obbiettivo:
nl: Doel:
ru: Цель:
uk: Цільова:

source: Dependency type
ar: نوع التبعية
bn: নির্ভরতার ধরণ
ca: Tipus de dependència
cs: Typ závislosti
fi: Riippuvuuden tyyppi
fr: Type de dépendance
hi: निर्भरता प्रकार
hr: Vrsta ovisnosti
id: Jenis ketergantungan
it: Tipo dipendenza
ja: 依存関係の種類
ko: 의존 형식
nl: Afhankelijkheidstype
pt_br: Tipo de dependência
ru: Тип зависимости
sv: Beroendetyp
tr: Bağımlılık türü
uk: Тип залежності

source: Automatic
ar: تلقائي
bn: স্বয়ংক্রিয়
ca: Automàtic
cs: Automatický
fi: Automaattinen
fr: Automatique
hi: स्वचालित
hr: Automatski
id: Otomatis
it: Automatico
ja: 自動
ko: 자동
nl: Automatisch
pt_br: Automático
ru: Автоматический
sv: Automatisk
tr: Kendiliğinden
uk: Автоматичний

source: Usage
ar: إستعمال
bn: ব্যবহার
ca: Ús
cs: Použití
fi: Käyttö
fr: Utilisation
hi: उपयोग
hr: Korištenje
id: Penggunaan
it: Uso
ja: 使い
ko: 사용법
nl: Gebruik
pt_br: Uso
ru: Использование
sv: Användning
tr: Kullanım
uk: Використання

source: Realization
ar: ادراك
bn: উপলব্ধি
ca: Realització
cs: Realizace
fi: Realisaatio
fr: Réalisation
hi: कार्यान्वयन
hr: Realizacija
id: Realisasi
it: Realizzazione
ja: 実現
ko: 실체화
nl: Realisatie
pt_br: Realização
ru: Реализация
sv: Förverkligande
tr: Gerçekleştirme
uk: Реалізація

source: Implementation
ar: التنفيذ
bn: বাস্তবায়ন
ca: Implementació
cs: Implementace
fi: Implementaatio
fr: Implémentation
hi: कार्यान्वयन
hr: Implementacija
id: Penerapan
it: Implementazione
ja: 実装
ko: 구현
nl: Implementatie
pt_br: Implementação
ru: Имплементация
sv: Genomförande
tr: Uygulama
uk: Імплементація

source: Folded
ar: مطوي
bn: ভাঁজ করা
ca: Plegat
cs: Složené
fi: Taitettu
fr: Plié
hi: तह
hr: Sklopljeno
id: dilipat
it: Piegato
ja: 折り返さ
ko: 접힘
nl: Opgevouwen
pt_br: Dobrada
ru: Свёрнуто
sv: Vikta
tr: Katlanmış
uk: Складений

source: Operations
ar: عمليات
bn: কার্যক্রম
ca: Operacions
cs: Operace
fi: Operaatiot
fr: Opérations
hi: अभियान
hr: Operacije
id: Operasi
it: Operazioni
ja: オペレーションズ
ko: 동작
nl: Handelingen
pt_br: Operações
ru: Методы
sv: Verksamhet
tr: İşlemler
uk: Операції
