Repository: gaphor/gaphor
Catalog: po/*.po
Languages: ar, bn, ca, cs, fi, fr, hi, hr, id, it, ja, ko, nl, pt_br, ru, sv, tr, uk

source: Add a model element from the tool box to the diagram. Here you will see it's properties appear. This pane can be hidden by clicking the pane icon in the header. <b>Tip:</b> Most elements in the toolbox have a keyboard shortcut (e.g. "c" for Class). Tool selection only works from the diagram. If a tool does not get selected, click on the diagram once (so it's focused) and then hit the shortcut key. <b>Tip:</b> To search for an element in the tree view, select an element in the tree view and start typing. A search box will automatically appear.
ar: أضف عنصر نموذج من مربع الأدوات إلى الرسم التخطيطي. هنا سترى خصائصه تظهر. يمكن إخفاء هذا الجزء بالنقر فوق رمز الجزء في الرأس. <b> نصيحة: </b> تحتوي معظم العناصر في صندوق الأدوات على اختصار لوحة مفاتيح (مثل "c" للفئة). اختيار الأداة يعمل فقط من الرسم التخطيطي. إذا لم يتم تحديد الأداة ، فانقر فوق الرسم التخطيطي مرة واحدة (بحيث يكون مركزًا) ثم اضغط على مفتاح الاختصار. <b> نصيحة: </b> للبحث عن عنصر في عرض الشجرة ، حدد عنصرًا في عرض الشجرة وابدأ في الكتابة. سيظهر مربع البحث تلقائيًا.
bn: চিত্রে সরঞ্জাম বাক্স থেকে একটি মডেল উপাদান যোগ করুন। এখানে আপনি দেখতে পাবেন যে এটির বৈশিষ্ট্যগুলি প্রদর্শিত হবে। শিরোলেখের পেন আইকনে ক্লিক করে এই ফলকটি লুকানো যেতে পারে। <b> টিপ:</b> টুলবক্সের বেশিরভাগ উপাদানের একটি কীবোর্ড শর্টকাট থাকে (যেমন ক্লাসের জন্য "সি")। টুল নির্বাচন শুধুমাত্র ডায়াগ্রাম থেকে কাজ করে। যদি কোনও সরঞ্জাম নির্বাচিত না হয় তবে একবার ডায়াগ্রামে ক্লিক করুন (তাই এটি ফোকাস করা হয়েছে) এবং তারপরে শর্টকাট কীটি আঘাত করুন। <b> টিপ:</b> ট্রি ভিউতে একটি উপাদান অনুসন্ধান করতে, ট্রি ভিউতে একটি উপাদান নির্বাচন করুন এবং টাইপ করা শুরু করুন। একটি অনুসন্ধান বাক্স স্বয়ংক্রিয়ভাবে উপস্থিত হবে।
ca: Afegeix un element model des del quadre d'eines al diagrama. Aquí veureu que apareixen les seves propietats. Aquesta subfinestra es pot amagar fent clic a la icona de la subfinestra de la capçalera. <b> Consell:</b> La majoria dels elements de la caixa d'eines tenen una drecera de teclat (per exemple, "c" per a Classe). La selecció d'eines només funciona des del diagrama. Si una eina no se selecciona, feu clic al diagrama una vegada (de manera que estigui enfocada) i, a continuació, premeu la tecla de drecera. <b> Consell:</b> Per cercar un element a la vista d'arbre, seleccioneu un element a la vista d'arbre i comenceu a escriure. Apareixerà automàticament un quadre de cerca.
id: Tambahkan elemen model dari kotak alat ke diagram. Di sini Anda akan melihat propertinya muncul. Panel ini dapat disembunyikan dengan mengklik ikon panel di header. <b>Tip:</b> Sebagian besar elemen di kotak alat memiliki pintasan keyboard (mis. "c" untuk Kelas). Pemilihan alat hanya bekerja dari diagram. Jika alat tidak dipilih, klik diagram sekali (jadi fokus) lalu tekan tombol pintas. <b>Kiat:</b> Untuk mencari elemen dalam tampilan hierarki, pilih elemen dalam tampilan hierarki dan mulailah mengetik. Sebuah kotak pencarian akan muncul secara otomatis.
ja: ツール ボックスから図にモデル要素を追加します。ここには、プロパティが表示されます。 このウィンドウは、ヘッダーのウィンドウ アイコンをクリックして非表示にすることができます。 <b>ヒント:</b> ツールボックスのほとんどの要素にはキーボードショートカットがあります(例えばクラスの"c")。 ツールの選択は、ダイアグラムからのみ機能します。ツールが選択されない場合は、図を 1 回クリックして (フォーカスが設定されています)、ショートカット キーを押します。 <b>ヒント:</b> ツリービューで要素を検索するには、ツリービューで要素を選択して入力を開始します。検索ボックスが自動的に表示されます。
ko: 도구 상자의 모델 항목을 다이어그램에 추가합니다. 여기서 속성이 나타나는걸 보실 수 있습니다. 이 창은 헤더의 연필 아이콘을 누르면 숨길 수 있습니다. <b>팁:</b> 도구 상자 대부분의 항목은 키보드 바로 가기 키를 가지고 있습니다(예: 클래스의 "c") 도구 선택은 다이어그램에서만 동작합니다. 그럼에도 불구하고 선택을 못할 경우 다이어그램을 한 번 더 누르고(포커스를 준 후) 단축키를 치십시오. <b>팁:</b> 트리뷰의 항목을 검색하려면, 트리뷰의 항목을 선택한 후 입력을 시작하십시오. 검색 상자가 자동으로 나타납니다.
sv: Lägg till ett modellelement från verktygslådan i diagrammet. Här ser du att dess egenskaper visas. Det här fönstret kan döljas genom att klicka på fönsterikonen i sidhuvudet. <b> Tips:</b> De flesta element i verktygslådan har ett kortkommando (t.ex. "c" för klass). Verktygsval fungerar bara från diagrammet. Om ett verktyg inte blir markerat klickar du på diagrammet en gång (så det är fokuserat) och trycker sedan på kortkommandot. <b> Tips:</b> Om du vill söka efter ett element i trädvyn markerar du ett element i trädvyn och börjar skriva. En sökruta visas automatiskt.

source: Editors
ar: المحررين
bn: সম্পাদকগণ
id: editor
ja: エディター
ko: 편집기
sv: Redaktörer

source: 🔗 <a href="https://gaphor.readthedocs.io/en/latest/style_sheets.html">Style sheets in Gaphor</a>
ar: 🔗 <a href="https://gaphor.readthedocs.io/en/latest/style_sheets.html"> أوراق الأنماط في Gaphor </a>
bn: 🔗 <a href="https://gaphor.readthedocs.io/en/latest/style_sheets.html">গ্যাফরের স্টাইল শীট</a>
ca: 🔗 <a href="https://gaphor.readthedocs.io/en/latest/style_sheets.html">Fulls d'estil a Gaphor</a>
id: <a href="https://gaphor.readthedocs.io/en/latest/style_sheets.html">Style sheet dalam Gaphor</a>
ja: 🔗 <a href="https://gaphor.readthedocs.io/en/latest/style_sheets.html">ガソースタイルシート</a>
ko: 🔗 <a href="https://gaphor.readthedocs.io/en/latest/style_sheets.html">가포 스타일 시트</a>
sv: 🔗 <a href="https://gaphor.readthedocs.io/en/latest/style_sheets.html">Formatmallar i Gaphor</a>

source: Settings
ar: إعدادات
bn: সেটিংস
ca: Configuració
id: Pengaturan
ja: 設定
ko: 설정
sv: Inställningar

source: Start debug session
ar: ابدأ جلسة التصحيح
bn: ডিবাগ সেশন শুরু করুন
ca: Inicia la sessió de depuració
id: Mulai sesi debug
ja: デバッグ セッションを開始します。
ko: 디버깅 세션 시작
sv: Starta felsökningssessionen

source: Save changes before closing?
ar: حفظ التغييرات قبل الإغلاق؟
bn: বন্ধ করার আগে পরিবর্তনগুলি সংরক্ষণ করবেন?
ca: Voleu desar els canvis abans de tancar-los?
id: Simpan perubahan sebelum ditutup?
ja: 閉じる前に変更を保存しますか?
ko: 닫기 전에 변경 내용을 저장?
sv: Vill du spara ändringar innan du stänger?

source: Closing will cause any unsaved changes to be discarded.
ar: سيؤدي الإغلاق إلى تجاهل أي تغييرات غير محفوظة.
bn: বন্ধ করার ফলে যে কোনও অসংরক্ষিত পরিবর্তন পরিত্যাগ করা হবে।
ca: El tancament provocarà que es desin els canvis no desats.
id: Menutup akan menyebabkan perubahan yang belum disimpan dibuang.
ja: 閉じると、保存されていない変更は破棄されます。
ko: 닫히면 저장되지 않은 변경 내용이 삭제됩니다.
sv: Om du stänger kommer alla ändringar som inte har stängts att ignoreras.

source: Close _without saving changes
ar: إغلاق _ دون حفظ التغييرات
bn: পরিবর্তনগুলি সংরক্ষণ _without বন্ধ করুন
ca: Tanca _without desant els canvis
id: Tutup _tanpa menyimpan perubahan
ja: 変更を保存_without閉じる
ko: 변경 사항을 _without 닫기
sv: Stäng _without spara ändringar

source: Create New Model…
ar: إنشاء نموذج جديد …
bn: নতুন মডেল তৈরি করুন…
ca: Crea un model nou…
id: Buat Model Baru…
ja: 新しいモデルを作成します。
ko: 새 모델 만들기…
sv: Skapa ny modell…

source: Open Other Model…
ar: فتح نموذج آخر …
bn: অন্যান্য মডেল খুলুন…
ca: Obre un altre model…
id: Buka Model Lain…
ja: 他のモデルを開きます。
ko: 다른 모델 열기…
sv: Öppna annan modell…

source: Create a New Model
ar: قم بإنشاء نموذج جديد
bn: একটি নতুন মডেল তৈরি করুন
ca: Crear un nou model
id: Buat Model Baru
ja: 新しいモデルを作成する
ko: 새 모델 만들기
sv: Skapa en ny modell

source: Open a Recent Model
ar: افتح نموذجًا حديثًا
bn: একটি সাম্প্রতিক মডেল খুলুন
ca: Obrir un model recent
id: Buka Model Terbaru
ja: 最近使用したモデルを開く
ko: 최근 모델 열기
sv: Öppna en ny modell

source: Recent Model…
ar: الطراز الأخير …
bn: সাম্প্রতিক মডেল…
ca: Model recent…
id: Model Terbaru…
ja: 最近のモデル.
ko: 최근 모델…
sv: Senaste modell…

source: Open Existing Model…
ar: فتح النموذج الحالي …
bn: বিদ্যমান মডেল খুলুন…
ca: Obre el model existent…
id: Buka Model yang Ada…
ja: 既存のモデルを開きます。
ko: 기존 모델 열기…
sv: Öppna befintlig modell…

source: Gaphor
ar: غافور
bn: গ্যাফার
ca: Cavall de buit
id: Gafor
ja: ガファー
ko: 가포

source: Create New diagram
ar: إنشاء رسم تخطيطي جديد
bn: নতুন ডায়াগ্রাম তৈরি করুন
ca: Crea un diagrama nou
id: Buat diagram baru
ja: 新しい図の作成
ko: 새 다이어그램 만들기
sv: Skapa nytt diagram

source: Open Application Menu
ar: افتح قائمة التطبيق
bn: অ্যাপ্লিকেশন মেনু খুলুন
ca: Obre el menú de l'aplicació
id: Buka Menu Aplikasi
ja: アプリケーション メニューを開く
ko: 응용 프로그램 메뉴 열기
sv: Öppna programmenyn

source: Recent Models…
ar: أحدث الموديلات …
bn: সাম্প্রতিক মডেল…
ca: Models recents…
id: Model Terbaru…
ja: 最近のモデル.
ko: 최근 모델…
sv: De senaste modellerna…

source: New Generic Diagram
ar: رسم تخطيطي عام جديد
bn: নতুন জেনেরিক ডায়াগ্রাম
ca: Diagrama genèric nou
id: Diagram Generik Baru
ja: 新しい汎用ダイアグラム
ko: 새 일반 다이어그램
sv: Nytt generiskt diagram

source: edited
ar: تم تحريره
bn: সম্পাদনা
ca: Editat
id: diedit
ja: 編集
ko: 편집함
sv: redigerad

source: Profile: {}
ar: الملف الشخصي: {}
bn: প্রোফাইল: {}
ca: Perfil: {}
id: Profil: {}
ja: プロファイル: {}
ko: 프로파일: {}
sv: Profil: {}

source: {name} package
ar: حزمة {name}
bn: {name} প্যাকেজ
ca: Paquet {name}
id: {name} paket
ja: {name} パッケージ
ko: {name} 패키지
sv: {name} paket

source: New diagram
ar: رسم تخطيطي جديد
bn: নতুন ডায়াগ্রাম
ca: Diagrama nou
id: diagram baru
ja: 新しい図
ko: 새 다이어그램
sv: Nytt diagram

source: A {} can’t be part of a {}.
ar: لا يمكن أن يكون {} جزءًا من {}.
bn: একটি {} {}-এর অংশ হতে পারে না।
ca: Un {} no pot formar part d'un {}.
id: {} tidak bisa menjadi bagian dari {}.
ja: {} を {} の一部にすることはできません。
ko: {}은(는) {}의 일부일 수 없습니다.
sv: {} kan inte vara en del av en {}.

source: SysML
ja: システムズム

source: UML
bn: ইউএমএল
