Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: Add a profile element to the diagram
fr: Ajouter un élément de profil au diagramme
ta: வரைபடத்தில் சுயவிவர உறுப்பைச் சேர்க்கவும்
uk: Додайте до схеми елемент профілю

source: Add a meta-class element to the diagram, within the profile.
fr: Ajouter un élément de méta-classe au diagramme, dans le profil.
ta: சுயவிவரத்திற்குள் வரைபடத்தில் ஒரு மெட்டா-வகுப்பு உறுப்பைச் சேர்க்கவும்.
uk: Додайте елемент метакласу до діаграми в межах профілю.

source: Add a stereotype element to the diagram, within the profile.
fr: Ajouter un élément de stéréotype au diagramme, dans le profil.
ta: சுயவிவரத்திற்குள் வரைபடத்தில் ஒரு ச்டீரியோடைப் உறுப்பைச் சேர்க்கவும்.
uk: Додайте елемент стереотипу до діаграми в межах профілю.

source: Connect meta-class and stereotype with an Extension relation. The head should be attached to the class. As soon as the Extension is connected, the class will get a stereotype _metaclass_ assigned.
fr: Relier la méta-classe et le stéréotype à l'aide d'une relation d'extension. La tête doit être attachée à la classe. Dès que l'extension est connectée, un stéréotype _metaclass_ est attribué à la classe.
ta: நீட்டிப்பு உறவோடு மெட்டா-வகுப்பு மற்றும் ச்டீரியோடைப்பை இணைக்கவும். தலை வகுப்போடு இணைக்கப்பட வேண்டும். நீட்டிப்பு இணைக்கப்பட்டவுடன், வகுப்பிற்கு ஒரு ச்டீரியோடைப் _metaclass_ ஒதுக்கப்படும்.
uk: З’єднайте мета-клас і стереотип із відношенням розширення. Голову слід прикріпити до класу. Як тільки розширення буде підключено, класу буде призначено стереотип _metaclass_.

source: With the meta-class and stereotype placed on the diagram, either:
fr: Avec la méta-classe et le stéréotype placés sur le diagramme, soit :
ta: வரைபடத்தில் வைக்கப்பட்டுள்ள மெட்டா-வகுப்பு மற்றும் ச்டீரியோடைப் மூலம்:
uk: З мета-класом і стереотипом, розміщеними на діаграмі, або:

source: Double-click the meta-class and name it after the base element you want to create your stereotype from.
fr: Double-cliquez sur la méta-classe et donnez-lui le nom de l'élément de base à partir duquel vous souhaitez créer votre stéréotype.
ta: மெட்டா-கிளாசை இருமுறை சொடுக்கு செய்து, உங்கள் ச்டீரியோடைப்பை உருவாக்க விரும்பும் அடிப்படை உறுப்புக்குப் பிறகு பெயரிடுங்கள்.
uk: Двічі клацніть мета-клас і назвіть його за базовим елементом, з якого ви хочете створити свій стереотип.

source: Select the base element from the drop down menu in the Property Editor on the right hand side. In this case only UML elements can be used as base elements.
fr: Sélectionnez l'élément de base dans le menu déroulant de l'éditeur de propriétés situé à droite. Dans ce cas, seuls les éléments UML peuvent être utilisés.
ta: வலது புறத்தில் உள்ள சொத்து எடிட்டரில் கீழ்தோன்றும் மெனுவிலிருந்து அடிப்படை உறுப்பைத் தேர்ந்தெடுக்கவும். இந்த வழக்கில் யுஎம்எல் கூறுகளை மட்டுமே அடிப்படை கூறுகளாகப் பயன்படுத்த முடியும்.
uk: Виберіть базовий елемент зі спадного меню в редакторі властивостей праворуч. У цьому випадку лише елементи UML можна використовувати як базові елементи.

source: Styling Stereotypes
fr: Stéréotypes stylistiques
ta: ச்டைலிங் ச்டீரியோடைப்கள்
uk: Стереотипи стилю

source: You can apply styling to stereotypes. For example here the base element `requirement` has a stereotype `system requirement`
fr: Vous pouvez appliquer un style aux stéréotypes. Par exemple ici, l'élément de base `requirement` (exigence) a un stéréotype `system requirement` (exigence sytème)
ta: ச்டீரியோடைப்களுக்கு ச்டைலிங் பயன்படுத்தலாம். எடுத்துக்காட்டாக இங்கே அடிப்படை உறுப்பு `தேவை` ஒரு ச்டீரியோடைப்` கணினி தேவை` உள்ளது
uk: До стереотипів можна застосувати стилізацію. Наприклад, базовий елемент «вимога» має стереотип «системна вимога»

source: [Style Sheets](style_sheets) has more detail on how CSS works in Gaphor
fr: [Feuilles de style](style_sheets) contient plus de détails sur le fonctionnement des feuilles de style CSS dans Gaphor
ta: [Style Sheets](style_sheets) has more detail on how சிஎச்எச் works in Gaphor
uk: [Таблиці стилів](style_sheets) містить більше деталей про те, як CSS працює в Gaphor

source: File Format
es: Formato de archivo
fr: Format de fichier
ta: கோப்பு வடிவம்
uk: Формат файлу

source: The root element of Gaphor models is the `Gaphor` tag, all other elements are contained in this. The Gaphor element delimits the beginning and the end of an Gaphor model.
es: El elemento raíz de los modelos Gaphor es la etiqueta `Gaphor`, todos los demás elementos están contenidos en ella. El elemento Gaphor delimita el principio y el final de un modelo Gaphor.
fr: L'élément racine des modèles Gaphor est la balise `Gaphor`, qui contient tous les autres éléments. L'élément Gaphor délimite le début et la fin d'un modèle Gaphor.
ta: கஃபர் மாதிரிகளின் மூல உறுப்பு `கஃபர்` குறிச்சொல் ஆகும், மற்ற அனைத்து கூறுகளும் இதில் உள்ளன. கஃபர் உறுப்பு ஒரு காஃபர் மாதிரியின் தொடக்கத்தையும் முடிவையும் வரையறுக்கிறது.
uk: Кореневим елементом моделей Gaphor є тег `Gaphor`, усі інші елементи містяться в ньому. Елемент Gaphor розмежовує початок і кінець моделі Gaphor.

source: The idea is to keep the file format as simple and extensible as possible: UML elements (including Diagram) are at the top level with no nesting. A UML element can have two tags: references (`ref`) and values (`val`). References are used to point to other UML elements. Values have a value inside (an integer or a string).
es: La idea es mantener el formato de archivo tan simple y extensible como sea posible: Los elementos UML (incluido el diagrama) están en el nivel superior sin anidamiento. Un elemento UML puede tener dos etiquetas: referencias (`ref`) y valores (`val`). Las referencias se usan para apuntar a otros elementos UML. Los valores tienen un valor en su interior (un entero o una cadena).
fr: L'idée est de garder le format de fichier aussi simple et extensible que possible : Les éléments UML (y compris le diagramme) sont au niveau supérieur, sans imbrication. Un élément UML peut avoir deux balises : références (`ref`) et valeurs (`val`). Les références sont utilisées pour pointer vers d'autres éléments UML. Les valeurs ont une valeur à l'intérieur (un entier ou une chaîne).
ta: கோப்பு வடிவமைப்பை முடிந்தவரை எளிமையாகவும் நீட்டிக்கக்கூடியதாகவும் வைத்திருப்பது யோசனை: யுஎம்எல் கூறுகள் (வரைபடம் உட்பட) கூடு இல்லாத மேல் மட்டத்தில் உள்ளன. ஒரு யுஎம்எல் உறுப்பு இரண்டு குறிச்சொற்களைக் கொண்டிருக்கலாம்: குறிப்புகள் (`ref`) மற்றும் மதிப்புகள் (` வால்`). மற்ற யுஎம்எல் கூறுகளை சுட்டிக்காட்ட குறிப்புகள் பயன்படுத்தப்படுகின்றன. மதிப்புகள் உள்ளே ஒரு மதிப்பைக் கொண்டுள்ளன (ஒரு முழு எண் அல்லது ஒரு சரம்).
uk: Ідея полягає в тому, щоб зробити формат файлу максимально простим і розширюваним: Елементи UML (включаючи діаграму) знаходяться на верхньому рівні без вкладеності. Елемент UML може мати два теги: посилання (`ref`) і значення (`val`). Посилання використовуються для вказівки на інші елементи UML. Значення мають всередині значення (ціле число або рядок).

source: Since many references are bi-directional, you'll find both ends defined in the file (e.g. `Package.ownedType` - `Actor.package`, and `Diagram.ownedPresentation` and `UseCaseItem.diagram`).
es: Dado que muchas referencias son bidireccionales, encontrarás ambos extremos definidos en el fichero (p. ej., `Package.ownedType` - `Actor.package`, y `Diagram.ownedPresentation` y `UseCaseItem.diagram`).
fr: Comme de nombreuses références sont bidirectionnelles, vous trouverez les deux extrémités définies dans le fichier (par exemple, `Package.ownedType` - `Actor.package`, et `Diagram.ownedPresentation` et `UseCaseItem.diagram`).
ta: பல குறிப்புகள் இரு திசைகளாக இருப்பதால், கோப்பில் வரையறுக்கப்பட்ட இரண்டு முனைகளையும் நீங்கள் காணலாம் (எ.கா.
uk: Оскільки багато посилань є двонаправленими, ви знайдете обидва кінці, визначені у файлі (наприклад, `Package.ownedType` - `Actor.package`, а також `Diagram.ownedPresentation` і `UseCaseItem.diagram`).

source: Style Sheets
es: Hojas de estilo
fr: Feuilles de style
ta: பாணி தாள்கள்
uk: Таблиці стилів

source: Since Gaphor 2.0, diagrams can have a different look by means of style sheets. Style sheets use the Cascading Style Sheets (CSS) syntax. CSS is used to describe the presentation of a document written in a markup language, and is most commonly used with HTML for web pages.
es: Desde Gaphor 2.0, los diagramas pueden tener un aspecto diferente mediante hojas de estilo. Las hojas de estilo usan la sintaxis Cascading Style Sheets (CSS). CSS se usa para describir la presentación de un documento escrito en un lenguaje de marcado, y se usa más comúnmente con HTML para páginas web.
fr: Depuis Gaphor 2.0, il est possible d'obtenir une apparence différente des diagrammes grâce aux feuilles de style. Ces feuilles de style utilisent la syntaxe des feuilles de style en cascade (CSS). CSS est utilisé pour décrire la présentation d'un document écrit dans un langage de balisage, et est le plus souvent utilisé avec HTML pour les pages web.
ta: காஃபர் 2.0 என்பதால், வரைபடங்கள் பாணி தாள்கள் மூலம் வேறுபட்ட தோற்றத்தைக் கொண்டிருக்கலாம். பாணி தாள்கள் அடுக்கு பாணி தாள்கள் (சிஎச்எச்) தொடரியல் பயன்படுத்துகின்றன. மார்க்அப் மொழியில் எழுதப்பட்ட ஆவணத்தின் விளக்கக்காட்சியை விவரிக்க சிஎச்எச் பயன்படுத்தப்படுகிறது, மேலும் இது பொதுவாக வலைப்பக்கங்களுக்கு உஉகுமொ உடன் பயன்படுத்தப்படுகிறது.
uk: Починаючи з Gaphor 2.0, діаграми можуть мати інший вигляд за допомогою таблиць стилів. Таблиці стилів використовують синтаксис каскадних таблиць стилів (CSS). CSS використовується для опису представлення документа, написаного мовою розмітки, і найчастіше використовується з HTML для веб-сторінок.

source: On the [W3C CSS home page](https://www.w3.org/Style/CSS/Overview.en.html), CSS is described as:
es: En la [página principal de CSS del W3C](https://www.w3.org/Style/CSS/Overview.en.html), CSS se describe como:
fr: Sur la [page d'accueil CSS du W3C] (https://www.w3.org/Style/CSS/Overview.en.html), CSS est décrit comme suit :
ta: [W3C சிஎச்எச் முகப்பு பக்கம்] (https://www.w3.org/style/css/overview.en.html) இல், சிஎச்எச் இவ்வாறு விவரிக்கப்பட்டுள்ளது:
uk: На [домашній сторінці W3C CSS] (https://www.w3.org/Style/CSS/Overview.en.html) CSS описано так:

source: Cascading Style Sheets (CSS) is a simple mechanism for adding style (e.g., fonts, colors, spacing) to Web documents.
es: Cascading Style Sheets (CSS) es un mecanismo sencillo para añadir estilo (por ejemplo, fuentes, colores, espaciado) a los documentos web.
fr: Les feuilles de style en cascade (CSS) sont un mécanisme simple permettant d'ajouter du style (par exemple, fonts, colors, spacing) aux documents Web.
ta: அடுக்கு பாணி தாள்கள் (CSS) என்பது வலை ஆவணங்களில் பாணியை (எ.கா., எழுத்துருக்கள், வண்ணங்கள், இடைவெளி) சேர்ப்பதற்கான ஒரு எளிய வழிமுறையாகும்.
uk: Каскадні таблиці стилів (CSS) — це простий механізм додавання стилю (наприклад, шрифтів, кольорів, інтервалів) до веб-документів.

source: Its application goes well beyond web documents, though. Gaphor uses CSS to provide style elements to items in diagrams. CSS allows us, users of Gaphor, to change the visual appearance of our diagrams. Color and line styles can be changed to make it easier to read the diagrams.
es: Pero su aplicación va mucho más allá de los documentos web. Gaphor usa CSS para proporcionar elementos de estilo a los elementos de los diagramas. CSS nos permite, a los usuarios de Gaphor, cambiar el aspecto visual de nuestros diagramas. Se pueden cambiar el color y los estilos de línea para facilitar la lectura de los diagramas.
fr: Son application va cependant bien au-delà des documents web. Gaphor utilise en effet le CSS pour fournir des éléments de style aux éléments des diagrammes. Les CSS nous permettent de modifier l'aspect visuel de nos diagrammes. Il est par exemple possible de modifier les couleurs et les styles de ligne pour faciliter la lecture des diagrammes.
ta: அதன் பயன்பாடு வலை ஆவணங்களுக்கு அப்பாற்பட்டது. வரைபடங்களில் உள்ள உருப்படிகளுக்கு பாணி கூறுகளை வழங்க கஃபர் சிஎச்எச் ஐப் பயன்படுத்துகிறது. சிஎச்எச் எங்கள் வரைபடங்களின் காட்சி தோற்றத்தை மாற்ற, கஃபரின் பயனர்களைப் பயன்படுத்த அனுமதிக்கிறது. வரைபடங்களைப் படிப்பதை எளிதாக்குவதற்கு வண்ணம் மற்றும் வரி பாணிகளை மாற்றலாம்.
uk: Однак його застосування виходить далеко за межі веб-документів. Gaphor використовує CSS для надання елементів стилів елементам на діаграмах. CSS дозволяє нам, користувачам Gaphor, змінювати візуальний вигляд наших діаграм. Стилі кольорів і ліній можна змінювати, щоб полегшити читання діаграм.

source: Since we're dealing with a diagram, and not a HTML document, some CSS features have been left out.
es: Dado que se trata de un diagrama y no de un documento HTML, se han omitido algunas características CSS.
fr: Comme il s'agit d'un diagramme et non d'un document HTML, certaines fonctions CSS ont été laissées de côté.
ta: நாங்கள் ஒரு வரைபடத்துடன் கையாள்வதால், ஒரு உஉகுமொ ஆவணம் அல்ல, சில சிஎச்எச் நற்பொருத்தங்கள் விடப்பட்டுள்ளன.
uk: Оскільки ми маємо справу з діаграмою, а не з HTML-документом, деякі функції CSS були пропущені.

source: The style is part of the model, so everyone working on a model will have the same style. To edit the style press the tools page button at the top right corner in gaphor:
es: El estilo es parte del modelo, por lo que todos los que trabajen en un modelo tendrán el mismo estilo. Para editar el estilo pulse el botón de la página de herramientas en la esquina superior derecha en gaphor:
fr: Le style fait partie du modèle, donc toutes les personnes travaillant sur un modèle auront le même style. Pour modifier le style, appuyez sur le bouton de la page d'outils dans le coin supérieur droit de gaphor :
ta: பாணி மாதிரியின் ஒரு பகுதியாகும், எனவே ஒரு மாதிரியில் பணிபுரியும் அனைவருக்கும் ஒரே பாணியைக் கொண்டிருக்கும். பாணியைத் திருத்த, கஃபரில் மேல் வலது மூலையில் உள்ள கருவிகள் பக்க பொத்தானை அழுத்தவும்:
uk: Стиль є частиною моделі, тому всі, хто працює над моделлю, матимуть однаковий стиль. Щоб редагувати стиль, натисніть кнопку сторінки інструментів у верхньому правому куті в gaphor:

source: ![Button to access style code](images/css-button.png)
es: ![Botón para acceder al código de estilo](images/css-button.png)
fr: ![Bouton pour accéder au code du style](images/css-button.png)
ta: ![பாணி குறியீட்டை அணுக பொத்தான்](images/css-button.png)
uk: ![Кнопка для доступу до коду стилю](images/css-button.png)

source: Button to access style code
es: Botón para acceder al código de estilo
fr: Bouton d'accès au code de style
ta: பாணி குறியீட்டை அணுக பொத்தான்
uk: Кнопка доступу до коду стилю

source: Here is a simple example of how to change the background color of a class:
es: He aquí un ejemplo sencillo de cómo cambiar el color de fondo de una clase:
fr: Voici un exemple simple de modification de la couleur d'arrière-plan d'une classe :
ta: ஒரு வகுப்பின் பின்னணி நிறத்தை எவ்வாறு மாற்றுவது என்பதற்கான எளிய எடுத்துக்காட்டு இங்கே:
uk: Ось простий приклад того, як змінити колір фону класу:

source: background beige
es: fondo beige
fr: fond beige
ta: பின்னணி பழுப்பு
uk: фон бежевий

source: Or change the color of a component, only when it's nested in a node:
es: O cambiar el color de un componente, sólo cuando está anidado en un nodo:
fr: Ou changer la couleur d'un composant, uniquement lorsqu'il est imbriqué dans un nœud :
ta: அல்லது ஒரு கூறுகளின் நிறத்தை மாற்றவும், அது ஒரு முனையில் கூடு கட்டும்போது மட்டுமே:
uk: Або змінити колір компонента, лише якщо він вкладений у вузол:

source: nested component
es: componente anidado
fr: composant imbriqué
ta: உள்ளமைக்கப்பட்ட கூறு
uk: вкладений компонент

source: The diagram itself is also expressed as a CSS node. It's pretty easy to define a "dark" style:
es: El propio diagrama también se expresa como un nodo CSS. Es bastante fácil definir un estilo "oscuro":
fr: Le diagramme lui-même est également exprimé sous la forme d'un nœud CSS. Il est assez facile de définir un style « sombre » :
ta: வரைபடம் ஒரு சிஎச்எச் முனையாகவும் வெளிப்படுத்தப்படுகிறது. "இருண்ட" பாணியை வரையறுப்பது மிகவும் எளிதானது:
uk: Сама діаграма також виражається як вузол CSS. Визначити «темний» стиль досить просто:

source: dark-style
es: estilo-oscuro
fr: style sombre
ta: இருண்ட பாணி
uk: темний стиль

source: Here you already see the first custom attribute: `text-color`. This property allows you to control the color of the text drawn in an item. `color` is used for the lines (strokes) that make the layout of a diagram item.
es: Aquí ya se ve el primer atributo personalizado: `text-color`. Esta propiedad le permite controlar el color del texto dibujado en un elemento. El `color` se usa para las líneas (trazos) que hacen el diseño de un elemento de diagrama.
fr: Ici, vous voyez déjà le premier attribut personnalisé : `text-color`. Cette propriété vous permet de contrôler la couleur du texte dessiné dans un élément. `color` est utilisé pour les lignes (strokes) qui constituent la mise en page d'un élément de diagramme.
ta: இங்கே நீங்கள் ஏற்கனவே முதல் தனிப்பயன் பண்புக்கூறு: `உரை-வண்ணம்`. ஒரு பொருளில் வரையப்பட்ட உரையின் நிறத்தை கட்டுப்படுத்த இந்த சொத்து உங்களை அனுமதிக்கிறது. வரைபட உருப்படியின் தளவமைப்பை உருவாக்கும் வரிகளுக்கு (பக்கவாதம்) `வண்ணம்` பயன்படுத்தப்படுகிறது.
uk: Тут ви вже бачите перший користувацький атрибут: `text-color`. Ця властивість дозволяє керувати кольором тексту, намальованого на елементі. `color` використовується для ліній (штрихів), які складають макет елемента діаграми.

source: Supported selectors
es: Selectores compatibles
fr: Sélecteurs pris en charge
ta: உதவி தேர்வாளர்கள்
uk: Підтримувані селектори

source: Since we are dealing with diagrams and models, we do not need all the features of CSS. Below you'll find a summary of all CSS features supported by Gaphor.
es: Dado que estamos tratando con diagramas y modelos, no necesitamos todas las características de CSS. A continuación encontrarás un resumen de todas las características CSS soportadas por Gaphor.
fr: Étant donné qu'il s'agit de diagrammes et de modèles, nous n'avons pas besoin de toutes les fonctions CSS. Vous trouverez ci-dessous un résumé de toutes les fonctionnalités CSS prises en charge par Gaphor.
ta: நாங்கள் வரைபடங்கள் மற்றும் மாதிரிகள் கையாள்வதால், சிஎச்எச் இன் அனைத்து அம்சங்களும் எங்களுக்கு தேவையில்லை. கஃபர் ஆதரிக்கும் அனைத்து சிஎச்எச் அம்சங்களின் சுருக்கத்தையும் கீழே காணலாம்.
uk: Оскільки ми маємо справу з діаграмами та моделями, нам не потрібні всі функції CSS. Нижче ви знайдете короткий перелік усіх функцій CSS, які підтримує Gaphor.

source: All items on the diagram, including the diagram itself.
es: Todos los elementos del diagrama, incluido el propio diagrama.
fr: Tous les éléments du diagramme, y compris le diagramme lui-même.
ta: வரைபடத்தில் உள்ள அனைத்து உருப்படிகளும் வரைபடம் உட்பட.
uk: Усі елементи на схемі, включаючи саму схему.

source: Any component item which is a descendant of a node.
es: Cualquier elemento componente descendiente de un nodo.
fr: Tout élément de composant descendant d'un nœud.
ta: ஒரு முனையின் வழித்தோன்றல் எந்தவொரு கூறு உருப்படியும்.
uk: Будь-який елемент компонента, який є нащадком вузла.

source: A component item which is a child of a node.
es: Un elemento componente que es hijo de un nodo.
fr: Un élément de composant qui est un enfant d'un nœud.
ta: ஒரு முனை குழந்தையாக இருக்கும் ஒரு கூறு உருப்படி.
uk: Елемент компонента, який є дочірнім елементом вузла.

source: ``generalization[subject]``
ta: ``பொதுமைப்படுத்தல்[பொருள்]``
uk: ``узагальнення[тема]``

source: A generalization item with a subject present.
es: Un elemento de generalización con un sujeto presente.
fr: Un élément de généralisation avec un sujet présent.
ta: தற்போது ஒரு பாடத்துடன் பொதுமைப்படுத்தல் உருப்படி.
uk: Елемент узагальнення з присутнім підметом.

source: ``class[name=Foo]``
es: ``clase[nombre=Foo]``
ta: ``வகுப்பு[பெயர்=பூ]``
uk: ``клас[name=Foo]``

source: A class with name "Foo".
es: Una clase con el nombre "Foo".
fr: Une classe portant le nom "Foo".
ta: "ஃபூ" என்ற பெயருடன் ஒரு வகுப்பு.
uk: Клас з назвою "Foo".

source: ``diagram[name^=draft]``
es: ``diagrama[nombre^=borrador]``
ta: ``வரைபடம்[பெயர்^=வரைவு]``
uk: ``діаграма[name^=draft]``

source: A diagram with a name starting with "draft".
es: Un diagrama cuyo nombre empieza por "borrador".
fr: Un diagramme dont le nom commence par "draft".
ta: "வரைவு" உடன் தொடங்கும் பெயரைக் கொண்ட வரைபடம்.
uk: Діаграма з назвою, що починається на «чернетка».

source: ``diagram[name$=draft]``
es: ``diagrama[nombre$=borrador]``
ta: ``வரைபடம்[பெயர்$=வரைவு]``
uk: ``діаграма[name$=чернетка]``

source: A diagram with a name ends with "draft".
es: Un diagrama con nombre terminado en "borrador".
fr: Un diagramme avec un nom se termine par "draft".
ta: ஒரு பெயரைக் கொண்ட வரைபடம் "வரைவு" உடன் முடிகிறது.
uk: Діаграма з назвою закінчується на «чернетка».

source: ``diagram[name*=draft]``
es: ``diagrama[nombre*=borrador]``
ta: ``வரைபடம்[பெயர்*=வரைவு]``
uk: ``діаграма[назва*=чернетка]``

source: A diagram with a name containing the text "draft".
es: Un diagrama con un nombre que contiene el texto "borrador".
fr: Un diagramme dont le nom contient le texte « draft ».
ta: "வரைவு" என்ற உரையைக் கொண்ட பெயரைக் கொண்ட வரைபடம்.
uk: Діаграма з назвою, що містить текст «чернетка».

source: ``diagram[name~=draft item]``
es: ``diagrama[nombre~=borrador elemento]``
ta: ``வரைபடம்[பெயர்~=வரைவு பொருள்]``
uk: ``діаграма[назва~=чорновий елемент]``

source: A diagram with a name of "draft" or "item".
es: Un diagrama con el nombre "borrador" o "elemento".
fr: Un diagramme dont le nom est "draft" (brouillon) ou "item" (élément).
ta: "வரைவு" அல்லது "உருப்படி" என்ற பெயரைக் கொண்ட வரைபடம்.
uk: Діаграма з назвою «чернетка» або «елемент».

source: ``diagram[name|=draft]``
es: ``diagrama[nombre|=borrador]``
ta: ``வரைபடம்[பெயர்|=வரைவு]``
uk: ``діаграма[назва|=чернетка]``

source: A diagram with a name is "draft" or starts with "draft-".
es: Un diagrama con nombre "borrador" o que empieza por "borrador-".
fr: Un diagramme dont le nom est "draft" (brouillon) ou commence par "draft-".
ta: ஒரு பெயரைக் கொண்ட வரைபடம் "வரைவு" அல்லது "வரைவு-" உடன் தொடங்குகிறது.
uk: Діаграма з назвою "чернетка" або починається з "чернетка-".

source: The focused item. Other pseudo classes are:
es: El elemento enfocado. Otras pseudo clases son:
fr: L'élément focalisé. D'autres pseudo classes sont :
ta: கவனம் செலுத்திய உருப்படி. பிற போலி வகுப்புகள்:
uk: Фокусований елемент. Інші псевдокласи:

source: ``:active`` selected items
es: ``:active`` elementos seleccionados
fr: ``:active`` éléments sélectionnés
ta: ``:active`` தேர்ந்தெடுக்கப்பட்ட உருப்படிகள்
uk: вибрані елементи ``:active``

source: ``:hover`` for the item under the mouse
es: ``:hover`` para el elemento bajo el ratón
fr: ``:hover`` (survol) pour l'élément sous la souris
ta: சுட்டியின் கீழ் உள்ள உருப்படிக்கு ``:hover``
uk: ``:hover`` для елемента під мишею

source: ``:drop`` if an item is dragged and can be dropped on this item
es: ``:drop`` si se arrastra un elemento y se puede soltar sobre este elemento
fr: ``:drop`` (déposé) si un élément est déplacé et peut être déposé sur cet élément
ta: ஒரு உருப்படி இழுக்கப்பட்டு இந்த உருப்படியில் கைவிடப்பட்டால் ``:drop``
uk: ``:drop``, якщо елемент перетягується і може бути скинутий на цей елемент

source: ``:disabled`` if an element is grayed out during handle movement
es: ``:disabled`` si un elemento está en gris durante el movimiento del manejador
fr: ``:disabled`` (désactivé) si un élément est grisé lors du déplacement de la poignée
ta: கைப்பிடி இயக்கத்தின் போது ஒரு உறுப்பு சாம்பல் நிறமாக இருந்தால் ``:disabled``
uk: ``:disabled``, якщо елемент неактивний під час руху ручки

source: A node containing no child nodes in the diagram.
es: Un nodo que no contiene nodos hijos en el diagrama.
fr: Un nœud ne contenant aucun nœud enfant dans le diagramme.
ta: வரைபடத்தில் குழந்தை முனைகள் இல்லாத முனை.
uk: Вузол, який не містить дочірніх вузлів на діаграмі.

source: Refers to the diagram itself.
fr: Se réfère au diagramme lui-même.
ta: வரைபடத்தை குறிக்கிறது.
uk: Посилається на саму діаграму.
