Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: There is also an [Arch User Repository (AUR) for Gaphor](https://aur.archlinux.org/packages/python-gaphor) available for Arch users.
es: También hay un [Arch User Repository (AUR) para Gaphor](https://aur.archlinux.org/packages/python-gaphor) disponible para los usuarios de Arch.
fr: Il existe également un [Arch User Repository (AUR) for Gaphor] (https://aur.archlinux.org/packages/python-gaphor) disponible pour les utilisateurs d'Arch.
ta: ARCH பயனர்களுக்கு KAPHOR க்கு [ARCH பயனர் களஞ்சியம் (AUR)] (https://aur.archlinux.org/packages/pithon-gaphor) உள்ளது.
uk: Існує також [репозиторій користувачів Arch (AUR) для Gaphor](https://aur.archlinux.org/packages/python-gaphor), доступний для користувачів Arch.

source: Please, do not hesitate to contact us if you need help to create a Linux package for Gaphor or Gaphas.
es: No dude en ponerse en contacto con nosotros si necesita ayuda para crear un paquete Linux para Gaphor o Gaphas.
fr: N'hésitez pas à nous contacter si vous avez besoin d'aide pour créer un paquet Linux pour Gaphor ou Gaphas.
ta: தயவுசெய்து, காஃபர் அல்லது காஃபாசிற்கான லினக்ச் தொகுப்பை உருவாக்க உங்களுக்கு உதவி தேவைப்பட்டால் எங்களை தொடர்பு கொள்ள தயங்க வேண்டாம்.
uk: Будь ласка, не соромтеся звертатися до нас, якщо вам потрібна допомога у створенні пакета Linux для Gaphor або Gaphas.

source: Gaphor on macOS
es: Gaphor en macOS
fr: Gaphor sur macOS
ta: மேகோசில் கஃபர்
uk: Gaphor на macOS

source: The latest release of Gaphor can be downloaded from the [Gaphor download page](https://gaphor.org/download#macos). Gaphor can also be installed as a [Homebrew cask](https://formulae.brew.sh/cask/gaphor).
es: La última versión de Gaphor puede descargarse de la [página de descargas de Gaphor](https://gaphor.org/download#macos). Gaphor también puede instalarse como [Homebrew cask](https://formulae.brew.sh/cask/gaphor).
fr: La dernière version de Gaphor peut être téléchargée à partir de la [page de téléchargement de Gaphor] (https://gaphor.org/download#macos). Gaphor peut également être installé en tant que [Homebrew cask] (https://formulae.brew.sh/cask/gaphor).
ta: Gaphor இன் அண்மைக் கால வெளியீட்டை [Kaphor பதிவிறக்கம் பக்கம்] (https://gaphor.org/download#macos) இலிருந்து பதிவிறக்கம் செய்யலாம். Gaphor ஒரு [ஓம்பிரூ காச்க்](https://formulae.brew.sh/cask/gaphor) ஆகவும் நிறுவப்படலாம்.
uk: Останню версію Gaphor можна завантажити з [Сторінка завантаження Gaphor] (https://gaphor.org/download#macos). Gaphor також можна встановити у вигляді [Homebrew бочки](https://formulae.brew.sh/cask/gaphor).

source: To set up a development environment with macOS:
fr: Mise à jour des instructions relatives à l'environnement de développement :
ta: MACOS உடன் மேம்பாட்டு சூழலை அமைக்க:
uk: Щоб налаштувати середовище розробки з macOS:

source: Install [Homebrew](https://brew.sh)
es: Instalar [Homebrew](https://brew.sh)
fr: Installer [Homebrew](https://brew.sh)
ta: [HTTPS://brew.sh) ஐ நிறுவவும்
uk: Встановити [Homebrew](https://brew.sh)

source: Open a terminal and execute:
es: Abra un terminal y ejecute:
fr: Ouvrez un terminal et exécutez :
ta: ஒரு முனையத்தைத் திறந்து செயல்படுத்தவும்:
uk: Відкрийте термінал і виконайте:

source: Next, [clone the repository](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository), after which you can execute the following consecutive commands to install the poetry environment:
fr: Ensuite, [clonez le dépôt] (https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository), après quoi vous pouvez exécuter les commandes suivantes pour installer l'environnement de poésie :
ta: அடுத்து, [களஞ்சியத்தை குளோன்](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository), அதன் பிறகு நிறுவ வேண்டிய பின்வரும் கட்டளைகளை நீங்கள் இயக்கலாம் பா சூழல்:
uk: Далі, [клонуйте сховище](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository), після чого ви можете виконати наступні послідовні команди для встановлення поетичного середовища:

source: If PyGObject does not compile and complains about a missing `ffi.h` file, you may want to install libffi from Homebrew, and set the following environment variable and run `poetry install` again:
fr: Si PyGObject ne compile pas et se plaint d'un fichier `ffi.h` manquant, vous pouvez installer la librairie libffi depuis Homebrew, définir la variable d'environnement suivante et relancer `poetry install` :
ta: பைகோப்செக்ட் தொகுக்கவில்லை மற்றும் காணாமல் போன `ffi.h` கோப்பைப் பற்றி குற்றச்சாட்டு செய்தால், நீங்கள் ஓம்பிரூவிலிருந்து லிப்ஃபியை நிறுவ விரும்பலாம், மேலும் பின்வரும் சூழல் மாறியை அமைத்து மீண்டும்` பா நிறுவலை இயக்கவும்:
uk: Якщо PyGObject не компілюється та скаржиться на відсутність файлу `ffi.h`, ви можете встановити libffi з Homebrew, встановити таку змінну середовища та знову запустити `poetry install`:

source: Before you start debugging you'll need to open Gaphor in VSCode (the folder containing `pyproject.toml`). You'll need to have the Python extension installed.
fr: Avant de commencer à déboguer, vous devez ouvrir Gaphor dans VSCode (le dossier contenant `pyproject.toml`). Vous devez avoir installé l'extension Python.
ta: நீங்கள் பிழைத்திருத்தத்தைத் தொடங்குவதற்கு முன், நீங்கள் காஃபோரை (`pyproject.toml` கொண்ட கோப்புறை) VSCode இல் திறக்க வேண்டும். பைதான் நீட்டிப்பு நிறுவப்பட்டிருக்க வேண்டும்.
uk: Перш ніж розпочати налагодження, вам потрібно відкрити Gaphor у VSCode (тека, що містить `pyproject.toml`). Вам потрібно буде встановити розширення Python.

source: Packaging for macOS
es: Empaquetado para macOS
fr: Conditionnement pour macOS
ta: MACOS க்கான பேக்கேசிங்
uk: Упаковка для macOS

source: In order to create an exe installation package for macOS, we utilize [PyInstaller](https://pyinstaller.org) which analyzes Gaphor to find all the dependencies and bundle them in to a single folder.
es: Para crear un paquete de instalación exe para macOS, usamos [PyInstaller](https://pyinstaller.org) que analiza Gaphor para encontrar todas las dependencias y agruparlas en una única carpeta.
fr: Afin de créer un paquet d'installation exe pour macOS, nous utilisons [PyInstaller] (https://pyinstaller.org) qui analyse Gaphor pour trouver toutes les dépendances et les regrouper dans un seul dossier.
ta: MACOS க்கான EXE நிறுவல் தொகுப்பை உருவாக்க, நாங்கள் [pyinstaller] (https://pyinstaller.org) ஐப் பயன்படுத்துகிறோம், இது அனைத்து சார்புகளையும் கண்டுபிடித்து அவற்றை ஒரு கோப்புறையில் தொகுக்க காஃபரை பகுப்பாய்வு செய்கிறது.
uk: Щоб створити пакет встановлення exe для macOS, ми використовуємо [PyInstaller](https://pyinstaller.org), який аналізує Gaphor, щоб знайти всі залежності та об’єднати їх в одну папку.

source: Follow the instructions for settings up a development environment above
es: Siga las instrucciones anteriores para configurar un entorno de desarrollo
fr: Suivez les instructions relatives à la mise en place d'un environnement de développement ci-dessus
ta: மேலே ஒரு மேம்பாட்டு சூழலை அமைப்புகளுக்கான வழிமுறைகளைப் பின்பற்றவும்
uk: Дотримуйтеся вказівок щодо налаштування середовища розробки вище

source: Open a terminal and execute the following from the repository directory:
es: Abra un terminal y ejecute lo siguiente desde el directorio del repositorio:
fr: Ouvrez un terminal et exécutez la commande suivante à partir du répertoire du référentiel :
ta: ஒரு முனையத்தைத் திறந்து களஞ்சிய கோப்பகத்திலிருந்து பின்வருவனவற்றை இயக்கவும்:
uk: Відкрийте термінал і виконайте наступне з каталогу сховища:

source: Resolve Merge Conflicts
es: Resolver conflictos de fusión
fr: Résoudre les conflits de fusion
ta: ஒன்றிணைக்கும் மோதல்களைத் தீர்க்கவும்
uk: Вирішення конфліктів злиття

source: Suppose you’re working on a model. If you create a change, while someone else has also made changes, there’s a fair chance you'll end up with a merge conflict.
es: Supongamos que está trabajando en un modelo. Si crea un cambio, mientras que otra persona también ha hecho cambios, hay una buena probabilidad de que termine con un conflicto de fusión.
fr: Supposons que vous travailliez sur un modèle. Si vous apportez une modification alors que quelqu'un d'autre a également apporté des changements, il y a de fortes chances que vous provoquez un conflit de fusion.
ta: நீங்கள் ஒரு மாதிரியில் வேலை செய்கிறீர்கள் என்று வைத்துக்கொள்வோம். நீங்கள் ஒரு மாற்றத்தை உருவாக்கினால், வேறொருவர் மாற்றங்களைச் செய்தாலும், ஒன்றிணைக்கும் மோதலுடன் நீங்கள் முடிவடையும் வாய்ப்பு உள்ளது.
uk: Припустімо, ви працюєте над моделлю. Якщо ви вносите зміни, у той час як хтось інший також вносить зміни, існує велика ймовірність, що у вас виникне конфлікт злиття.

source: Gaphor tries to make the changes to a model as small as possible: all elements are stored in the same order. However, since a Gaphor model is a persisted graph of objects, merging changes is not as simple as opening a text editor.
es: Gaphor intenta que los cambios en un modelo sean lo más pequeños posible: todos los elementos se almacenan en el mismo orden. Sin embargo, dado que un modelo Gaphor es un gráfico persistente de objetos, fusionar cambios no es tan sencillo como abrir un editor de texto.
fr: Gaphor s'efforce de réduire au maximum les modifications apportées à un modèle : tous les éléments sont stockés dans le même ordre. Cependant, étant donné qu'un modèle Gaphor est un graphe persistant d'objets, la fusion des modifications n'est pas aussi simple qu'ouvrir un éditeur de texte.
ta: கஃபர் ஒரு மாதிரியில் மாற்றங்களை முடிந்தவரை சிறியதாக செய்ய முயற்சிக்கிறார்: அனைத்து கூறுகளும் ஒரே வரிசையில் சேமிக்கப்படுகின்றன. இருப்பினும், ஒரு காஃபர் மாதிரி என்பது பொருள்களின் தொடர்ச்சியான வரைபடமாக இருப்பதால், மாற்றங்களை ஒன்றிணைப்பது ஒரு உரை எடிட்டரைத் திறப்பது போல எளிதல்ல.
uk: Gaphor намагається зробити зміни в моделі якомога меншими: всі елементи зберігаються в тому ж порядку. Однак, оскільки модель Gaphor - це збережений граф об'єктів, об'єднати зміни не так просто, як відкрити текстовий редактор.

source: From Gaphor 2.18 onwards Gaphor is also capable of merging models. Once a merge conflict has been detected (i.e., when the model file contains git conflict-resolution markers `<<<<<<<`, `=======`, and `>>>>>>>`), Gaphor will offer the option to open the current model, the incoming model or merge changes manually via the Merge Editor.
fr: Depuis Gaphor 2.18, Gaphor est également capable de fusionner des modèles. Une fois qu'un conflit de fusion a été détecté (c'est-à-dire lorsque le fichier de modèle contient les marqueurs de résolution de conflit git `<<<<<<<`, `=======`, et `>>>>>>>`), Gaphor offrira l'option d'ouvrir le modèle actuel, le modèle entrant ou de fusionner les changements manuellement via l'éditeur de fusion.
ta: கஃபர் 2.18 இலிருந்து காஃபர் மாதிரிகளை ஒன்றிணைக்கும் திறன் கொண்டது. ஒரு ஒன்றிணைப்பு மோதல் கண்டறியப்பட்டவுடன் (அதாவது, மாதிரி கோப்பில் அறிவிலி மோதல்-தெளிவுத்திறன் குறிப்பான்கள் `<<<<<<<`, `=======`, மற்றும் `>>>>>>` .
uk: Починаючи з версії Gaphor 2.18, Gaphor також може об'єднувати моделі. Після виявлення конфлікту злиття (тобто, коли файл моделі містить git-маркери вирішення конфліктів `<<<<<<<`, `=======` і `>>>>>>>`), Gaphor запропонує відкрити поточну модель, вхідну модель або об'єднати зміни вручну за допомогою редактора злиття.

source: ![A dialog showing options on how to deal with a merge conflict.](images/merge-dialog.png)
fr: ![Une boîte de dialogue montrant des options sur la façon de traiter un conflit de fusion](images/merge-dialog.png)
ta: ![இணைப்பு மோதலை எவ்வாறு கையாள்வது என்பது குறித்த விருப்பங்களைக் காட்டும் உரையாடல்.](images/merge-dialog.png)
uk: ![Діалогове вікно з параметрами вирішення конфлікту злиття.](images/merge-dialog.png)

source: A dialog showing options on how to deal with a merge conflict.
fr: Une boîte de dialogue affiche des options sur la manière de traiter un conflit de fusion.
ta: ஒன்றிணைக்கும் மோதலை எவ்வாறு கையாள்வது என்பதற்கான விருப்பங்களைக் காட்டும் உரையாடல்.
uk: Діалогове вікно з параметрами вирішення конфлікту злиття.

source: If you choose *Open Merge Editor*, both models will be loaded. The current model remains as is. In addition, the changes made to the incoming model are calculated. Those changes are stored as _pending change_ objects in the model.
es: Si elige *Abrir editor de fusión*, se cargarán ambos modelos. El modelo actual permanece tal cual. Además, se calculan los cambios realizados en el modelo entrante. Esos cambios se almacenan como objetos _pending change_ en el modelo.
fr: Si vous choisissez *Ouvrir l'éditeur de fusion*, les deux modèles seront chargés. Le modèle actuel reste tel quel. En outre, les modifications apportées au modèle entrant sont calculées. Ces modifications sont stockées en tant qu'objets _pending change_ (changement en attente) dans le modèle.
ta: நீங்கள் *திறந்த ஒன்றிணைப்பு எடிட்டரை *தேர்வுசெய்தால், இரண்டு மாதிரிகள் ஏற்றப்படும். தற்போதைய மாதிரி அப்படியே உள்ளது. கூடுதலாக, உள்வரும் மாதிரியில் செய்யப்பட்ட மாற்றங்கள் கணக்கிடப்படுகின்றன. அந்த மாற்றங்கள் மாதிரியில் _ முன்னுரிமை மாற்ற_ பொருள்களாக சேமிக்கப்படுகின்றன.
uk: Якщо ви виберете *Відкрити редактор злиття*, будуть завантажені обидві моделі. Поточна модель залишається без змін. Крім того, обчислюються зміни, внесені до вхідної моделі. Ці зміни зберігаються в моделі як об'єкти _очікувані зміни_.

source: Pending changes are part of the model, you can save the model with changes and resolve those at a later point.
es: Los cambios pendientes forman parte del modelo, puede guardar el modelo con los cambios y resolverlos más adelante.
fr: Les modifications en attente font partie du modèle, vous pouvez enregistrer le modèle avec les modifications et les résoudre ultérieurement.
ta: நிலுவையில் உள்ள மாற்றங்கள் மாதிரியின் ஒரு பகுதியாகும், நீங்கள் மாதிரியை மாற்றங்களுடன் சேமிக்கலாம் மற்றும் பிற்காலத்தில் அவற்றைத் தீர்க்கலாம்.
uk: Зміни, що очікують на розгляд, є частиною моделі, ви можете зберегти модель зі змінами та вирішити їх пізніше.

source: The Merge Editor is shown on the right side, replacing the (normal) Property Editor.
es: El Editor de Fusión se muestra a la derecha, sustituyendo al Editor de Propiedades (por defecto).
fr: L'éditeur de fusion s'affiche à droite, remplaçant l'éditeur de propriétés (normal).
ta: ஒன்றிணைப்பு எடிட்டர் வலது பக்கத்தில் காட்டப்பட்டுள்ளது, (சாதாரண) சொத்து எடிட்டரை மாற்றுகிறது.
uk: Редактор злиття показано праворуч, замінюючи (звичайний) редактор властивостей.

source: ![The Gaphor main window, showing the merge editor on the right.](images/merge-conflict-window.png)
fr: ![La fenêtre principale de Gaphor, avec l'éditeur de fusion à droite](images/merge-conflict-window.png)
ta: ![வலது புறத்தில் இணைப்பு திருத்தியைக் காட்டும் காஃபோர் முதன்மை சாளரம்.](images/merge-conflict-window.png)
uk: ![Головне вікно Gaphor, де показано редактор злиття праворуч.](images/merge-conflict-window.png)

source: The Gaphor main window, showing the merge editor on the right.
fr: La fenêtre principale de Gaphor, avec l'éditeur de fusion à droite.
ta: கஃபர் முதன்மையான சாளரம், வலதுபுறத்தில் ஒன்றிணைக்கும் எடிட்டரைக் காட்டுகிறது.
uk: Головне вікно Gaphor із редактором злиття праворуч.

source: Merge actions are grouped by diagram, where possible. When you apply a change, all changes listed as children are also applied. Once changes are applied, they can only be reverted by undoing the change (hit _Undo_).
es: Las acciones de fusión se agrupan por diagrama, siempre que sea posible. Cuando se aplica un cambio, también se aplican todos los cambios listados como dependientes. Una vez aplicados los cambios, solo pueden revertirse deshaciendo el cambio (pulse _Deshacer_).
fr: Les actions de fusion sont regroupées par diagramme, dans la mesure du possible. Lorsque vous appliquez une modification, toutes les modifications répertoriées comme enfants sont également appliquées. Une fois la modification appliquée, il n'est plus possible de l'annuler qu'en rétablissant la modification précédente (appuyez sur _Undo_).
ta: ஒன்றிணைக்கும் செயல்கள் சாத்தியமான இடங்களில் வரைபடத்தால் தொகுக்கப்படுகின்றன. நீங்கள் ஒரு மாற்றத்தைப் பயன்படுத்தும்போது, குழந்தைகளாக பட்டியலிடப்பட்ட அனைத்து மாற்றங்களும் பயன்படுத்தப்படுகின்றன. மாற்றங்கள் பயன்படுத்தப்பட்டதும், மாற்றத்தை செயல்தவிர்க்குவதன் மூலம் மட்டுமே அவற்றை மாற்ற முடியும் (_undo_ ஐத் தாக்கவும்).
uk: Дії злиття згруповано за діаграмами, де це можливо. Коли ви застосовуєте зміну, всі зміни, перелічені як дочірні, також застосовуються. Після застосування змін їх можна скасувати, лише скасувавши зміни (натиснувши _Undo_).

source: The Merge Editor replaces the Property Editor, as long as there are pending changes in the model.
es: El Editor de fusiones sustituye al Editor de propiedades, siempre que haya cambios pendientes en el modelo.
fr: L'éditeur de fusion remplace l'éditeur de propriétés tant que des modifications sont en cours dans le modèle.
ta: ஒன்றிணைப்பு எடிட்டர் சொத்து எடிட்டரை மாற்றுகிறது, மாதிரியில் மாற்றங்கள் நிலுவையில் உள்ளன.
uk: Редактор злиття замінює редактор властивостей, доки в моделі є зміни, що очікують на розгляд.

source: It is concidered good practice to resolve the merge conflict before you continue modeling.
es: Se considera una buena práctica resolver el conflicto de fusión antes de seguir modelando.
fr: Une bonne pratique consiste à résoudre le conflit de fusion avant de poursuivre la modélisation.
ta: நீங்கள் மாடலிங் செய்வதற்கு முன்பு ஒன்றிணைப்பு மோதல்களைத் தீர்ப்பது நல்ல நடைமுறையாகக் கருதப்படுகிறது.
uk: Вважається хорошою практикою вирішити конфлікт злиття перед продовженням моделювання.

source: When all conflicts have been resolved, press *Resolve* to finish merge conflict resolution.
es: Cuando se hayan resuelto todos los conflictos, pulse *Resolver* para finalizar la resolución de conflictos de fusión.
fr: Lorsque tous les conflits ont été résolus, appuyez sur *Resolve* pour terminer la résolution des conflits de fusion.
ta: அனைத்து மோதல்களும் தீர்க்கப்பட்டால், மோதல் தீர்மானத்தை ஒன்றிணைக்க * தீர்க்க * அழுத்தவும்.
uk: Коли всі конфлікти буде вирішено, натисніть *Resolve*, щоб завершити вирішення конфлікту об’єднання.

source: Modeling Languages
es: Lenguajes de modelado
fr: Langages de modélisation
ta: மாடலிங் மொழிகள்
uk: Мови Моделювання

source: Since version 2.0, Gaphor supports the concept of Modeling languages. This allows for development of separate modeling languages separate from the Gaphor core application.
es: Desde la versión 2.0, Gaphor soporta el concepto de lenguajes de modelado. Esto permite el desarrollo de lenguajes de modelado independientes de la aplicación central de Gaphor.
fr: Depuis la version 2.0, Gaphor supporte le concept de langages de modélisation. Cela permet de développer des langages de modélisation distincts de l'application principale de Gaphor.
ta: பதிப்பு 2.0 முதல், கஃபர் மாடலிங் மொழிகளின் கருத்தை ஆதரிக்கிறது. இது காஃபர் கோர் பயன்பாட்டிலிருந்து தனித்தனியாக தனி மாடலிங் மொழிகளை உருவாக்க அனுமதிக்கிறது.
uk: Починаючи з версії 2.0, Gaphor підтримує концепцію мов моделювання. Це дозволяє розробляти окремі мови моделювання окремо від основної програми Gaphor.

source: The main language was, and will be UML. Gaphor now also supports a subset of SysML, RAAML and the C4 model.
es: El lenguaje principal era y será UML. Ahora Gaphor también admite un subconjunto de SysML, RAAML y el modelo C4.
fr: Le langage principal était et reste UML. Gaphor prend désormais également en charge un sous-ensemble de SysML, RAAML et le modèle C4.
ta: முக்கிய மொழி, மற்றும் யுஎம்எல் இருக்கும். காஃபர் இப்போது SYSML, RAAML மற்றும் C4 மாடலின் துணைக்குழுவையும் ஆதரிக்கிறது.
uk: Основною мовою був і буде UML. Gaphor тепер також підтримує підмножину SysML, RAAML і модель C4.

source: A modeling language in Gaphor is defined by a class implementing the `gaphor.abc.ModelingLanguage` abstract base class. The modeling language should be registered as a `gaphor.modelinglanguages` entry point.
fr: Un langage de modélisation dans Gaphor est défini par une classe implémentant la classe de base abstraite `gaphor.abc.ModelingLanguage`. Le langage de modélisation doit être enregistré en tant que point d'entrée `gaphor.modelinglanguages`.
ta: Kaphor இல் ஒரு மாடலிங் மொழி `kaphor.abc.modelinglanguage` சுருக்க அடிப்படை வகுப்பை செயல்படுத்தும் ஒரு வகுப்பால் வரையறுக்கப்படுகிறது. மாடலிங் மொழி `gaphor.modelinglanguages` நுழைவு புள்ளியாக பதிவு செய்யப்பட வேண்டும்.
uk: Мова моделювання в Gaphor визначається класом, що реалізує абстрактний базовий клас `gaphor.abc.ModelingLanguage`. Мова моделювання повинна бути зареєстрована як точка входу `gaphor.modelinglanguages`.

source: The `ModelingLanguage` interface is fairly minimal. It allows other services to look up elements and diagram items, as well as a toolbox, and diagram types. However, the responsibilities of a modeling language do not stop there. Parts of functionality will be implemented by registering handlers to a set of generic functions.
es: La interfaz `ModelingLanguage` es bastante mínima. Permite que otros servicios busquen elementos y elementos de diagramas, así como una caja de herramientas y tipos de diagramas. Sin embargo, las responsabilidades de un lenguaje de modelado no terminan ahí. Partes de la funcionalidad se implementarán mediante el registro de manejadores a un conjunto de funciones genéricas.
fr: L'interface `ModelingLanguage` (Langage de modélisation) est assez minimale. Elle permet à d'autres services de rechercher des éléments et des éléments de diagramme, ainsi qu'une boîte à outils et des types de diagramme. Cependant, les responsabilités d'un langage de modélisation ne s'arrêtent pas là. Certaines fonctionnalités seront mises en œuvre en enregistrant des gestionnaires pour un ensemble de fonctions génériques.
ta: `மாடலிங் லாங்குவேச்` இடைமுகம் மிகவும் மிகக் குறைவு. இது மற்ற சேவைகளை கூறுகள் மற்றும் வரைபட உருப்படிகள், அத்துடன் ஒரு கருவிப்பெட்டி மற்றும் வரைபட வகைகளைப் பார்க்க அனுமதிக்கிறது. இருப்பினும், ஒரு மாடலிங் மொழியின் பொறுப்புகள் அங்கு நிற்காது. பொதுவான செயல்பாடுகளின் தொகுப்பிற்கு கையாளுபவர்களை பதிவு செய்வதன் மூலம் செயல்பாட்டின் பகுதிகள் செயல்படுத்தப்படும்.
uk: Інтерфейс `ModelingLanguage` є досить мінімальним. Він дозволяє іншим службам шукати елементи та елементи діаграм, а також панель інструментів і типи діаграм. Однак на цьому обов'язки мови моделювання не закінчуються. Частину функціональності буде реалізовано шляхом реєстрації обробників для набору загальних функцій.

source: But let's not get ahead of ourselves. What is the functionality a modeling language implementation can offer?
es: Pero no nos adelantemos. ¿Cuál es la funcionalidad que puede ofrecer la aplicación de un lenguaje de modelado?
fr: Mais n'allons pas trop vite en besogne. Quelles fonctionnalités une implémentation de langage de modélisation peut-elle offrir ?
ta: ஆனால் நம்மை விட முன்னேற வேண்டாம். ஒரு மாடலிங் மொழி செயல்படுத்தல் வழங்கக்கூடிய செயல்பாடு என்ன?
uk: Але не будемо забігати наперед. Які функціональні можливості може запропонувати реалізація мови моделювання?

source: Three functionalities are exposed by a [`ModelingLanguage` instance](#modeling-language):
fr: Trois fonctionnalités sont exposées par une instance de [`ModelingLanguage`] (#modeling-language) :
ta: மூன்று செயல்பாடுகள் ஒரு [`ModelingLanguage` நிகழ்வு](#modeling-language) மூலம் அம்பலப்படுத்தப்படுகின்றன:
uk: [`ModelingLanguage` екземпляр] (#modeling-language) відкриває три функції:

source: A data model (elements) and diagram items
es: Un modelo de dato (elementos) y elementos de esquema
fr: Un modèle de données (éléments) et des éléments de diagramme
ta: தரவு மாதிரி (கூறுகள்) மற்றும் வரைபட உருப்படிகள்
uk: Модель даних (елементи) та елементи діаграми

source: Diagram types
es: Tipos de diagramas
fr: Types de diagrammes
ta: வரைபடம் வகைகள்
uk: Типи діаграм

source: A toolbox definition
es: Una definición de caja de herramientas
fr: Une définition de la boîte à outils
ta: ஒரு கருவிப்பெட்டி வரையறை
uk: Визначення панелі інструментів
