Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: For more information on how to use the official installer, please see the [full installer instructions](https://docs.python.org/3/using/windows.html#windows-full). The default installation options should be fine for use with Gaphor.
es: Para más información sobre cómo usar el instalador oficial, consulte las [instrucciones completas del instalador](https://docs.python.org/3/using/windows.html#windows-full). Las opciones de instalación predeterminadas deberían ser adecuadas para Gaphor.
fr: Pour plus d'informations sur l'utilisation de l'installateur officiel, veuillez consulter les [instructions complètes de l'installateur] (https://docs.python.org/3/using/windows.html#windows-full). Les options d'installation par défaut devraient convenir à Gaphor.
ta: அதிகாரப்பூர்வ நிறுவியை எவ்வாறு பயன்படுத்துவது என்பது பற்றிய கூடுதல் தகவலுக்கு, தயவுசெய்து [முழு நிறுவி வழிமுறைகள்] (https://docs.python.org/3/using/windows.html#windows-full) ஐப் பார்க்கவும். இயல்புநிலை நிறுவல் விருப்பங்கள் GAPHOR உடன் பயன்படுத்த நன்றாக இருக்க வேண்டும்.
uk: Для отримання додаткової інформації про те, як використовувати офіційний інсталятор, будь ласка, дивіться [повну інструкцію з інсталяції] (https://docs.python.org/3/using/windows.html#windows-full). Параметри встановлення за замовчуванням мають бути придатними для використання з Gaphor.

source: Install the latest Python version using the [official installer](https://www.python.org/downloads/windows/).
es: Instale la última versión de Python usando el [instalador oficial](https://www.python.org/downloads/windows/).
fr: Installez la dernière version de Python à l'aide de l'[installateur officiel] (https://www.python.org/downloads/windows/).
ta: [அதிகாரப்பூர்வ நிறுவி](https://www.python.org/downloads/windows/) ஐப் பயன்படுத்தி அண்மைக் கால பைதான் பதிப்பை நிறுவவும்.
uk: Установіть останню версію Python за допомогою [офіційного інсталятора](https://www.python.org/downloads/windows/).

source: Open a PowerShell terminal as a normal user and check the python version:
es: Abra un terminal PowerShell como usuario normal y compruebe la versión de python:
fr: Ouvrez un terminal PowerShell en tant qu'utilisateur normal et vérifiez la version de python :
ta: ஒரு பவர்செல் முனையத்தை ஒரு சாதாரண பயனராகத் திறந்து பைதான் பதிப்பை சரிபார்க்கவும்:
uk: Відкрийте термінал PowerShell як звичайний користувач і перевірте версію python:

source: Install Graphviz
es: Instalar Graphviz
fr: Installer Graphviz
ta: கிராப்விசை நிறுவவும்
uk: Встановіть Graphviz

source: Graphviz is used by Gaphor for automatic diagram formatting.
es: Gaphor usa Graphviz para dar formato automático a los diagramas.
fr: Graphviz est utilisé par Gaphor pour le formatage automatique des diagrammes.
ta: தானியங்கி வரைபட வடிவமைப்பிற்காக Kaphor ஆல் கிராஃப்விச் பயன்படுத்தப்படுகிறது.
uk: Graphviz використовується Gaphor для автоматичного форматування діаграм.

source: Install from WinGet with administrator PowerShell:
fr: Installer à partir de WinGet avec l'administrateur PowerShell :
ta: நிர்வாகி பவர்செல் உடன் விங்கெட்டிலிருந்து நிறுவவும்:
uk: Встановити з WinGet за допомогою адміністратора PowerShell:

source: Install pipx
es: Instalar pipx
fr: Installer pipx
ta: PIPX ஐ நிறுவவும்
uk: Встановити pipx

source: From the regular user PowerShell terminal execute:
es: Desde el terminal PowerShell del usuario normal ejecutar:
fr: À partir du terminal PowerShell de l'utilisateur normal, exécutez :
ta: வழக்கமான பயனர் பவர்செல் முனையத்திலிருந்து செயல்படுவதிலிருந்து:
uk: З терміналу PowerShell звичайного користувача виконайте:

source: Download GTK
fr: Télécharger GTK
ta: GTK ஐ பதிவிறக்கவும்
uk: Завантажити GTK

source: Download the latest release asset at https://github.com/wingtk/gvsbuild/releases. The file will be called `GTK4_Gvsbuild_VERSION_x64.zip`, where `VERSION` is the latest released version.
fr: Téléchargez la dernière version à l'adresse https://github.com/wingtk/gvsbuild/releases. Le fichier sera appelé `GTK4_Gvsbuild_VERSION_x64.zip`, où `VERSION` est la dernière version publiée.
ta: அண்மைக் கால வெளியீட்டு சொத்தை https://github.com/wingtk/gvsbuild/relaess இல் பதிவிறக்கவும். கோப்பு `gtk4_gvsbuild_version_x64.zip` என்று அழைக்கப்படும், அங்கு` பதிப்பு` அண்மைக் கால வெளியிடப்பட்ட பதிப்பாகும்.
uk: Завантажте ресурс останнього випуску за адресою https://github.com/wingtk/gvsbuild/releases. Файл називатиметься `GTK4_Gvsbuild_VERSION_x64.zip`, де `ВЕРСІЯ` — остання випущена версія.

source: Unzip the `GTK4_Gvsbuild_VERSION_x64.zip` file to `C:\gtk`. For example with 7Zip:
fr: Décompressez le fichier `GTK4_Gvsbuild_VERSION_x64.zip` dans `C:\gtk`. Par exemple avec 7Zip :
ta: `Gtk4_gvsbuild_version_x64.zip` கோப்பை` c: \ gtk` க்கு அவிழ்த்து விடுங்கள். உதாரணமாக 7ZIP உடன்:
uk: Розархівуйте файл `GTK4_Gvsbuild_VERSION_x64.zip` до `C:\gtk`. Наприклад, з 7Zip:

source: The resulting directory structure should look like:
fr: La structure de répertoire résultante devrait ressembler à ce qui suit :
ta: இதன் விளைவாக வரும் அடைவு அமைப்பு போல இருக்க வேண்டும்:
uk: Отримана структура каталогу має виглядати так:

source: Setup Gaphor
es: Configurar Gaphor
fr: Mise en place Gaphor
ta: கஃபர் அமைக்கவும்
uk: Налаштувати Gaphor

source: In the same PowerShell terminal, clone the repository:
es: En el mismo terminal PowerShell, clone el repositorio:
fr: Dans le même terminal PowerShell, clonez le dépôt :
ta: அதே பவர்செல் முனையத்தில், களஞ்சியத்தை நகலி செய்யுங்கள்:
uk: У тому самому терміналі PowerShell клонуйте репозиторій:

source: Install Poetry
es: Instalar Poetry
fr: Installer Poetry
ta: பா நிறுவவும்
uk: Встановити Poetry

source: Add GTK to your environmental variables:
es: Añada GTK a sus variables de entorno:
fr: Ajoutez GTK à vos variables d'environnement :
ta: உங்கள் சுற்றுச்சூழல் மாறிகளுக்கு GTK ஐச் சேர்க்கவும்:
uk: Додайте GTK до ваших змінних середовища:

source: You can also edit your account's Environmental Variables to persist across PowerShell sessions.
es: También puede editar las variables de entorno de su cuenta para que persistan en todas las sesiones de PowerShell.
fr: Vous pouvez également modifier les «Variables d'Environnement» de votre compte pour qu'elles persistent entre les sessions PowerShell.
ta: பவர்செல் அமர்வுகள் முழுவதும் தொடர உங்கள் கணக்கின் சுற்றுச்சூழல் மாறிகள் திருத்தலாம்.
uk: Ви також можете редагувати змінні середовища свого облікового запису, щоб вони залишалися протягом сеансів PowerShell.

source: Install Gaphor's dependencies
es: Instalar dependencias de Gaphor
fr: Installer les dépendances de Gaphor
ta: கஃபரின் சார்புகளை நிறுவவும்
uk: Встановіть залежності Gaphor

source: Reinstall PyGObject and pycairo using gvsbuild wheels
es: Reinstale PyGObject y pycairo usando gvsbuild wheels
fr: Réinstaller PyGObject et pycairo en utilisant gvsbuild wheels
ta: சி.வி.எச்.பில்ட் சக்கரங்களைப் பயன்படுத்தி பைகோப்செக்ட் மற்றும் பைகைரோவை மீண்டும் நிறுவவும்
uk: Перевстановіть PyGObject і pycairo за допомогою колеса gvsbuild

source: Launch Gaphor!
es: ¡Inicie Gaphor!
fr: Lancer Gaphor !
ta: கேஃபரைத் தொடங்கவும்!
uk: Запустіть Gaphor!

source: Setting Up A Plugin Workspace for Gaphor
fr: Mise en place d'un espace de travail de plugin pour Gaphor
ta: கஃபருக்கு ஒரு சொருகி பணியிடத்தை அமைத்தல்
uk: Налаштування робочого середовища плагіна для Gaphor

source: When setting up a plugin workspace you need to perform the following steps:
fr: Lors de la mise en place d'un espace de travail pour un plugin, vous devez effectuer les étapes suivantes :
ta: சொருகி பணியிடத்தை அமைக்கும் போது நீங்கள் பின்வரும் படிகளைச் செய்ய வேண்டும்:
uk: Під час налаштування робочої області плагіна необхідно виконати наступні кроки:

source: cd (your project's workspace)
fr: cd (espace de travail de votre projet)
ta: குறுவட்டு (உங்கள் திட்டத்தின் பணியிடம்)
uk: cd (робоча область вашого проекту)

source: If your project does not already have a pyproject.toml file, create one. For details see the [Poetry documentation](https://python-poetry.org/docs/basic-usage/). If you already have a .toml file, make sure you have gaphor as a development dependency. For details see the [Gaphor Hello World Plugin](https://github.com/gaphor/gaphor_plugin_helloworld).
fr: Si votre projet n'a pas encore de fichier pyproject.toml, créez-en un. Pour plus de détails, voir la documentation de Poetry (https://python-poetry.org/docs/basic-usage/). Si vous avez déjà un fichier .toml, assurez-vous que gaphor est la dépendance de développement. Pour plus de détails, consultez le plugin [Gaphor Hello World] (https://github.com/gaphor/gaphor_plugin_helloworld).
ta: உங்கள் திட்டத்திற்கு ஏற்கனவே pyproject.toml கோப்பு இல்லை என்றால், ஒன்றை உருவாக்கவும். விவரங்களுக்கு [கவிதை ஆவணங்கள்](https://python-poetry.org/docs/basic-usage/) ஐப் பார்க்கவும். உங்களிடம் ஏற்கனவே .toml கோப்பு இருந்தால், உங்களுக்கு ஒரு மேம்பாட்டு சார்புநிலையாக காஃபர் இருப்பதை உறுதிப்படுத்திக் கொள்ளுங்கள். விவரங்களுக்கு [Kaphor Hullow world Pollegin](https://github.com/gaphor/gaphor_plugin_helloworld) ஐப் பார்க்கவும்.
uk: Якщо у вашому проекті ще немає файлу pyproject.toml, створіть його. За деталями зверніться до [Документації по поезії] (https://python-poetry.org/docs/basic-usage/). Якщо у вас вже є файл .toml, переконайтеся, що у вас є gaphor як залежність розробки. Докладні відомості наведено у [Плагін Gaphor Hello World](https://github.com/gaphor/gaphor_plugin_helloworld).

source: Install your project's dependencies. If you have made your project dependent upon Gaphor, this will pull in Gaphor.
fr: Installez les dépendances de votre projet. Si vous avez rendu votre projet dépendant de Gaphor, cela va tirer Gaphor.
ta: உங்கள் திட்டத்தின் சார்புகளை நிறுவவும். உங்கள் திட்டத்தை நீங்கள் கஃபோரைப் பொறுத்து செய்திருந்தால், இது காஃபரில் இழுக்கும்.
uk: Встановіть залежності вашого проекту. Якщо ви зробили свій проект залежним від Gaphor, це призведе до Gaphor.

source: Note that if you have forgotten to reinstall PyGObject and pycairo, the first time you add an element to a diagram that has text, gaphor will crash!
fr: Notez que si vous avez oublié de réinstaller PyGObject et pycairo, gaphor plantera la première fois que vous ajoutez un élément à un diagramme qui contient du texte !
ta: பைகோப்செக்ட் மற்றும் பைகிரோவை மீண்டும் நிறுவ நீங்கள் மறந்துவிட்டால், உரையைக் கொண்ட ஒரு வரைபடத்தில் ஒரு உறுப்பை முதன்முதலில் சேர்க்கும்போது, காஃபர் செயலிழக்கும்!
uk: Зауважте, що якщо ви забули перевстановити PyGObject і pycairo, під час першого додавання елемента до діаграми з текстом gaphor вийде з ладу!

source: Start a new PowerShell terminal, and set current directory to the project folder:
es: Inicie un nuevo terminal PowerShell y establezca el directorio actual en la carpeta del proyecto:
fr: Démarrez un nouveau terminal PowerShell et définissez le répertoire courant comme étant le dossier du projet :
ta: ஒரு புதிய பவர்செல் முனையத்தைத் தொடங்கி, தற்போதைய கோப்பகத்தை திட்ட கோப்புறையில் அமைக்கவும்:
uk: Запустіть новий термінал PowerShell і встановіть для поточного каталогу теку проекту:

source: Ensure that path environment variable is set:
es: Asegúrese de que la variable de entorno path está activada:
fr: Assurez-vous que la variable d'environnement path est définie :
ta: பாதை சூழல் மாறி அமைக்கப்பட்டிருப்பதை உறுதிசெய்க:
uk: Переконайтеся, що встановлено змінну середовища path:

source: Start Visual Studio Code:
es: Inicie Visual Studio Code:
fr: Démarrez Visual Studio Code :
ta: விசுவல் ச்டுடியோ குறியீட்டைத் தொடங்கவும்:
uk: Запустіть код Visual Studio:

source: To start the debugger, execute the following steps:
es: Para iniciar el depurador, ejecute los siguientes pasos:
fr: Pour lancer le débogueur, procédez comme suit :
ta: பிழைத்திருத்தியைத் தொடங்க, பின்வரும் படிகளை இயக்கவும்:
uk: Щоб запустити налагоджувач, виконайте наступні кроки:

source: Open `__main__.py` file from `gaphor` folder
es: Abra el archivo `__main__.py` de la carpeta `gaphor`
fr: Ouvrir le fichier `__main__.py` du dossier `gaphor`
ta: `__Main __.` Kaphor` கோப்புறையிலிருந்து பை` கோப்பைத் திறக்கவும்
uk: Відкрийте файл `__main__.py` з папки `gaphor`

source: Add a breakpoint on line `main(sys.argv)`
es: Añada un punto de interrupción en la línea `main(sys.argv)`
fr: Ajouter un point d'arrêt sur la ligne `main(sys.argv)`
ta: `மெயின் (sys.argv)` என்ற வரியில் ஒரு இடைவெளியைச் சேர்க்கவும்
uk: Додайте точку зупину в рядку `main(sys.argv)`

source: In the menu, select Run → Start debugging
es: En el menú, seleccione Ejecutar → Iniciar depuración
fr: Dans le menu, sélectionnez Exécuter → Démarrer le débogage
ta: பட்டியலில், ரன் → பிழைத்திருத்தத்தைத் தொடங்கவும் என்பதைத் தேர்ந்தெடுக்கவும்
uk: У меню виберіть Виконати → Почати налагодження

source: Choose Select module from the list
es: Elija Seleccionar módulo de la lista
fr: Sélectionnez Sélectionner un module dans la liste
ta: பட்டியலிலிருந்து தேர்ந்தெடுக்கப்பட்ட தொகுதியைத் தேர்வுசெய்க
uk: Виберіть Вибрати модуль зі списку

source: Enter `gaphor` as module name
es: Introduzca `gaphor` como nombre del módulo
fr: Entrez `gaphor` comme nom de module
ta: தொகுதி பெயராக `கஃபர்` ஐ உள்ளிடவும்
uk: Введіть `gaphor` як назву модуля

source: Visual Studio Code will start the application in debug mode, and will stop at main.
es: Visual Studio Code iniciará la aplicación en modo de depuración y se detendrá en main.
fr: Visual Studio Code démarrera l'application en mode débogage et s'arrêtera à l'étape principale.
ta: விசுவல் ச்டுடியோ குறியீடு பயன்பாட்டை பிழைத்திருத்த பயன்முறையில் தொடங்கும், மேலும் இது பிரதானமாக நின்றுவிடும்.
uk: Visual Studio Code запустить програму в режимі налагодження та зупиниться в основному.

source: Debugging Your Plugin Using Visual Studio Code
fr: Débogage de votre plugin à l'aide de Visual Studio Code
ta: விசுவல் ச்டுடியோ குறியீட்டைப் பயன்படுத்தி உங்கள் சொருகி பிழைத்திருத்துகிறது
uk: Налагодження плагіна за допомогою коду Visual Studio

source: Start gaphor:
fr: Démarrer gaphor :
ta: கஃபரைத் தொடங்கு:
uk: Почати гафор:

source: In the VSCode menu, select Run → Start debugging
fr: Dans le menu VSCode, sélectionnez Exécuter → Démarrer le débogage
ta: Vscode பட்டியலில், ரன் → பிழைத்திருத்தத்தைத் தொடங்கவும் என்பதைத் தேர்ந்தெடுக்கவும்
uk: У меню VSCode виберіть Виконати → Почати налагодження

source: Your plugin should appear under the Tools menu.
fr: Votre plugin devrait apparaître dans le menu Outils.
ta: உங்கள் சொருகி கருவிகள் மெனுவின் கீழ் தோன்ற வேண்டும்.
uk: Ваш плагін має з’явитися в меню «Інструменти».

source: Packaging for Windows
es: Empaquetado para Windows
fr: Empaquetage pour Windows
ta: சாளரங்கள் பேக்கேசிங்
uk: Упаковка для Windows

source: In order to create an exe installation package for Windows, we utilize [PyInstaller](https://pyinstaller.org) which analyzes Gaphor to find all the dependencies and bundle them in to a single folder. We then use a custom bash script that creates a Windows installer using [NSIS](https://nsis.sourceforge.io/Main_Page) and a portable installer using [7-Zip](https://www.7-zip.org). To install them, open PowerShell as an administrator, then execute:
es: Para crear un paquete de instalación exe para Windows, usamos [PyInstaller](https://pyinstaller.org) que analiza Gaphor para encontrar todas las dependencias y agruparlas en una única carpeta. A continuación, usamos un script bash personalizado que crea un instalador de Windows usando [NSIS](https://nsis.sourceforge.io/Main_Page) y un instalador portable usando [7-Zip](https://www.7-zip.org). Para instalarlos, abra PowerShell como administrador y ejecute:
fr: Pour créer un paquet d'installation .exe pour Windows, nous utilisons PyInstaller qui analyse Gaphor pour trouver toutes les dépendances et les regrouper dans un seul dossier. Nous utilisons ensuite un script Bash personnalisé pour créer un programme d'installation pour Windows à l'aide de NSIS (https://nsis.sourceforge.io/Main_Page) et un programme d'installation portable à l'aide de 7-Zip (https://www.7-zip.org). Pour les installer, ouvrez PowerShell en tant qu'administrateur, puis exécutez la commande suivante :
ta: விண்டோசிற்கான EXE நிறுவல் தொகுப்பை உருவாக்க, நாங்கள் [PyinStaller](https://pyinstaller.org) ஐப் பயன்படுத்துகிறோம், இது அனைத்து சார்புகளையும் கண்டுபிடித்து அவற்றை ஒரு கோப்புறையில் தொகுக்க காஃபரை பகுப்பாய்வு செய்கிறது. [NSIS](https://nsis.sourceforge.io/main_page) ஐப் பயன்படுத்தி சாளரங்கள் நிறுவியை உருவாக்கும் தனிப்பயன் பாச் ச்கிரிப்டையும், [7-zip](https://www.7-zip.org). அவற்றை நிறுவ, நிர்வாகியாக பவர்செல் திறந்து, பின்னர் இயக்கவும்:
uk: Для створення інсталяційного пакету exe для Windows ми використовуємо [PyInstaller](https://pyinstaller.org), який аналізує Gaphor, щоб знайти всі залежності і зібрати їх в одну папку. Потім ми використовуємо спеціальний скрипт bash, який створює інсталятор для Windows за допомогою [NSIS](https://nsis.sourceforge.io/Main_Page) і портативний інсталятор за допомогою [7-Zip](https://www.7-zip.org). Щоб встановити їх, відкрийте PowerShell від імені адміністратора, а потім виконайте:

source: Then build your installer using:
es: Luego construya su instalador usando:
fr: Puis construisez votre programme d'installation en utilisant :
ta: உங்கள் நிறுவியைப் பயன்படுத்தி உருவாக்கவும்:
uk: Потім створіть інсталятор за допомогою:

source: Limited Anaconda Install
fr: Installation limitée d'Anaconda
ta: வரையறுக்கப்பட்ட அனகோண்டா நிறுவல்
uk: Обмежена установка Anaconda

source: Sometimes, it may be helpful to call Gaphor functionality from a python console on computers without the ability for a full development install (e.g., without administrative privileges). Because not all necessary Gaphor build dependencies (specifically, `gtksourceview5` and `libadwaita`) are not available as anaconda packages, you will not be able to build the program or instantiate/run application classes like `Application` and `Session`.
fr: Il peut parfois être utile d'appeler les fonctionnalités de Gaphor depuis une console Python sur des ordinateurs qui n'ont pas la possibilité d'effectuer une installation de développement complète (par exemple, sans privilèges d'administration). Parce que toutes les dépendances nécessaires à la construction de Gaphor (en particulier, gtksourceview5` et `libadwaita`) ne sont pas disponibles en tant que paquets Anaconda, vous ne pourrez pas construire le programme ni instancier ou exécuter des classes d'application comme `Application` and `Session`.
ta: சில நேரங்களில், முழு மேம்பாட்டு நிறுவலுக்கான திறன் இல்லாமல் (எ.கா., நிர்வாக சலுகைகள் இல்லாமல்) கணினிகளில் பைதான் கன்சோலில் இருந்து கஃபர் செயல்பாட்டை அழைப்பது உதவியாக இருக்கும். அனகோண்டா தொகுப்புகளாக தேவையான அனைத்து காஃபர் உருவாக்கும் சார்புகளையும் (குறிப்பாக, `gtksourceview5` மற்றும்` லிபாட்வைட்டா`) கிடைக்காததால், நீங்கள் நிரலை உருவாக்கவோ அல்லது `விண்ணப்பம்` மற்றும்` அமர்வு` போன்ற பயன்பாட்டு வகுப்புகளை உடனடிப்படுத்தவோ/இயக்கவோ முடியாது.
uk: Іноді може бути корисно викликати функції Gaphor з консолі python на комп'ютерах без можливості повного встановлення для розробки (наприклад, без адміністративних привілеїв). Оскільки не всі необхідні залежності збірки Gaphor (зокрема, `gtksourceview5` і `libadwaita`) доступні у вигляді пакунків анаконди, ви не зможете зібрати програму або створити/запустити класи програми, такі як `Application` і `Session`.

source: However, this setup can still be helpful if you want to use or call Gaphor as a library in the context of a larger project. In these cases, Gaphor can be installed as a package in an anaconda environment using the following process:
fr: Cependant, cette configuration peut être utile si vous souhaitez utiliser Gaphor en tant que bibliothèque dans le cadre d'un projet plus important. Dans ce cas, Gaphor peut être installé comme un paquet dans un environnement Anaconda en suivant le processus suivant :
ta: இருப்பினும், ஒரு பெரிய திட்டத்தின் சூழலில் நீங்கள் ஒரு நூலகமாக காஃபரை பயன்படுத்த அல்லது அழைக்க விரும்பினால் இந்த அமைப்பு இன்னும் உதவியாக இருக்கும். இந்த சந்தர்ப்பங்களில், பின்வரும் செயல்முறையைப் பயன்படுத்தி அனகோண்டா சூழலில் ஒரு தொகுப்பாக காஃபர் நிறுவப்படலாம்:
uk: Втім, таке встановлення може бути корисним, якщо ви хочете використовувати або викликати Gaphor як бібліотеку у контексті більшого проекту. У таких випадках Gaphor можна встановити як пакунок у середовищі anaconda за допомогою наступного процесу:

source: Create new anaconda environment
fr: Créer un nouvel environnement Anaconda
ta: புதிய அனகோண்டா சூழலை உருவாக்கவும்
uk: Створіть нове середовище анаконди

source: If you use anaconda for other projects, it's a good idea to create a new environment for Gaphor, so that its dependencies don't end up conflicting with your pre-existing development environment. To do this, run the following command from anaconda prompt:
fr: Si vous utilisez Anaconda pour d'autres projets, il est conseillé de créer un nouvel environnement pour Gaphor, afin d'éviter tout conflit avec votre environnement de développement préexistant. Pour ce faire, lancez la commande suivante depuis l'invite de Anaconda :
ta: பிற திட்டங்களுக்கு நீங்கள் அனகோண்டாவைப் பயன்படுத்தினால், காஃபருக்கு ஒரு புதிய சூழலை உருவாக்குவது நல்லது, இதனால் அதன் சார்புநிலைகள் உங்கள் முன்பே இருக்கும் மேம்பாட்டு சூழலுடன் முரண்படாது. இதைச் செய்ய, அனகோண்டா வரியில் இருந்து பின்வரும் கட்டளையை இயக்கவும்:
uk: Якщо ви використовуєте anaconda для інших проектів, варто створити нове середовище для Gaphor, щоб його залежності не конфліктували з вашим попереднім середовищем розробки. Для цього виконайте наступну команду з інтерпретатора anaconda:

source: where ``gaphor`` can be any name desired for the environment.
fr: où ``gaphor`` peut être n'importe quel nom souhaité pour l'environnement.
ta: ``கஃபர்`` சுற்றுச்சூழலுக்கு விரும்பிய எந்தப் பெயரும் இருக்கலாம்.

source: Update packages in the new environment
fr: Mettre à jour les paquets dans le nouvel environnement
ta: புதிய சூழலில் தொகுப்புகளைப் புதுப்பிக்கவும்
uk: Оновіть пакети в новому середовищі

source: Get the most recent packages using:
fr: Obtenez les paquets les plus récents en utilisant :
ta: பயன்படுத்த மிக அண்மைக் கால தொகுப்புகளைப் பெறுங்கள்:
uk: Отримайте найновіші пакети за допомогою:

source: Install dependencies
fr: Installer les dépendances
ta: சார்புகளை நிறுவவும்
uk: Встановити залежності

source: The following Gaphor dependencies are installable from anaconda:
fr: Les dépendances Gaphor suivantes peuvent être installées à partir d'Anaconda :
ta: அனகோண்டாவிலிருந்து பின்வரும் காஃபர் சார்புநிலைகள் நிறுவக்கூடியவை:
uk: Наступні залежності Gaphor можна встановити з anaconda:

source: Unfortunately, the `gtksourceview5` and `libadwaita` dependencies are not available as anaconda packages. So you may not be able to fully build/run the program in this environment.
fr: Malheureusement, les dépendances `gtksourceview5` et `libadwaita` ne sont pas disponibles en tant que paquets Anaconda. Il se peut donc que vous ne puissiez pas compiler ni exécuter complètement le programme dans cet environnement.
ta: துரதிர்ச்டவசமாக, `gtksourceview5` மற்றும்` லிபாட்வைட்டா` சார்புகள் அனகோண்டா தொகுப்புகளாக கிடைக்கவில்லை. எனவே இந்த சூழலில் நீங்கள் திட்டத்தை முழுமையாக உருவாக்க/இயக்க முடியாமல் போகலாம்.
uk: На жаль, залежності `gtksourceview5` і `libadwaita` недоступні як пакети anaconda. Тому ви не зможете повністю створити/запустити програму в цьому середовищі.

source: Set up your development environment
fr: Mise en place de l'environnement de développement
ta: உங்கள் மேம்பாட்டு சூழலை அமைக்கவும்
uk: Налаштуйте середовище розробки
