Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: Other functionalities can be extended by adding handlers to the respective generic functions:
fr: D'autres fonctionnalités peuvent être étendues en ajoutant des gestionnaires aux fonctions génériques correspondantes :
ta: அந்தந்த பொதுவான செயல்பாடுகளில் கையாளுபவர்களைச் சேர்ப்பதன் மூலம் பிற செயல்பாடுகளை நீட்டிக்க முடியும்:
uk: Інші функціональні можливості можна розширити, додавши обробники до відповідних загальних функцій:

source: [Connectors](#connectors), allow diagram items to connect
es: [Conectores](#connectors), permite conectar elementos del diagrama
fr: [Connecteurs](#connectors), permet de connecter des éléments de diagramme
ta: [இணைப்பிகள்](#connectors), வரைபட உருப்படிகளை இணைக்க அனுமதிக்கவும்
uk: [З’єднувачі](#connectors), дозволяють об’єднувати елементи діаграми

source: [Format/parse](#format-and-parse) model elements to and from a textual representation
fr: [Formater/analyser](#format-and-parse) modéliser des éléments vers et à partir d'une représentation textuelle
ta: [Format/parse](#format-and-parse) மாதிரியுரு elements பெறுநர் and இருந்து a textual representation
uk: [Format/parse](#format-and-parse) моделює елементи до текстового представлення та з нього

source: [Copy/paste](#copy-and-paste) behavior when element copying is not trivial, for example with more than one element is involved
es: Comportamiento [Copiar/pegar](#copy-and-paste) cuando la copia de elementos no es trivial, por ejemplo, cuando hay más de un elemento implicado
fr: Comportement de [copier/coller](#copy-and-paste) lorsque la copie d'un élément n'est pas triviale, par exemple lorsque plusieurs éléments sont impliqués
ta: [நகல்/ஒட்டுதல்](#copy-and-paste) நடத்தை உறுப்பு நகலெடுப்பது அற்பமானதாக இல்லாதபோது, எடுத்துக்காட்டாக ஒன்றுக்கு மேற்பட்ட உறுப்புகளுடன் தொடர்புடையது
uk: Поведінка [Copy/paste](#copy-and-paste), коли копіювання елемента не є тривіальним, наприклад, із залученням кількох елементів

source: [Grouping](#grouping), allow elements to be nested in one another
es: [Agrupación](#grouping), permite anidar elementos entre sí
fr: [Regroupement](#grouping), permet d'imbriquer les éléments les uns dans les autres
ta: [குழுமம்](#grouping), கூறுகளை ஒருவருக்கொருவர் கூடு கட்ட அனுமதிக்கவும்
uk: [Групування](#grouping), дозволяє елементам бути вкладеними один в одного

source: [Dropping](#dropping), allow elements to be dragged from the tree view onto a diagram
es: [Dropping](#dropping), permitir que los elementos se arrastren desde la vista de árbol a un diagrama
fr: [Dropping](#dropping), permet de faire glisser des éléments de l'arborescence sur un diagramme
ta: [கைவிடுதல்](#dropping), மரக் காட்சியில் இருந்து ஒரு வரைபடத்தில் கூறுகளை இழுக்க அனுமதிக்கவும்
uk: [Dropping](#dropping), дозволяє перетягувати елементи з перегляду дерева на діаграму

source: [Automatic cleanup rules](#automated-model-cleanup) to keep the model consistent
es: [Reglas de limpieza automática](#automated-model-cleanup) para mantener la coherencia del modelo
fr: [Règles de nettoyage automatique](#automated-model-cleanup) pour maintenir la cohérence du modèle
ta: [தானியங்கி தூய்மைப்படுத்தும் விதிகள்](#automated-model-cleanup) மாதிரியை சீராக வைத்திருக்க
uk: [Правила автоматичного очищення](#automated-model-cleanup), щоб підтримувати узгодженість моделі

source: Modeling languages can also provide new UI components. Those components are not loaded directly when you import a modeling language package. Instead, they should be imported via the `gaphor.modules` entrypoint.
fr: Les langages de modélisation peuvent également fournir de nouveaux composants d'interface utilisateur. Ces composants ne sont pas chargés directement lors de l'importation d'un paquetage de langage de modélisation. Ils doivent être importés via le point d'entrée `gaphor.modules`.
ta: மாடலிங் மொழிகள் புதிய இடைமுகம் கூறுகளையும் வழங்க முடியும். நீங்கள் ஒரு மாடலிங் மொழி தொகுப்பை இறக்குமதி செய்யும் போது அந்த கூறுகள் நேரடியாக ஏற்றப்படாது. அதற்கு பதிலாக, அவை `gaphor.modules` entrypoint வழியாக இறக்குமதி செய்யப்பட வேண்டும்.
uk: Мови моделювання також можуть надавати нові компоненти інтерфейсу користувача. Ці компоненти не завантажуються безпосередньо під час імпортування пакунка мови моделювання. Замість цього їх слід імпортувати через точку входу `gaphor.modules`.

source: [Editor pages](#property-editor-pages), shown in the collapsible pane on the right side
fr: [Pages de l'éditeur](#property-editor-pages), affichées dans le volet rétractable de droite
ta: [ஆசிரியர் பக்கங்கள்](#property-editor-pages), வலது பக்கத்தில் மடக்கக்கூடிய பலகத்தில் காட்டப்பட்டுள்ளது
uk: [Сторінки редактора](#property-editor-pages), показано на панелі, що згортається, праворуч

source: [Instant (diagram) editor popups](#instant-diagram-editor-popups)
es: [Ventanas emergentes instantáneas del editor (de diagramas)](#instant-diagram-editor-popups)
fr: [Fenêtres contextuelles instantanées de l'éditeur (de diagrammes)](#instant-diagram-editor-popups)
ta: [Instant (diagram) திருத்தி popups](#instant-diagram-editor-popups)
uk: [Спливаючі вікна редактора (діаграми)](#instant-diagram-editor-popups)

source: Special diagram interactions
es: Interacciones especiales de diagramas
fr: Interactions avec les diagrammes spéciaux
ta: சிறப்பு வரைபட இடைவினைகள்
uk: Спеціальна діаграма взаємодій

source: Modeling language
fr: Langue de modélisation
ta: மாடலிங் மொழி
uk: Мова моделювання

source: A model provider is a special service that provides an entrypoint to a model implementation, such as UML, SysML, RAAML.
es: Un proveedor de modelos es un servicio especial que proporciona un punto de entrada a una implementación de modelo, como UML, SysML, RAAML.
fr: Un fournisseur de modèle est un service spécialisé qui fournit un point d'entrée pour l'implémentation d'un modèle, comme UML, SysML ou RAAML.
ta: ஒரு மாதிரி வழங்குநர் என்பது ஒரு சிறப்பு சேவையாகும், இது யுஎம்எல், சிச்எம்எல், ராம்ல் போன்ற மாதிரி செயலாக்கத்திற்கு நுழைவு புள்ளியை வழங்குகிறது.
uk: Постачальник моделі — це спеціальна служба, яка надає точку входу до реалізації моделі, наприклад UML, SysML, RAAML.

source: Iterate diagram types.
es: Iterar tipos de diagramas.
fr: Diagrammes types.
ta: வரைபட வகைகளை மீண்டும் செயல்படுத்தவும்.
uk: Ітерація типів діаграм.

source: Iterate element types.
fr: Itérer les types d'éléments.
ta: உறுப்பு வகைகள்.
uk: Ітерація типів елементів.

source: Look up a model element type by (class) name.
es: Buscar un tipo de elemento del modelo por nombre (de clase).
fr: Rechercher un élément de modèle par son nom de classe.
ta: (வகுப்பு) பெயரால் ஒரு மாதிரி உறுப்பு வகையைப் பாருங்கள்.
uk: Знайдіть тип елемента моделі за назвою (класу).

source: A namespace may be provided. This will allow the model to be loaded from that specific modeling language only.
fr: Un nom de domaine peut être fourni. Cela permettra au modèle d'être chargé uniquement à partir de ce langage de modélisation spécifique.
ta: ஒரு பெயர்வெளி வழங்கப்படலாம். இது அந்த குறிப்பிட்ட மாடலிங் மொழியிலிருந்து மட்டுமே மாதிரியை ஏற்ற அனுமதிக்கும்.
uk: Може бути надано простір імен. Це дозволить завантажувати модель лише з цієї конкретної мови моделювання.

source: A model for use in the Model Browser.
fr: Un modèle à utiliser dans le navigateur de modèles.
ta: மாதிரி உலாவியில் பயன்படுத்த ஒரு மாதிரி.
uk: Модель для використання в переглядачі моделей.

source: Human-readable name of the modeling language.
es: Nombre legible del lenguaje de modelado.
fr: Nom du langage de modélisation lisible par l'homme.
ta: மாடலிங் மொழியின் மனிதனால் படிக்கக்கூடிய பெயர்.
uk: Зрозуміла назва мови моделювання.

source: Get structure for the toolbox.
es: Obtener estructura para la caja de herramientas.
fr: Structurer la boîte à outils.
ta: கருவிப்பெட்டிக்கான கட்டமைப்பைப் பெறுங்கள்.
uk: Отримати структуру для панелі інструментів.

source: As a convention, the package containing the modeling language should have an attribute `__modeling_language__` that has the same value as the modeling language name in the entry point.
fr: Par convention, le paquet contenant le langage de modélisation doit avoir un attribut `__modeling_language__` dont la valeur est identique à celle du nom du langage de modélisation dans le point d'entrée.
ta: ஒரு மாநாடாக, மாடலிங் மொழியைக் கொண்ட தொகுப்பில் `__modeling_language__` என்ற பண்புக்கூறு இருக்க வேண்டும், இது நுழைவு புள்ளியில் மாடலிங் மொழி பெயரின் அதே மதிப்பைக் கொண்டுள்ளது.
uk: За домовленістю пакет, що містить мову моделювання, повинен мати атрибут `__modeling_language__`, який має те саме значення, що й назва мови моделювання в точці входу.

source: To illustrate:
fr: En guise d'illustration :
ta: விளக்க:
uk: Щоб проілюструвати:

source: The file `mytool/mylang/__init__.py` contains an entry:
fr: Le fichier `mytool/mylang/__init__.py` contient une entrée :
ta: `MyTool/mylang/__ init __. Py` ஒரு நுழைவு:
uk: Файл `mytool/mylang/__init__.py` містить запис:

source: `pyproject.toml` contains an entry point:
fr: `pyproject.toml` contient un point d'entrée :
ta: `pyproject.toml` ஒரு நுழைவு புள்ளியைக் கொண்டுள்ளது:
uk: `pyproject.toml` містить точку входу:

source: Connectors
es: Conectores
fr: Connecteurs
ta: இணைப்பிகள்
uk: Роз'єми

source: Connectors are used to connect one element to another.
es: Los conectores sirven para unir un elemento con otro.
fr: Les connecteurs sont utilisés pour relier un élément à un autre.
ta: ஒரு உறுப்பை இன்னொரு உறுப்பை இணைக்க இணைப்பிகள் பயன்படுத்தப்படுகின்றன.
uk: З’єднувачі служать для з’єднання одного елемента з іншим.

source: Connectors should adhere to the `ConnectorProtocol`. Normally you would inherit from `BaseConnector`.
es: Los conectores deben adherirse al `ConnectorProtocol`. Normalmente se hereda de `BaseConnector`.
fr: Les connecteurs doivent respecter le protocole `ConnectorProtocol`. Normalement, vous héritez de `BaseConnector`.
ta: இணைப்பிகள் `ConnectorProtocol` ஐ கடைபிடிக்க வேண்டும். பொதுவாக நீங்கள் `பேச் கோனெக்டர்` இலிருந்து பெறுவீர்கள்.
uk: Конектори мають відповідати `ConnectorProtocol`. Зазвичай ви успадкуєте від `BaseConnector`.

source: Connection adapter for Gaphor diagram items.
es: Adaptador de conexión para elementos del diagrama Gaphor.
fr: Adaptateur de connexion pour les éléments du diagramme Gaphor.
ta: கஃபர் வரைபட உருப்படிகளுக்கான இணைப்பு அடாப்டர்.
uk: Адаптер підключення для елементів схеми Gaphor.

source: Line item ``line`` connects with a handle to a connectable item ``element``.
es: El elemento de línea ``line`` se conecta con un manejador a un elemento conectable ``element``.
fr: L'élément ligne ``line`` se connecte avec une poignée à un élément connectable ``element``.
ta: வரி உருப்படி ``line`` இணைக்கக்கூடிய உருப்படி ``element`` உடன் கைப்பிடியுடன் இணைக்கிறது.
uk: Елемент прейскуранта ``line`` з’єднується за допомогою маркера з ``element`` елемента, який можна підключити.

source: Parameters
es: Parámetros
fr: Paramètres
ta: அளவுருக்கள்
uk: Параметри

source: connecting item
es: elemento de conexión
fr: élément de connexion
ta: உருப்படியை இணைக்கிறது
uk: сполучний елемент

source: connectable item
es: elemento conectable
fr: élément connectable
ta: இணைக்கக்கூடிய உருப்படி
uk: підключається елемент

source: By convention the adapters are registered by (element, line) -- in that order.
es: Por convención, los adaptadores se registran por (elemento, línea) -- en ese orden.
fr: Par convention, les adaptateurs sont enregistrés par (élément, ligne) -- dans cet ordre.
ta: மாநாட்டின் மூலம் அடாப்டர்கள் (உறுப்பு, வரி) மூலம் பதிவு செய்யப்படுகின்றன - அந்த வரிசையில்.
uk: За домовленістю адаптери реєструються за (елементом, лінією) -- у такому порядку.

source: Determine if items can be connected.
es: Determina si los elementos pueden conectarse.
fr: Détermine si les éléments peuvent être connectés.
ta: உருப்படிகளை இணைக்க முடியுமா என்பதை தீர்மானிக்கவும்.
uk: Визначте, чи можна з’єднати елементи.

source: Is the connection allowed at all (during mouse movement for example)?
fr: La connexion est-elle toujours autorisée, par exemple lorsque la souris se déplace ?
ta: இணைப்பு அனுமதிக்கப்படுகிறதா (எடுத்துக்காட்டாக சுட்டி இயக்கத்தின் போது)?
uk: Чи дозволено підключення взагалі (під час руху миші, наприклад)?

source: Returns `True` if connection is allowed.
es: Devuelve `True` si la conexión está permitida.
fr: Retourne `True` si la connexion est autorisée.
ta: இணைப்பு அனுமதிக்கப்பட்டால் `உண்மை` தருகிறது.
uk: Повертає `True`, якщо підключення дозволено.

source: Connect to an element.
fr: Se connecter à un élément.
ta: ஒரு உறுப்புடன் இணைக்கவும்.
uk: Підключитися до елемента.

source: Establish a connection between element and line. Also takes care of disconnects, if required (e.g. 1:1 relationships).
fr: Établir une connexion entre l'élément et la ligne. Prend également en charge les déconnexions, si nécessaire (par exemple, pour les relations 1:1).
ta: உறுப்பு மற்றும் வரிக்கு இடையில் ஒரு இணைப்பை நிறுவுங்கள். தேவைப்பட்டால் துண்டிக்கப்படுவதையும் கவனித்துக்கொள்கிறது (எ.கா. 1: 1 உறவுகள்).
uk: Встановіть зв'язок між елементом і лінією. Також піклується про роз’єднання, якщо потрібно (наприклад, відносини 1:1).

source: Note that at this point the line may be connected to some other, or the same element. The connection at model level also still exists.
fr: Notez qu'à ce stade, la ligne peut être connectée à un autre élément ou au même élément. La connexion au niveau du modèle reste valide.
ta: இந்த கட்டத்தில் வரி வேறு சில அல்லது அதே உறுப்புடன் இணைக்கப்படலாம் என்பதை நினைவில் கொள்க. மாதிரி மட்டத்தில் இணைப்பும் இன்னும் உள்ளது.
uk: Зауважте, що на цьому етапі лінія може бути з’єднана з іншим або тим же елементом. З’єднання на рівні моделі все ще існує.

source: Returns `True` if a connection is established.
es: Devuelve `True` si se ha establecido una conexión.
fr: Retourne `True` si une connexion est établie.
ta: ஒரு இணைப்பு நிறுவப்பட்டால் `உண்மை` தருகிறது.
uk: Повертає `True`, якщо з'єднання встановлено.

source: Disconnect model level connections.
es: Desconecte las conexiones de nivel de modelo.
fr: Déconnecter les connexions au niveau du modèle.
ta: மாதிரி நிலை இணைப்புகளைத் துண்டிக்கவும்.
uk: Від'єднайте з'єднання рівня моделі.

source: Break connection, called when dropping a handle on a point where it can not connect.
fr: Rupture de connexion, appelée lorsqu'on dépose une poignée sur un point où elle ne peut pas se connecter.
ta: ஒரு கைப்பிடியை இணைக்க முடியாத ஒரு கட்டத்தில் கைவிடும்போது அழைக்கப்படும் இணைப்பு.
uk: Розірвати з'єднання, викликається, коли дескриптор опускається в точку, де він не може з'єднатися.

source: Get item connected to a handle.
es: Obtener elemento conectado a un manejador.
fr: Obtenir un élément connecté à une poignée.
ta: ஒரு கைப்பிடியுடன் இணைக்கப்பட்ட உருப்படியைப் பெறுங்கள்.
uk: Приєднайте предмет до ручки.

source: Format and parse
fr: Formater et analyser
ta: வடிவம் மற்றும் பாகுபடுத்தல்
uk: Форматування та аналіз

source: Model elements can be formatted to a simple text representation. For example, This is used in the Model Browser. It isn't a full serialization of the model element.
fr: Les éléments de modèle peuvent être représentés sous forme textuelle. Par exemple, le navigateur de modèles utilise cette fonctionnalité. Il ne s'agit toutefois pas d'une conversion complète de l'élément de modèle.
ta: மாதிரி கூறுகளை எளிய உரை பிரதிநிதித்துவத்திற்கு வடிவமைக்க முடியும். எடுத்துக்காட்டாக, இது மாதிரி உலாவியில் பயன்படுத்தப்படுகிறது. இது மாதிரி உறுப்பின் முழு வரிசைப்படுத்தல் அல்ல.
uk: Елементи моделі можна відформатувати до простого текстового представлення. Наприклад, це використовується в переглядачі моделей. Це не повна серіалізація елемента моделі.

source: In some cases it's useful to parse a text back into an object. This is done when you edit attributes and operations on a class.
fr: Dans certains cas, il peut être utile d'analyser le texte afin de le réintégrer dans un objet. C'est notamment le cas lorsque l'on modifie les attributs et les opérations d'une classe.
ta: சில சந்தர்ப்பங்களில் ஒரு உரையை மீண்டும் ஒரு பொருளில் அலசுவது பயனுள்ளதாக இருக்கும். ஒரு வகுப்பில் பண்புகளையும் செயல்பாடுகளையும் நீங்கள் திருத்தும்போது இது செய்யப்படுகிறது.
uk: У деяких випадках корисно розібрати текст назад в об’єкт. Це робиться, коли ви редагуєте атрибути та операції над класом.

source: Not every ``format()`` needs to have an equivalent ``parse()`` function.
fr: Chaque ``format()`` n'a pas besoin d'avoir une fonction ``parse()`` équivalente.
ta: ஒவ்வொரு ``format()`` சமமான ``parse()`` செயல்பாடு தேவையில்லை.
uk: Не кожен ``format()`` повинен мати еквівалентну ``parse()`` функцію.

source: Returns a human readable representation of the model element. In most cases this is just the name, however, properties (attributes) and operations are formatted more extensively:
fr: Il renvoie une représentation lisible de l'élément de modèle. Dans la plupart des cas, il s'agit simplement du nom, mais les propriétés (attributs) et les opérations sont présentées de manière plus détaillée :
ta: மாதிரி உறுப்பின் மனித படிக்கக்கூடிய பிரதிநிதித்துவத்தை வழங்குகிறது. பெரும்பாலான சந்தர்ப்பங்களில் இது பெயர் மட்டுமே, இருப்பினும், பண்புகள் (பண்புக்கூறுகள்) மற்றும் செயல்பாடுகள் மிகவும் விரிவாக வடிவமைக்கப்பட்டுள்ளன:
uk: Повертає зрозуміле для людини представлення елемента моделі. У більшості випадків це лише ім’я, однак властивості (атрибути) та операції відформатовані більш широко:

source: Parse ``text`` and populate ``element``. The element is populated with elements from the text. This may mean that new model elements are created as part of the parse process.
fr: Analyse ``text`` et remplit ``element``. L'élément est alors rempli avec les éléments du texte. Cela peut signifier que de nouveaux éléments du modèle sont créés dans le cadre du processus d'analyse.
ta: ``text`` ஐ பாகுபடுத்தி, ``element``. உறுப்பு உரையின் உறுப்புகளுடன் உள்ளது. பார்சே செயல்முறையின் ஒரு பகுதியாக புதிய மாதிரி கூறுகள் உருவாக்கப்படுகின்றன என்று இது குறிக்கலாம்.
uk: Проаналізуйте ``текст`` і заповніть ``елемент``. Елемент заповнюється елементами з тексту. Це може означати, що нові елементи моделі створюються як частина процесу аналізу.

source: Copy and paste
es: Copiar y pegar
fr: Copier et coller
ta: நகலெடுத்து ஒட்டவும்
uk: Скопіюйте та вставте

source: Copy and paste works out of the box for simple items: one diagram item with one model element (the `subject`). It leverages the `load()` and `save()` methods of the elements to ensure all relevant data is copied.
fr: Le copier-coller fonctionne immédiatement pour des éléments simples, comme un élément de diagramme avec un élément de modèle (le `subject`). Il s'appuie sur les méthodes `load()` et `save()` des éléments pour s'assurer que toutes les données pertinentes sont copiées.
ta: எளிய உருப்படிகளுக்கான பெட்டியிலிருந்து நகலெடுத்து ஒட்டவும்: ஒரு மாதிரி உறுப்புடன் ஒரு வரைபட உருப்படி (`பொருள்`). இது தொடர்புடைய அனைத்து தரவும் நகலெடுக்கப்படுவதை உறுதிசெய்ய உறுப்புகளின் `சுமை ()` மற்றும் `சேமி ()` முறைகளை மேம்படுத்துகிறது.
uk: Копіювання та вставка працює "з коробки" для простих елементів: один елемент діаграми з одним елементом моделі ("об'єкт"). Він використовує методи `load()` і `ave()` елементів, щоб забезпечити копіювання всіх необхідних даних.

source: Sometimes items need more than one model element to work. For example an Association: it has two association ends.
es: A veces los elementos necesitan más de un elemento del modelo para funcionar. Por ejemplo una asociación: tiene dos extremos de asociación.
fr: Parfois, certains éléments ont besoin de plus d'un élément du modèle pour fonctionner. Une association, par exemple, a deux extrémités.
ta: சில நேரங்களில் உருப்படிகளுக்கு வேலை செய்ய ஒன்றுக்கு மேற்பட்ட மாதிரி கூறுகள் தேவை. எடுத்துக்காட்டாக ஒரு சங்கம்: இது இரண்டு சங்க முடிவுகளைக் கொண்டுள்ளது.
uk: Іноді для роботи елементів потрібно більше ніж один елемент моделі. Наприклад, асоціація: вона має два кінці асоціації.

source: In those specific cases you need to implement your own copy and paste functions. To create such a thing you'll need to create two functions: one for copying and one for pasting.
es: En esos casos específicos necesita implementar sus propias funciones de copiar y pegar. Para crear algo así necesitará crear dos funciones: una para copiar y otra para pegar.
fr: Dans ces cas spécifiques, vous devez implémenter vos propres fonctions de copier-coller. Pour ce faire, vous devez créer deux fonctions : l'une pour copier et l'autre pour coller.
ta: அந்த குறிப்பிட்ட சந்தர்ப்பங்களில் நீங்கள் உங்கள் சொந்த நகலை செயல்படுத்த வேண்டும் மற்றும் செயல்பாடுகளை ஒட்ட வேண்டும். அத்தகைய ஒரு விசயத்தை உருவாக்க நீங்கள் இரண்டு செயல்பாடுகளை உருவாக்க வேண்டும்: ஒன்று நகலெடுப்பதற்கும் ஒன்று ஒட்டுவதற்கு.
uk: У цих конкретних випадках вам потрібно реалізувати власні функції копіювання та вставлення. Щоб створити таку річ, вам потрібно буде створити дві функції: одну для копіювання та одну для вставки.

source: Create a copy of an element (or list of elements). The returned type should be distinct, so the `paste()` function can properly dispatch. A copy function normally copies only the element and mandatory related elements. E.g. an Association needs two association ends.
fr: Créer une copie d'un élément (ou d'une liste d'éléments). Le type de retour doit être distinct afin que la fonction `paste()`puisse être correctement distribuée. Une fonction de copie ne copie normalement que l'élément et les éléments connexes obligatoires. Par exemple, une association a besoin de deux extrémités.
ta: ஒரு உறுப்பின் நகலை உருவாக்கவும் (அல்லது உறுப்புகளின் பட்டியல்). திரும்பிய வகை வேறுபட்டதாக இருக்க வேண்டும், எனவே `பேச்ட் ()` செயல்பாடு சரியாக அனுப்பலாம். ஒரு நகல் செயல்பாடு பொதுவாக உறுப்பு மற்றும் கட்டாய தொடர்பான கூறுகளை மட்டுமே நகலெடுக்கிறது. எ.கா. ஒரு சங்கத்திற்கு இரண்டு சங்க முடிவுகள் தேவை.
uk: Створити копію елемента (або списку елементів). Тип, що повертається, має бути відмінним, щоб функція `paste()` могла коректно виконати копіювання. Функція копіювання зазвичай копіює лише елемент і обов'язково пов'язані з ним елементи. Наприклад, асоціація потребує два кінці асоціації.

source: Paste previously copied data. Based on the data type created in the ``copy()`` function, try to duplicate the copied elements. Returns the newly created item or element.
fr: Collez les données précédemment recopiées. Dupliquez les éléments copiés en fonction du type de données créé dans la fonction ``copy()``. Renvoie l'élément nouvellement créé.
ta: முன்னர் நகலெடுத்த தரவை ஒட்டவும். ``copy()`` செயல்பாட்டில் உருவாக்கப்பட்ட தரவு வகையின் அடிப்படையில், நகலெடுக்கப்பட்ட கூறுகளை நகலெடுக்க முயற்சிக்கவும். புதிதாக உருவாக்கப்பட்ட உருப்படி அல்லது உறுப்பை வழங்குகிறது.
uk: Вставте раніше скопійовані дані. На основі типу даних, створеного у функції ``copy()``, спробуйте скопіювати скопійовані елементи. Повертає щойно створений елемент або елемент.

source: Gaphor provides some convenience functions:
fr: Gaphor fournit quelques fonctions de confort :
ta: கஃபர் சில வசதியான செயல்பாடுகளை வழங்குகிறது:
uk: Gaphor надає деякі зручні функції:

source: Copy ``items``. The ``lookup`` function is used to look up owned elements (shown as child nodes in the Model Browser).
fr: Copier ``items``. La fonction ``lookup`` est utilisée pour rechercher les éléments possédés (affichés comme des noeuds enfants dans le navigateur de modèle).
ta: ``items`` நகலெடுக்கவும். ``lookup`` செயல்பாடு சொந்தமான கூறுகளைக் காணப் பயன்படுகிறது (மாதிரி உலாவியில் குழந்தை முனைகளாக காட்டப்பட்டுள்ளது).
uk: Копіювати ``items``. Функція ``lookup`` використовується для пошуку належних елементів (відображених як дочірні вузли у браузері моделей).
