Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: You'll need to [fork](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/working-with-forks/fork-a-repo) Gaphor and set up a [development environment](linux.md) ([macOS](macos.md), [Windows](windows.md)).
fr: Vous devrez [forker](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/working-with-forks/fork-a-repo) Gaphor et mettre en place un [environnement de développement](linux.md) ([macOS](macos.md), [Windows](windows.md)).
ta: நீங்கள் [fork](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/working-with-forks/fork-a-repo) கஃபோரை நிறுவி [development environment](linux.md) ([macOS](macos.md), [Windows](windows.md)) ஐ அமைக்க வேண்டும்.
uk: Вам потрібно [форкнути](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/working-with-forks/fork-a-repo) Gaphor і встановити [середовище розробки](linux.md) ([macOS](macos.md), [Windows](windows.md)).

source: In our pipeline we do a couple of quality checks. We strongly recommend that you [install pre-commit](https://pre-commit.com/) and its git hook scripts, so your PR does build on our build environment.
fr: Dans notre pipeline, nous effectuons quelques contrôles de qualité. Nous vous recommandons fortement d'[installer pre-commit](https://pre-commit.com/) et ses scripts git hook, afin que votre PR soit construit dans notre environnement de construction.
ta: எங்கள் குழாய்த்திட்டத்தில் நாங்கள் இரண்டு தரமான சோதனைகளை செய்கிறோம். நீங்கள் [முன்-கமிட்](https://pre-commit.com/) மற்றும் அதன் அறிவிலி ஊக் ச்கிரிப்ட்களை நிறுவ வேண்டும் என்று நாங்கள் கடுமையாக பரிந்துரைக்கிறோம், எனவே உங்கள் பிஆர் எங்கள் உருவாக்க சூழலில் உருவாக்குகிறது.
uk: На нашому етапі ми проводимо кілька перевірок якості. Ми наполегливо рекомендуємо вам [установити pre-commit](https://pre-commit.com/) і його сценарії git hook, щоб ваш PR базувався на нашому середовищі збірки.

source: Design Principles
es: Principios de diseño
fr: Principes de conception
ta: வடிவமைப்பு கொள்கைகள்
uk: Принципи проектування

source: Gaphor has been around for quite a few years. In those years we (the Gaphor developers) learned a few things on how to build it. Gaphor tries to be easily accessible for novice users as well as a useful tool for more experienced users.
es: Gaphor existe desde hace bastantes años. En esos años nosotros (los desarrolladores de Gaphor) aprendimos algunas cosas sobre cómo construirlo. Gaphor intenta ser fácilmente accesible para los usuarios principiantes, así como una herramienta útil para los usuarios más experimentados.
fr: Gaphor existe depuis plusieurs années. Au cours de ces années, nous (les développeurs de Gaphor) avons appris plusieurs choses sur la façon de le construire. Gaphor vise à être facilement accessible aux utilisateurs novices tout en restant un outil utile pour les utilisateurs plus expérimentés.
ta: காஃபர் சில ஆண்டுகளாக இருக்கிறார். அந்த ஆண்டுகளில் (காஃபர் டெவலப்பர்கள்) அதை எவ்வாறு உருவாக்குவது என்பது குறித்து சில விசயங்களைக் கற்றுக்கொண்டோம். புதிய பயனர்களுக்கு எளிதாக அணுகக்கூடியதாக கேஃபர் முயற்சிக்கிறார், மேலும் பட்டறிவு வாய்ந்த பயனர்களுக்கு ஒரு பயனுள்ள கருவியாகும்.
uk: Gaphor існує вже досить багато років. За ці роки ми (розробники Gaphor) дізналися кілька речей про те, як його створювати. Gaphor намагається бути легко доступним для користувачів-початківців, а також корисним інструментом для більш досвідчених користувачів.

source: Gaphor is not your average editor. It's a modeling environment. This implies there is a language underpinning the models. Languages adhere to rules and Gaphor tries to follow those rules.
es: Gaphor no es un editor al uso. Es un entorno de modelado. Esto implica que hay un lenguaje que sustenta los modelos. Los lenguajes se adhieren a reglas y Gaphor intenta seguir esas reglas.
fr: Gaphor n'est pas un éditeur ordinaire. C'est un environnement de modélisation. Cela implique qu'il y a un langage qui sous-tend les modèles. Les langages obéissent à des règles et Gaphor essaie de suivre ces règles.
ta: கஃபர் உங்கள் சராசரி ஆசிரியர் அல்ல. இது ஒரு மாடலிங் சூழல். மாதிரிகள் அடித்தளமாக இருக்கும் மொழி இருப்பதை இது குறிக்கிறது. மொழிகள் விதிகளை கடைபிடிக்கின்றன, மேலும் காஃபர் அந்த விதிகளைப் பின்பற்ற முயற்சிக்கிறார்.
uk: Gaphor — не звичайний редактор. Це модельне середовище. Це означає, що існує мова, що лежить в основі моделей. Мови дотримуються правил, і Gaphor намагається дотримуватися цих правил.

source: Usability is very important. When you're new to Gaphor, it should be easy to find your way around. Minimal knowledge of UML should at least allow you to create a class diagram.
es: La usabilidad es muy importante. Cuando se es nuevo en Gaphor, debe ser fácil orientarse. Un conocimiento mínimo de UML debería al menos permitirle crear un diagrama de clases.
fr: La facilité d'utilisation est très importante. Lorsque vous découvrez Gaphor, il doit être facile de s'y retrouver. Une connaissance minimale de l'UML devrait au moins vous permettre de créer un diagramme de classes.
ta: பயன்பாட்டினை மிகவும் முக்கியமானது. நீங்கள் கஃபருக்கு புதியதாக இருக்கும்போது, உங்கள் வழியைக் கண்டுபிடிப்பது எளிதாக இருக்க வேண்டும். யுஎம்எல் பற்றிய குறைந்தபட்ச அறிவு குறைந்தபட்சம் ஒரு வகுப்பு வரைபடத்தை உருவாக்க உங்களை அனுமதிக்க வேண்டும்.
uk: Зручність використання дуже важлива. Якщо ви новачок у Gaphor, вам буде легко зорієнтуватися. Мінімальні знання UML повинні принаймні дозволити вам створити діаграму класів.

source: Guidance
es: Orientación
fr: Orientations
ta: வான் வழிநடை
uk: Керівництво

source: To help users, Gaphor should provide guidance where it can.
es: Para ayudar a los usuarios, Gaphor debe proporcionar orientación siempre que pueda.
fr: Pour aider les utilisateurs, Gaphor doit fournir des conseils dans la mesure du possible.
ta: பயனர்களுக்கு உதவ, காஃபர் தன்னால் முடிந்த இடத்தில் வழிகாட்டுதலை வழங்க வேண்டும்.
uk: Щоб допомогти користувачам, Gaphor має надавати вказівки, де це можливо.

source: Help with relationships
es: Ayuda con las relaciones
fr: Aide aux relations
ta: உறவுகளுக்கு உதவுங்கள்
uk: Допомога у відносинах

source: The diagram has a feature that it grays out all elements a relationship can not connect to. This helps you to decide where a relation can connect to. You can still mix different elements, but we try to make it as simple as possible to make consistent models.
es: El diagrama muestra en gris todos los elementos a los que no puede conectarse una relación. Esto ayuda a decidir dónde puede conectarse una relación. Puede mezclar diferentes elementos, pero intentamos que sea lo más sencillo posible para crear modelos coherentes.
fr: Le diagramme présente une caractéristique qui consiste à griser tous les éléments auxquels une relation ne peut pas être établie. Cela vous aide à décider où une relation peut être établie. Vous pouvez toujours mélanger différents éléments, mais nous essayons de simplifier autant que possible la création de modèles cohérents.
ta: ஒரு உறவுடன் இணைக்க முடியாத அனைத்து கூறுகளையும் அது உருவாக்கும் ஒரு நற்பொருத்தம் வரைபடத்தில் உள்ளது. ஒரு உறவு எங்கு இணைக்க முடியும் என்பதை தீர்மானிக்க இது உங்களுக்கு உதவுகிறது. நீங்கள் இன்னும் வெவ்வேறு கூறுகளை கலக்கலாம், ஆனால் நிலையான மாதிரிகளை உருவாக்க முடிந்தவரை எளிமையாக்க முயற்சிக்கிறோம்.
uk: Діаграма має особливість: вона зафарбовує сірим кольором всі елементи, з якими зв'язок не може з'єднатися. Це допомагає вам вирішити, з чим може з'єднуватися зв'язок. Ви все ще можете змішувати різні елементи, але ми намагаємося зробити це якомога простіше, щоб створювати узгоджені моделі.

source: Keep the model in sync
es: Mantener el modelo sincronizado
fr: Maintenir la synchronisation du modèle
ta: மாதிரியை ஒத்திசைவாக வைத்திருங்கள்
uk: Тримайте модель в синхронізації

source: An important part of modeling is to design a system in abstractions and be able to explain those to others. As systems become more complicated, it's important to have the design (model) layed out in diagrams.
es: Una parte importante del modelado es diseñar un sistema en abstracciones y ser capaz de explicarlas a otros. A medida que los sistemas se complican, es importante disponer del diseño (modelo) en diagramas.
fr: Une partie importante de la modélisation consiste à concevoir un système sous forme d'abstractions et à être capable de les expliquer à d'autres. Au fur et à mesure que les systèmes deviennent plus complexes, il est important de présenter la conception (le modèle) sous forme de diagrammes.
ta: மாடலிங் ஒரு முக்கிய பகுதியாகும், இது ஒரு அமைப்பை சுருக்கங்களில் வடிவமைப்பது மற்றும் அவற்றை மற்றவர்களுக்கு விளக்க முடியும். அமைப்புகள் மிகவும் சிக்கலானதாக மாறும் போது, வடிவமைப்பு (மாதிரி) வரைபடங்களில் அமைக்கப்படுவது முதன்மை.
uk: Важливою частиною моделювання є розробка системи в абстракціях і вміння пояснювати їх іншим. Оскільки системи стають складнішими, важливо, щоб дизайн (модель) був викладений у вигляді діаграм.

source: Gaphor goes through great lengths to keep the model in sync with the diagrams. In doing so, unused elements can be automatically removed from the model if they're no longer shown in any diagram.
es: Gaphor hace todo lo posible para mantener el modelo sincronizado con los diagramas. De este modo, los elementos no usados pueden eliminarse automáticamente del modelo si ya no se muestran en ningún diagrama.
fr: Gaphor veille à ce que le modèle soit en phase avec les diagrammes. Ainsi, les éléments inutilisés peuvent être automatiquement supprimés du modèle s'ils ne figurent plus dans aucun de ces derniers.
ta: வரைபடங்களுடன் மாதிரியை ஒத்திசைக்க கஃபர் அதிக நீளத்தை கடந்து செல்கிறது. அவ்வாறு செய்யும்போது, பயன்படுத்தப்படாத கூறுகள் எந்தவொரு வரைபடத்திலும் இனி காட்டப்படாவிட்டால் அவை மாதிரியிலிருந்து தானாகவே அகற்றப்படும்.
uk: Gaphor докладає чимало зусиль, щоб підтримувати синхронізацію моделі з діаграмами. При цьому невикористовувані елементи можуть бути автоматично видалені з моделі, якщо вони більше не відображаються на жодній діаграмі.

source: Out of your way
es: Fuera de su camino
fr: Hors de votre chemin
ta: உங்கள் வழியில் இல்லை
uk: З твоєї дороги

source: When modeling, you should be busy with your problem or solution domain, not with the tool. Gaphor tries to stay out of your way as much as possible. It does not try to nag you with error messages, because the model is not "correct".
es: Al modelar, debe estar ocupado con su problema o dominio de solución, no con la herramienta. Gaphor intenta mantenerse al margen en la medida de lo posible. No trata de fastidiarle con mensajes de error, porque el modelo no es "correcto".
fr: Lors de la modélisation, vous devez vous concentrer sur votre problème ou votre solution, et non sur l'outil. Gaphor essaie de rester hors de votre chemin autant que possible. Il ne vous harcèle pas avec des messages d'erreur parce que le modèle n'est pas « correct ».
ta: மாடலிங் செய்யும் போது, உங்கள் சிக்கல் அல்லது தீர்வு களத்தில் நீங்கள் பிசியாக இருக்க வேண்டும், கருவியுடன் அல்ல. காஃபர் முடிந்தவரை உங்கள் வழியிலிருந்து விலகி இருக்க முயற்சிக்கிறார். இது பிழை செய்திகளைக் கொண்டு செல்ல முயற்சிக்கவில்லை, ஏனெனில் மாதிரி "சரியானது" அல்ல.
uk: Під час моделювання ви повинні бути зайняті своєю проблемою або областю рішення, а не інструментом. Gaphor намагається не заважати вам, наскільки це можливо. Він не намагається надокучати вам повідомленнями про помилки, тому що модель не є "правильною".

source: Avoid dialogs
es: Evitar diálogos
fr: Éviter les boîtes de dialogue
ta: உரையாடல்களைத் தவிர்க்கவும்
uk: Уникайте діалогів

source: In doing the right thing, and staying out of the way of users, Gaphor avoids the use of dialogs as much as possible.
es: Para hacer lo correcto y no estorbar a los usuarios, Gaphor evita en lo posible el uso de diálogos.
fr: En prenant les mesures nécessaires et en évitant tout contact avec les utilisateurs, Gaphor parvient à limiter l'apparition de boîtes de dialogue.
ta: சரியானதைச் செய்வதிலும், பயனர்களின் வழியிலிருந்து விலகி இருப்பதிலும், காஃபர் முடிந்தவரை உரையாடல்களைப் பயன்படுத்துவதைத் தவிர்க்கிறார்.
uk: Роблячи правильні речі та не заважаючи користувачам, Gaphor уникає використання діалогів, наскільки це можливо.

source: Gaphor should allow you to do the sensible thing (see above) and not get you out of your flow with all sorts of questions.
es: Gaphor debe permitirle hacer lo más sensato (véase más arriba) y no sacarle de sus casillas con todo tipo de preguntas.
fr: Gaphor doit vous permettre de faire ce qui est raisonnable (voir ci-dessus) et ne pas vous faire perdre le fil avec toutes sortes de questions.
ta: விவேகமான காரியத்தைச் செய்ய கஃபர் உங்களை அனுமதிக்க வேண்டும் (மேலே காண்க) மற்றும் எல்லா வகையான கேள்விகளுடனும் உங்கள் ஓட்டத்திலிருந்து வெளியேறக்கூடாது.
uk: Gaphor має дозволити вам робити розумні речі (див. вище), а не виводити вас із потоку всілякими запитаннями.

source: Notify on changes
es: Notificar cambios
fr: Notifier les changements
ta: மாற்றங்கள் குறித்து அறிவிக்கவும்
uk: Повідомляти про зміни

source: When Gaphor is doing something that is not directly visible, you'll see a notification, for example, an element that's indirectly removed from the model. It will not interrupt you with dialogs, but only provide a small in-app notification. If the change is undesired, hit `undo`.
es: Cuando Gaphor está haciendo algo que no es directamente visible, verá una notificación, por ejemplo, un elemento que se elimina indirectamente del modelo. No le interrumpirá con diálogos, sino que sólo proporcionará una pequeña notificación en la aplicación. Si el cambio no es deseado, pulse `deshacer`.
fr: Lorsque Gaphor effectue une action qui n'est pas directement visible, vous verrez une notification. Cela peut par exemple concerner un élément retiré indirectement du modèle. Cela ne provoquera pas de dialogues, mais vous informera simplement de la situation par une notification dans l'application. Si vous ne souhaitez pas ce changement, cliquez sur `undo`.
ta: கேஃபர் நேரடியாகத் தெரியாத ஒன்றைச் செய்யும்போது, நீங்கள் ஒரு அறிவிப்பைக் காண்பீர்கள், எடுத்துக்காட்டாக, மாதிரியிலிருந்து மறைமுகமாக அகற்றப்பட்ட ஒரு உறுப்பு. இது உரையாடல்களுடன் உங்களை குறுக்கிடாது, ஆனால் பயன்பாட்டில் உள்ள ஒரு சிறிய அறிவிப்பை மட்டுமே வழங்கும். மாற்றம் விரும்பத்தகாததாக இருந்தால், `செயல்தவிர்` ஐ அழுத்தவும்.
uk: Коли Gaphor робить щось, що не видно безпосередньо, ви побачите сповіщення, наприклад, про те, що елемент непрямим чином видаляється з моделі. Це не буде переривати вас діалогами, а лише надасть невелике сповіщення в додатку. Якщо зміна небажана, натисніть "скасувати".

source: Balanced
es: Equilibrado
fr: Équilibré
ta: சமநிலையானது
uk: Збалансований

source: Although Gaphor implements quite a bit of the UML 2 model, it's not complete. We try to find the right balance in features to suite both expert and novice modellers.
es: Aunque Gaphor implementa gran parte del modelo UML 2, no está completo. Intentamos encontrar el equilibrio adecuado en las características para satisfacer tanto a los modeladores expertos como a los principiantes.
fr: Bien que Gaphor implémente une bonne partie du modèle UML 2, il n'est pas complet. Notre objectif est de trouver le bon équilibre entre les fonctionnalités afin de satisfaire à la fois les modélisateurs experts et novices.
ta: யுஎம்எல் 2 மாடலின் கொஞ்சம் கொஞ்சமாக கஃபர் செயல்படுத்தினாலும், அது முழுமையடையவில்லை. வல்லுநர் மற்றும் புதிய மாடலர்கள் இருவரையும் பொருத்த அம்சங்களில் சரியான சமநிலையைக் கண்டுபிடிக்க முயற்சிக்கிறோம்.
uk: Хоча Gaphor реалізує досить багато моделі UML 2, він не є повним. Ми намагаємося знайти правильний баланс у функціях, щоб підходити як експертам, так і новачкам.

source: Continuity
es: Continuidad
fr: Continuité
ta: தொடர்ச்சி
uk: Безперервність

source: A model that is created should be usable in the future. Gaphor does acknowledge that. We care about compatibility.
es: Un modelo creado debe poder usarse en el futuro. Gaphor lo reconoce. Nos importa la compatibilidad.
fr: Un modèle créé doit pouvoir être utilisé à l'avenir. Gaphor le reconnaît. Nous nous soucions de la compatibilité.
ta: உருவாக்கப்பட்ட ஒரு மாதிரி எதிர்காலத்தில் பயன்படுத்தக்கூடியதாக இருக்க வேண்டும். கஃபர் அதை ஒப்புக்கொள்கிறார். பொருந்தக்கூடிய தன்மையைப் பற்றி நாங்கள் கவலைப்படுகிறோம்.
uk: Створена модель повинна бути придатною для використання в майбутньому. Гафор це визнає. Ми дбаємо про сумісність.

source: Backwards compatibility
es: Compatibilidad con versiones anteriores
fr: Compatibilité ascendante
ta: பின்னோக்கி பொருந்தக்கூடிய தன்மை
uk: Зворотна сумісність

source: Gaphor is capable of loading models going back to Gaphor 1.0. It's important for a tool to always allow older models to be loaded.
es: Gaphor es capaz de cargar modelos que se remontan a Gaphor 1.0. Es importante que una herramienta siempre permita cargar modelos antiguos.
fr: Gaphor est capable de charger des modèles remontant à Gaphor 1.0. Il est important qu'un outil permette toujours le chargement de modèles plus anciens.
ta: கஃபர் 1.0 க்குச் செல்லும் மாதிரிகளை ஏற்றும் திறன் கொண்டது. பழைய மாதிரிகளை ஏற்றுவதற்கு ஒரு கருவி எப்போதும் அனுமதிப்பது முதன்மை.
uk: Gaphor здатний завантажувати моделі, починаючи з Gaphor 1.0. Важливо, щоб інструмент завжди дозволяв завантажувати старіші моделі.

source: Multi-platform
es: Multiplataforma
fr: Multiplateforme
ta: பலதளம்
uk: Мультиплатформенність

source: We put a lot of effort in making Gaphor run on all major platforms: Windows, macOS, and Linux. Having Gaphor available on all platforms is essential if the model needs to be shared. It would be awful if you need to run one specific operating system in order to open a model.
es: Nos hemos esforzado mucho para que Gaphor funcione en las principales plataformas: Windows, macOS y Linux. Disponer de Gaphor en todas las plataformas es esencial si se quiere compartir el modelo. Sería horrible tener que ejecutar un sistema operativo específico para abrir un modelo.
fr: Nous avons déployé d'importants efforts pour garantir la prise en charge de Gaphor sur les principales plateformes : Windows, macOS et Linux. Si le modèle doit être partagé, il est essentiel que Gaphor soit disponible sur toutes les plateformes. Il serait terrible de devoir utiliser un système d'exploitation spécifique pour ouvrir un modèle.
ta: சாளரங்கள், மேகோச் மற்றும் லினக்ச் ஆகிய அனைத்து முக்கிய தளங்களிலும் கஃபரை இயக்குவதில் நாங்கள் நிறைய முயற்சி செய்கிறோம். மாதிரியைப் பகிர வேண்டியிருந்தால் அனைத்து தளங்களிலும் கஃபர் கிடைப்பது தேவை. ஒரு மாதிரியைத் திறக்க நீங்கள் ஒரு குறிப்பிட்ட இயக்க முறைமையை இயக்க வேண்டும் என்றால் அது மோசமாக இருக்கும்.
uk: Ми доклали багато зусиль, щоб Gaphor працював на всіх основних платформах: Windows, macOS та Linux. Наявність Gaphor на всіх платформах дуже важлива, якщо модель потребує спільного використання. Було б жахливо, якби для того, щоб відкрити модель, вам потрібно було б запустити одну конкретну операційну систему.

source: So far, we do not support the fourth major platform (web). Native applications provide a better user experience (once installed). But this may change.
es: Hasta ahora, no soportamos la cuarta plataforma principal (web). Las aplicaciones nativas ofrecen una mejor experiencia de usuario (una vez instaladas). Pero esto puede cambiar.
fr: Jusqu'à présent, nous ne prenions pas en charge la quatrième plate-forme majeure (le Web). Les applications natives offrent une meilleure expérience utilisateur une fois installées. Mais cela pourrait changer.
ta: இதுவரை, நாங்கள் நான்காவது பெரிய தளத்தை (வலை) ஆதரிக்கவில்லை. சொந்த பயன்பாடுகள் சிறந்த பயனர் அனுபவத்தை வழங்குகின்றன (நிறுவப்பட்டதும்). ஆனால் இது மாறக்கூடும்.
uk: Наразі ми не підтримуємо четверту основну платформу (веб). Власні програми забезпечують кращий досвід користувача (після встановлення). Але це може змінитися.

source: User interaction
es: Interacción del usuario
fr: Interaction avec l'utilisateur
ta: பயனர் தொடர்பு
uk: Взаємодія з користувачем

source: Gaphor is originally written on Linux. It uses [GTK](https://gtk.org) as it's user interface toolkit. This sort of implies that Gaphor follows the [GNOME Human Interface Guidelines (HIG)](https://developer.gnome.org/hig/). Gaphor is also a multi-platform application. We try to stay close to the GNOME HIG, but try not to introduce concepts that are not available on Windows and macOS.
es: Gaphor está escrito originalmente en Linux. Usa [GTK](https://gtk.org) como interfaz de usuario. Esto implica que Gaphor sigue las [GNOME Human Interface Guidelines (HIG)](https://developer.gnome.org/hig/). Gaphor es también una aplicación multiplataforma. Tratamos de mantenernos cerca de las HIG de GNOME, pero tratamos de no introducir conceptos que no están disponibles en Windows y macOS.
fr: Gaphor a été écrit à l'origine sous Linux. Il utilise [GTK](https://gtk.org) comme boîte à outils pour l'interface utilisateur. Cela implique en quelque sorte que Gaphor suit les [GNOME Human Interface Guidelines (HIG)](https://developer.gnome.org/hig/). Gaphor est également une application multiplateforme. Nous essayons de rester proches des GNOME HIG, mais nous essayons de ne pas introduire des concepts qui ne sont pas disponibles sous Windows et macOS.
ta: காஃபர் முதலில் லினக்சில் எழுதப்பட்டுள்ளது. இது பயனர் இடைமுக கருவித்தொகுப்பாக [GTK](https://gtk.org) ஐப் பயன்படுத்துகிறது. இந்த வகையான கேஃபர் [க்னோம் மனித இடைமுக வழிகாட்டுதல்களை (HIG)](https://developer.gnome.org/hig/) ஐப் பின்பற்றுகிறது என்பதைக் குறிக்கிறது. காஃபர் பல-தளம் பயன்பாடாகும். நாங்கள் க்னோம் இக் உடன் நெருக்கமாக இருக்க முயற்சிக்கிறோம், ஆனால் சாளரங்கள் மற்றும் மேகோசில் கிடைக்காத கருத்துக்களை அறிமுகப்படுத்த முயற்சிக்காதீர்கள்.
uk: Gaphor спочатку написано на Linux. Вона використовує [GTK](https://gtk.org) як інструментарій інтерфейсу користувача. Це означає, що Gaphor дотримується [GNOME Human Interface Guidelines (HIG)] (https://developer.gnome.org/hig/). Gaphor також є багатоплатформною програмою. Ми намагаємося дотримуватися GNOME HIG, але намагаємося не вводити концепції, недоступні у Windows і macOS.

source: User interface components are not generated. We found that UI generation (like many enterprise modeling tools do) provides an awful user experience. We want users to use Gaphor on a regular basis, so we aim for it to be a tool that's pleasant to look at and easy to work with.
es: No se generan componentes de interfaz de usuario. Nos dimos cuenta de que la generación de interfaz de usuario (al igual que muchas herramientas de modelado empresarial) proporciona una experiencia de usuario horrible. Queremos que los usuarios usen Gaphor con regularidad, así que nuestro objetivo es que sea una herramienta agradable a la vista y con la que sea fácil trabajar.
fr: Les composants de l'interface utilisateur ne sont pas générés. Nous avons constaté que la génération d'interfaces utilisateur (comme le font de nombreux outils de modélisation d'entreprise) n'offre pas une expérience utilisateur optimale. Nous voulons que les utilisateurs se servent régulièrement de Gaphor, c'est pourquoi nous voulons que cet outil soit agréable à utiliser et facile à regarder.
ta: பயனர் இடைமுக கூறுகள் உருவாக்கப்படவில்லை. இடைமுகம் தலைமுறை (பல நிறுவன மாடலிங் கருவிகளைப் போல) ஒரு மோசமான பயனர் அனுபவத்தை வழங்குகிறது என்பதை நாங்கள் கண்டறிந்தோம். பயனர்கள் ஒரு வழக்கமான அடிப்படையில் GAPHOR ஐப் பயன்படுத்த வேண்டும் என்று நாங்கள் விரும்புகிறோம், எனவே இது ஒரு கருவியாக இருக்க வேண்டும் என்பதை நாங்கள் நோக்கமாகக் கொண்டுள்ளோம்.
uk: Компоненти інтерфейсу користувача не генеруються. Ми виявили, що генерація інтерфейсу користувача (як це роблять багато інструментів корпоративного моделювання) забезпечує жахливий користувацький досвід. Ми хочемо, щоб користувачі використовували Gaphor на регулярній основі, тому ми прагнемо, щоб він був інструментом, на який приємно дивитися і з яким легко працювати.

source: What else?
es: ¿Qué más?
fr: Quoi d'autre ?
ta: வேறு என்ன?
uk: Що ще?
