Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: The diagram section contains diagrams of the model and takes up the most space in the UI because it is where most of the modeling is done. Diagrams consist of items placed on the diagram. There are two main types of items:
es: La sección de diagramas contiene diagramas del modelo y es la que ocupa más espacio en la interfaz de usuario porque es donde se realiza la mayor parte del modelado. Los diagramas constan de elementos colocados en el diagrama. Hay dos tipos principales de elementos:
fr: La section des diagrammes contient les diagrammes du modèle et occupe le plus d'espace dans l'interface utilisateur, car c'est là que se fait la majeure partie de la modélisation. Les diagrammes sont constitués d'éléments placés sur le diagramme. Il existe deux types principaux d'éléments :
ta: வரைபடப் பிரிவில் மாதிரியின் வரைபடங்கள் உள்ளன மற்றும் இடைமுகம் இல் அதிக இடத்தை எடுத்துக்கொள்கின்றன, ஏனென்றால் பெரும்பாலான மாடலிங் செய்யப்படும் இடமாகும். வரைபடங்கள் வரைபடத்தில் வைக்கப்பட்டுள்ள உருப்படிகளைக் கொண்டுள்ளன. இரண்டு முக்கிய வகை உருப்படிகள் உள்ளன:
uk: Розділ діаграм містить діаграми моделі і займає найбільше місця в інтерфейсі, оскільки саме тут виконується більша частина моделювання. Діаграми складаються з елементів, розміщених на діаграмі. Існує два основних типи елементів:

source: Elements
es: Elementos
fr: Éléments
ta: கூறுகள்
uk: Елементи

source: Relationships
es: Relaciones
fr: Les relations
ta: உறவுகள்
uk: Стосунки

source: Multiple diagrams can be opened at once: they are shown in tabs. Tabs can be closed by pressing <kbd>Ctrl</kbd>+<kbd>w</kbd> or left-clicking on the x in the diagram tab.
es: Se pueden abrir varios diagramas a la vez: se muestran en pestañas. Las pestañas se pueden cerrar pulsando <kbd>Ctrl</kbd>+<kbd>w</kbd> o haciendo clic con el botón izquierdo del ratón en la x de la pestaña del diagrama.
fr: Plusieurs diagrammes peuvent être ouverts simultanément : ils sont affichés dans des onglets. Les onglets peuvent être fermés en appuyant sur <kbd>Ctrl</kbd>+<kbd>w</kbd> ouclic-gauche sur le x dans l'onglet diagramme.
ta: பல வரைபடங்கள் ஒரே நேரத்தில் திறக்கப்படலாம்: அவை தாவல்களில் காட்டப்பட்டுள்ளன. <kbd>கட்டுப்பாடு</kbd>+<kbd>w</kbd> அல்லது வரைபட தாவலில் ஃச் இல் இடது சொடுக்கு செய்வதன் மூலம் தாவல்களை மூடலாம்.
uk: Можна відкрити кілька діаграм одночасно: вони відображаються у вкладках. Вкладки можна закрити, натиснувши <kbd>Ctrl</kbd>+<kbd>w</kbd> або клацнувши лівою кнопкою миші на x у вкладці діаграми.

source: Elements are the shapes that you add to a diagram, and together with Relations, allow you to build up a model.
es: Los elementos son las formas que se añaden a un diagrama y, junto con las Relaciones, permiten construir un modelo.
fr: Les éléments sont les formes que vous ajoutez à un diagramme et qui, avec les relations, vous permettent de construire un modèle.
ta: கூறுகள் என்பது நீங்கள் ஒரு வரைபடத்தில் சேர்க்கும் வடிவங்கள், மற்றும் உறவுகளுடன் சேர்ந்து, ஒரு மாதிரியை உருவாக்க உங்களை அனுமதிக்கிறது.
uk: Елементи — це фігури, які ви додаєте до діаграми та разом із зв’язками дозволяють побудувати модель.

source: To resize an element on the diagram, left-click on the element to select it and then drag the resize handles that appear at each corner.
es: Para cambiar el tamaño de un elemento del diagrama, haga clic con el botón izquierdo del ratón en el elemento para seleccionarlo y, a continuación, arrastre los tiradores de cambio de tamaño que aparecen en cada esquina.
fr: Pour redimensionner un élément du diagramme, cliquez avec le bouton gauche de la souris sur l'élément pour le sélectionner, puis faites glisser les poignées de redimensionnement qui apparaissent à chaque coin.
ta: வரைபடத்தில் ஒரு உறுப்பை அளவை மாற்ற, அதைத் தேர்ந்தெடுப்பதற்கு உறுப்பில் இடது சொடுக்கு செய்து, ஒவ்வொரு மூலையிலும் தோன்றும் மறுஅளவிடுதல் கைப்பிடிகளை இழுக்கவும்.
uk: Щоб змінити розмір елемента на діаграмі, клацніть елемент лівою кнопкою миші, щоб вибрати його, а потім перетягніть маркери зміни розміру, які з’являються в кожному куті.

source: To move an element on the diagram, drag the element where you want to place it by pressing and holding the left mouse button, and moving the mouse before releasing the button.
es: Para mover un elemento en el diagrama, arrastre el elemento donde desee colocarlo manteniendo pulsado el botón izquierdo del ratón y moviendo el ratón antes de soltar el botón.
fr: Pour déplacer un élément sur le diagramme, faites-le glisser jusqu'à l'endroit où vous voulez le placer, en appuyant sur le bouton gauche de la souris et en le maintenant enfoncé, puis en déplaçant la souris avant de relâcher le bouton.
ta: வரைபடத்தில் ஒரு உறுப்பை நகர்த்த, இடது சுட்டி பொத்தானை அழுத்தி வைத்திருப்பதன் மூலமும், பொத்தானை வெளியிடுவதற்கு முன்பு சுட்டியை நகர்த்துவதன் மூலமும் நீங்கள் வைக்க விரும்பும் உறுப்பை இழுக்கவும்.
uk: Щоб перемістити елемент на діаграмі, перетягніть елемент туди, куди ви хочете його розмістити, натиснувши й утримуючи ліву кнопку миші, а потім перемістіть мишу, перш ніж відпустити кнопку.

source: Relations
es: Relaciones
ta: உறவுகள்
uk: Відносини

source: Relations are line-like items that form relationships between elements in the diagram. Each end of a relation is in one of two states:
fr: Les relations sont des éléments en forme de ligne qui relient entre eux les éléments du diagramme. Chaque extrémité d'une relation se trouve dans l'un des deux états suivants :
ta: உறவுகள் என்பது வரைபடத்தில் உள்ள கூறுகளுக்கு இடையில் உறவுகளை உருவாக்கும் வரி போன்ற உருப்படிகள். ஒரு உறவின் ஒவ்வொரு முனையும் இரண்டு மாநிலங்களில் ஒன்றில் உள்ளது:
uk: Зв’язки – це рядкові елементи, які утворюють зв’язки між елементами діаграми. Кожен кінець відношення знаходиться в одному з двох станів:

source: Connected to an element and the handle turns red
es: Conectado a un elemento y la manilla se vuelve roja
fr: Connecté à un élément, la poignée devient rouge
ta: ஒரு உறுப்புடன் இணைக்கப்பட்டுள்ளது மற்றும் கைப்பிடி சிவப்பு நிறமாக மாறும்
uk: Підключається до елемента, і ручка стає червоною

source: Disconnected from an element and the handle turns green
es: Desconectado de un elemento y la manilla se vuelve verde
fr: Déconnecté d'un élément et la poignée devient verte
ta: ஒரு உறுப்பிலிருந்து துண்டிக்கப்பட்டு கைப்பிடி பச்சை நிறமாக மாறும்
uk: Від’єднано від елемента, ручка стане зеленою

source: If both ends of a relation are disconnected, the relation can be moved by left-clicking and dragging it.
es: Si ambos extremos de una relación están desconectados, la relación puede desplazarse haciendo clic con el botón izquierdo del ratón y arrastrándola.
fr: Si les deux extrémités d'une relation sont déconnectées, il est possible de la déplacer en cliquant avec le bouton gauche de la souris et en la faisant glisser.
ta: ஒரு உறவின் இரு முனைகளும் துண்டிக்கப்பட்டால், இடது சொடுக்கு செய்து அதை இழுப்பதன் மூலம் உறவை நகர்த்தலாம்.
uk: Якщо обидва кінці відношення роз’єднані, відношення можна перемістити, клацнувши лівою кнопкою миші та перетягнувши його.

source: A new segment in a relation can be added by left-clicking on the relation to select it and then by hovering your mouse over it. A green handle will appear in the middle of the line segments that exist. Drag the handle to add another segment. For example, when you first create a new relation, it will have only one segment. If you drag the segment handle, then it will now have two segments with the knee of the two segments where the handle was.
es: Se puede añadir un nuevo segmento en una relación haciendo clic con el botón izquierdo del ratón en la relación para seleccionarla y, a continuación, pasando el ratón por encima. Aparecerá un asa verde en medio de los segmentos de línea existentes. Arrastre el asa para añadir otro segmento. Por ejemplo, cuando se crea una nueva relación, ésta sólo tendrá un segmento. Si arrastra el asa del segmento, ahora tendrá dos segmentos con la rodilla de los dos segmentos donde estaba el asa.
fr: Il est possible d'ajouter un nouveau segment à une relation en glissant la souris au-dessus puis en cliquant sur le bouton gauche de la souris. Une poignée verte apparaît alors entre les segments de ligne existants. Faites glisser la poignée pour ajouter un autre segment. Par exemple, lorsque vous créez une nouvelle relation, celle-ci ne comporte qu'un seul segment. Si vous faites glisser la poignée du segment, elle aura alors deux segments, le point de jonction des deux segments se situe à l'endroit de la poignée.
ta: ஒரு உறவில் ஒரு புதிய பகுதியை அதைத் தேர்ந்தெடுப்பதற்கான உறவில் இடது-கிளிக் செய்வதன் மூலமும், உங்கள் சுட்டியை அதன் மேல் வட்டமிடுவதன் மூலமும் சேர்க்கலாம். ஒரு பச்சை கைப்பிடி இருக்கும் வரி பிரிவுகளின் நடுவில் தோன்றும். மற்றொரு பகுதியைச் சேர்க்க கைப்பிடியை இழுக்கவும். எடுத்துக்காட்டாக, நீங்கள் முதலில் ஒரு புதிய உறவை உருவாக்கும்போது, அதற்கு ஒரே ஒரு பிரிவு மட்டுமே இருக்கும். நீங்கள் பிரிவு கைப்பிடியை இழுத்தால், இப்போது கைப்பிடி இருந்த இரண்டு பிரிவுகளின் முழங்காலுடன் இரண்டு பிரிவுகளைக் கொண்டிருக்கும்.
uk: Новий сегмент у відношенні можна додати, клацнувши лівою кнопкою миші на відношенні, щоб виділити його, а потім навівши на нього курсор. Посередині існуючих сегментів лінії з'явиться зелений маркер. Перетягніть маркер, щоб додати ще один сегмент. Наприклад, коли ви вперше створюєте нове відношення, воно матиме лише один сегмент. Якщо ви перетягнете маркер сегмента, то тепер він матиме два сегменти з коліном двох сегментів, де був маркер.

source: Copy and Paste
fr: Copier et coller
ta: நகலெடுத்து ஒட்டவும்
uk: Копіювати та вставляти

source: As stated before, Gaphor is a modeling environment. This means that every _item_ in a diagram is backed by a _model element_ found in the model browser. This means that you can show the same _model element_ in different diagrams.
fr: Comme indiqué précédemment, Gaphor est un environnement de modélisation. Cela signifie que chaque _item_ (élément) d'un diagramme est soutenu par un _model element_ (élément de modèle) trouvé dans le navigateur de modèle. Cela signifie que vous pouvez afficher le même _model element_(élément de modèle) dans différents diagrammes.
ta: முன்பு கூறியது போல், காஃபர் ஒரு மாடலிங் சூழல். இதன் பொருள் ஒரு வரைபடத்தில் உள்ள ஒவ்வொரு _item_ மாதிரி உலாவியில் காணப்படும் _ மாதிரி உறுப்பு_ ஆல் ஆதரிக்கப்படுகிறது. இதன் பொருள் வெவ்வேறு வரைபடங்களில் ஒரே _ மாதிரி உறுப்பு_ ஐ நீங்கள் காட்டலாம்.
uk: Як зазначалося раніше, Gaphor - це середовище моделювання. Це означає, що кожному _елементу_ на діаграмі відповідає _елемент моделі_, знайдений у браузері моделей. Це означає, що ви можете показувати один і той самий _елемент моделі_ на різних діаграмах.

source: <kbd>Ctrl</kbd>+<kbd>v</kbd> is used to paste _only_ the presentation element.
fr: <kbd>Ctrl</kbd>+<kbd>v</kbd> est utilisé pour coller _uniquement_ l'élément de présentation.
ta: <kbd>கட்டுப்பாடு</kbd>+<kbd>வி</kbd> விளக்கக்காட்சி உறுப்பை ஒட்டுவதற்கு பயன்படுத்தப்படுகிறது.
uk: <kbd>Ctrl</kbd>+<kbd>v</kbd> використовується для вставлення _лише_ елемента презентації.

source: <kbd>Ctrl</kbd>+<kbd>Shift</kbd>+<kbd>v</kbd> is used to paste a new presentation with a new model element.
fr: <kbd>Ctrl</kbd>+<kbd>Shift</kbd>+<kbd>v</kbd> est utilisé pour coller une nouvelle présentation avec un nouvel élément de modèle.
ta: <kbd>கட்டுப்பாடு</kbd>+<kbd>சிப்ட்</kbd>+<kbd>வி</kbd> ஒரு புதிய மாதிரி உறுப்புடன் புதிய விளக்கக்காட்சியை வழங்க பயன்படுகிறது.
uk: <kbd>Ctrl</kbd>+<kbd>Shift</kbd>+<kbd>v</kbd> використовується для вставлення нової презентації з новим елементом моделі.

source: <kbd>Ctrl</kbd>+<kbd>v</kbd> does a "shallow" paste. <kbd>Ctrl</kbd>+<kbd>Shift</kbd>+<kbd>v</kbd> does a "deep" paste.
fr: <kbd>Ctrl</kbd>+<kbd>v</kbd> effectue un collage « partiel ».. <kbd>Ctrl</kbd>+<kbd>Shift</kbd>+<kbd>v</kbd> effectue un collage « complet ».
ta: <kbd>கட்டுப்பாடு</kbd>+<kbd>வி</kbd> "ஆழமற்ற" ஒட்டு செய்கிறது. <kbd> கட்டுப்பாடு </kbd>+<kbd>உயர்த்து</kbd>+<kbd>வி</kbd> "ஆழமான" ஒட்டு செய்கிறது.
uk: <kbd>Ctrl</kbd>+<kbd>v</kbd> виконує «глибоке» вставлення. <kbd>Ctrl</kbd>+<kbd>Shift</kbd>+<kbd>v</kbd> виконує «глибоке» вставлення.

source: Undo and Redo
es: Deshacer y rehacer
fr: Annuler et refaire
ta: செயல்தவிர் மற்றும் மீண்டும்
uk: Скасувати та повторити

source: Undo a change press <kbd>Ctrl</kbd>+<kbd>z</kbd> or left-click on the back arrow at the top of the Property Editor. To re-do a change, hit <kbd>Ctrl</kbd>+<kbd>Shift</kbd>+<kbd>z</kbd> or press the forward arrow at the top of the Property Editor.
es: Para deshacer un cambio pulse <kbd>Ctrl</kbd>+<kbd>z</kbd> o haga clic con el botón izquierdo del ratón en la flecha para deshacer situada en la parte superior del Editor de Propiedades. Para rehacer un cambio, pulse <kbd>Ctrl</kbd>+<kbd>Mayús</kbd>+<kbd>z</kbd> o pulse la flecha de rehacer en la parte superior del Editor de propiedades.
fr: Annuler une modification appuyez sur <kbd>Ctrl</kbd>+<kbd>z</kbd> ou cliquer avec le bouton gauche de la souris sur la flèche arrière en haut de l'éditeur de propriétés. Pour rétablir une modification, appuyez sur <kbd>Ctrl</kbd>+<kbd>Shift</kbd>+<kbd>z</kbd> ou appuyez sur la flèche vers l'avant en haut de l'éditeur de propriétés.
ta: ஒரு மாற்றத்தை செயல்தவிர்க்க <kbd>கட்டுப்பாடு</kbd>+<kbd>சட்</kbd> அல்லது சொத்து எடிட்டரின் மேற்புறத்தில் பின்புற அம்புக்குறியில் இடது சொடுக்கு செய்யவும். ஒரு மாற்றத்தை மீண்டும் செய்ய, <kbd>கட்டுப்பாடு </kbd>+<kbd>சிப்ட்</kbd>+<kbd>சட்</kbd> ஐ அழுத்தவும் அல்லது சொத்து எடிட்டரின் மேற்புறத்தில் முன்னோக்கி அம்புக்குறியை அழுத்தவும்.
uk: Щоб скасувати зміну, натисніть <kbd>Ctrl</kbd>+<kbd>z</kbd> або клацніть лівою кнопкою миші стрілку назад у верхній частині редактора властивостей. Щоб повторно внести зміни, натисніть <kbd>Ctrl</kbd>+<kbd>Shift</kbd>+<kbd>z</kbd> або натисніть стрілку вперед у верхній частині редактора властивостей.

source: The Property Editor is present on the right side of the diagrams. When no item is selected in the diagram, it shows you some tips and tricks. When an item is selected on the diagram, it contains the item details like name, attributes and stereotypes. It can be opened with <kbd>F9</kbd> and the ![Icon for showing and hiding the Property Editor.](images/sidebar-show-right-symbolic.svg) icon in the header bar.
fr: L'éditeur de propriétés est présent sur le côté droit des diagrammes. Lorsqu'aucun élément n'est sélectionné dans le diagramme, il vous montre quelques trucs et astuces. Lorsqu'un élément est sélectionné sur le diagramme, il contient les détails de l'élément comme le nom, les attributs et les stéréotypes. Il peut être ouvert avec <kbd>F9</kbd> et l'icône ![Icône pour afficher et masquer l'éditeur de propriétés.](images/sidebar-show-right-symbolic.svg) dans la barre d'en-tête.
ta: சொத்து எடிட்டர் வரைபடங்களின் வலது பக்கத்தில் உள்ளது. வரைபடத்தில் எந்த பொருளும் தேர்ந்தெடுக்கப்படாதபோது, இது சில உதவிக்குறிப்புகள் மற்றும் தந்திரங்களை உங்களுக்குக் காட்டுகிறது. வரைபடத்தில் ஒரு உருப்படி தேர்ந்தெடுக்கப்படும்போது, அதில் பெயர், பண்புக்கூறுகள் மற்றும் ச்டீரியோடைப்கள் போன்ற உருப்படி விவரங்கள் உள்ளன. இது <kbd>F9</kbd> மற்றும் தி! [சொத்து எடிட்டரைக் காண்பிப்பதற்கும் மறைப்பதற்கும் படவுரு.
uk: Редактор властивостей розташований у правій частині діаграм. Якщо на діаграмі не вибрано жодного елемента, ви побачите кілька порад і підказок. Коли елемент вибрано на діаграмі, він містить такі деталі елемента, як назва, атрибути та стереотипи. Його можна відкрити за допомогою <kbd>F9</kbd> і піктограми ![Піктограма для показу та приховування редактора властивостей.](images/sidebar-show-right-symbolic.svg) на панелі заголовка.

source: Icon for showing and hiding the Property Editor.
fr: Icône pour afficher et masquer l'éditeur de propriétés.
ta: சொத்து எடிட்டரைக் காண்பிப்பதற்கும் மறைப்பதற்கும் படவுரு.
uk: Піктограма для показу та приховування редактора властивостей.

source: The properties that are shown depend on the item that is selected.
es: Las propiedades que se muestran dependen del elemento seleccionado.
fr: Les propriétés affichées dépendent de l’élément sélectionné.
ta: காட்டப்பட்டுள்ள பண்புகள் தேர்ந்தெடுக்கப்பட்ட உருப்படியைப் பொறுத்தது.
uk: Властивості, які відображаються, залежать від вибраного елемента.

source: Model Preferences
es: Preferencias del modelo
fr: Préférences du modèle
ta: மாதிரி விருப்பத்தேர்வுகள்
uk: Параметри моделі

source: The Property Editor also contains model preferences: Click the ![Document with wrench icon for model specific configuration.](images/document-properties-symbolic.svg) button.
fr: L'éditeur de propriétés contient également les préférences du modèle : cliquer sur le bouton ![Document avec l'icône de clé pour la configuration spécifique au modèle.](images/document-properties-symbolic.svg).
ta: சொத்து எடிட்டரில் மாதிரி விருப்பங்களும் உள்ளன: மாதிரி குறிப்பிட்ட உள்ளமைவுக்கான குறடு ஐகானுடன் ஆவணத்தைக் சொடுக்கு செய்க.](images/document-properties-symbolic.svg) பொத்தானை.
uk: Редактор властивостей також містить параметри моделі: натисніть кнопку ![Документ із піктограмою гайкового ключа для конкретної конфігурації моделі.](images/document-properties-symbolic.svg).

source: Document with wrench icon for model specific configuration.
fr: Document avec icône de la clé pour la configuration spécifique au modèle.
ta: மாதிரி குறிப்பிட்ட உள்ளமைவுக்கு குறடு ஐகானுடன் ஆவணம்.
uk: Документ із значком гайкового ключа для конкретної конфігурації моделі.

source: Reset Tool Automatically
fr: Réinitialiser l’outil automatiquement
ta: கருவியைத் தானாக மீட்டமை
uk: Скинути інструмент автоматично

source: By default, the pointer tool is selected after an element is placed from the toolbox. If this option is turned off, the same type of element will be placed by clicking in the diagram until another element is selected in the toolbox.
fr: Par défaut, l'outil pointeur est sélectionné après avoir placé un élément de la boîte à outils. Si cette option est désactivée, le même type d'élément sera placé en cliquant dans le diagramme jusqu'à ce qu'un autre élément soit sélectionné dans la boîte à outils.
ta: இயல்பாக, கருவிப்பெட்டியில் இருந்து ஒரு உறுப்பு வைக்கப்பட்ட பிறகு சுட்டிக்காட்டி கருவி தேர்ந்தெடுக்கப்படுகிறது. இந்த விருப்பம் முடக்கப்பட்டால், கருவிப்பெட்டியில் மற்றொரு உறுப்பு தேர்ந்தெடுக்கப்படும் வரை வரைபடத்தில் சொடுக்கு செய்வதன் மூலம் அதே வகை உறுப்பு வைக்கப்படும்.
uk: За замовчуванням інструмент вказівника вибирається після розміщення елемента з панелі інструментів. Якщо цю опцію вимкнено, той самий тип елемента буде розміщуватися клацанням на діаграмі доти, доки на панелі інструментів не буде вибрано інший елемент.

source: Remove Unused Elements
fr: Supprimer les éléments inutilisés
ta: பயன்படுத்தப்படாத கூறுகளை அகற்றவும்
uk: Видалити невикористані елементи

source: By default, elements that are not part of any diagram in the model will be removed. If this option is turned off, elements remain in the model and may be found in the model browser.
fr: Par défaut, les éléments qui ne font partie d'aucun diagramme du modèle sont supprimés. Si cette option est désactivée, les éléments restent dans le modèle et peuvent être retrouvés dans le navigateur de modèles.
ta: இயல்பாக, மாதிரியில் எந்த வரைபடத்தின் பகுதியாக இல்லாத கூறுகள் அகற்றப்படும். இந்த விருப்பம் அணைக்கப்பட்டால், கூறுகள் மாதிரியில் இருக்கும் மற்றும் மாதிரி உலாவியில் காணப்படலாம்.
uk: За замовчуванням елементи, які не є частиною жодної діаграми моделі, будуть видалені. Якщо цей параметр вимкнено, елементи залишаються в моделі та можуть бути знайдені в браузері моделі.

source: Diagram Language
fr: Langage de diagramme
ta: வரைபட மொழி
uk: Мова діаграм

source: The diagram language modifier is only applicable to the loaded model and how it is shown in the diagram. The diagram language setting is saved as part of the model and defaults to English.
fr: Le sélecteur de langue du diagramme s'applique uniquement au modèle chargé et à la manière dont il est affiché dans le diagramme. Le paramètre de langue du diagramme est enregistré dans le cadre du modèle et est défini par défaut sur l'anglais.
ta: வரைபட மொழி மாற்றியமைத்தல் ஏற்றப்பட்ட மாதிரிக்கு மட்டுமே பொருந்தும் மற்றும் அது வரைபடத்தில் எவ்வாறு காட்டப்பட்டுள்ளது. வரைபட மொழி அமைப்பு மாதிரியின் ஒரு பகுதியாக சேமிக்கப்படுகிறது மற்றும் ஆங்கிலத்திற்கு இயல்புநிலை.
uk: Модифікатор мови діаграми застосовний лише до завантаженої моделі та того, як вона зображена на діаграмі. Налаштування мови діаграми зберігається як частина моделі та за замовчуванням використовується англійська.

source: The UI language of Gaphor is controlled by the operating system.
fr: La langue de l'interface utilisateur de Gaphor est contrôlée par le système d'exploitation.
ta: கஃபோரின் இடைமுகம் மொழி இயக்க முறைமையால் கட்டுப்படுத்தப்படுகிறது.
uk: Мова інтерфейсу користувача Gaphor контролюється операційною системою.

source: Gaphor considers the ``LANG`` environment variable on Linux, Windows and macOS.
fr: Gaphor utilise la variable d'environnement ``LANG`` sur Linux, Windows et macOS.
ta: லினக்ச், சாளரங்கள் மற்றும் மேகோச் ஆகியவற்றில் ``LANG`` சுற்றுச்சூழல் மாறியை கஃபர் கருதுகிறார்.
uk: Gaphor розглядає змінну середовища ``LANG`` у Linux, Windows і macOS.

source: On Windows and macOS it can be set independently of the operating system's language settings to a different language.
fr: Sous Windows et macOS, elle peut être réglée sur une autre langue, indépendamment des paramètres linguistiques du système d'exploitation.
ta: சாளரங்கள் மற்றும் மேகோசில் இது இயக்க முறைமையின் மொழி அமைப்புகளிலிருந்து வேறு மொழிக்கு சுயாதீனமாக அமைக்கப்படலாம்.
uk: У Windows і macOS його можна встановити незалежно від налаштувань мови операційної системи на іншу мову.

source: Style Sheet
fr: Feuille de style
ta: பாணி தாள்
uk: Таблиця стилів

source: The [style sheet](style_sheets) allows to change the visual appearance of diagrams and model elements.
fr: La [feuille de style](style_sheets) permet de modifier l'apparence visuelle des diagrammes et des éléments de modèle.
ta: [பாணி தாள்](style_sheets) வரைபடங்கள் மற்றும் மாதிரி கூறுகளின் காட்சி தோற்றத்தை மாற்ற அனுமதிக்கிறது.
uk: [Таблиця стилів](style_sheets) дозволяє змінювати візуальний вигляд діаграм і елементів моделі.

source: Getting Started
es: Primeros pasos
fr: Pour commencer
ta: தொடங்குதல்
uk: Початок Роботи

source: Features
es: Funciones
fr: Caractéristiques
ta: நற்பொருத்தங்கள்
uk: Особливості

source: Development
fr: Développement
ta: வளர்ச்சி
uk: Розробка

source: Modeling languages
es: Lenguajes de modelado
fr: Langages de modélisation
ta: மாடலிங் மொழிகள்
uk: Мови моделювання

source: Concepts
es: Conceptos
ta: கருத்துக்கள்
uk: Концепції

source: Internals
es: Funcionamiento interno
fr: Fonctionnements internes
ta: உட்புறங்கள்
uk: Внутрішні органи

source: About Gaphor
es: Acerca de Gaphor
fr: À propos de Gaphor
ta: கஃபர் பற்றி
uk: Про Gaphor

source: The documentation is up to date for Gaphor |version|
es: La documentación está actualizada para Gaphor |version|
fr: La documentation est à jour pour Gaphor (anglaise) |version|
ta: Gaphor | பதிப்பு | க்கான ஆவணங்கள் புதுப்பித்த நிலையில் உள்ளன
uk: Документація актуальна для Gaphor |версії|
