Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: Change Log
fr: Journal des modifications
ta: பதிவை மாற்றவும்
uk: Журнал змін

source: Our change log is with the project's source code on `GitHub <https://github.com/gaphor/gaphor/blob/main/CHANGELOG.md>`_.
fr: Notre journal des modifications se trouve avec le code source du projet sur `GitHub <https://github.com/gaphor/gaphor/blob/main/CHANGELOG.md>`_.
ta: எங்கள் மாற்ற பதிவு `கிதப் <https://github.com/gaphor/gaphor/blob/main/CHANGELOG.md>`_ _ இல் திட்டத்தின் மூலக் குறியீட்டைக் கொண்டுள்ளது.
uk: Наш журнал змін містить вихідний код проекту на `GitHub <https://github.com/gaphor/gaphor/blob/main/CHANGELOG.md>`_.

source: The latest version may not have been released yet.
fr: Il se peut que la dernière version n'ait pas encore été publiée.
ta: அண்மைக் கால பதிப்பு இன்னும் வெளியிடப்படவில்லை.
uk: Можливо, остання версія ще не була випущена.

source: Tutorial: Coffee Machine
fr: Tutoriel : Machine à café
ta: பயிற்சி: காபி இயந்திரம்
uk: Підручник: Кавоварка

source: In this tutorial we refer to the different parts of the gaphor interface: {ref}`Model Browser <getting_started:model browser>`, [Toolbox](getting_started:toolbox), {ref}`Property Editor <getting_started:property editor>`.
es: En este tutorial hacemos referencia a las diferentes partes de la interfaz gaphor: {ref}`Navegador de modelos <getting_started:model browser>`, [Caja de herramientas](getting_started:toolbox), {ref}`Editor de propiedades <getting_started:property editor>`.
fr: Dans ce tutoriel, nous nous référons aux différentes parties de l'interface gaphor : {ref}`Navigateur de modèle <getting_started:model browser>`, [Toolbox](getting_started:toolbox), {ref}`Éditeur de propriétés <getting_started:property editor>`.
ta: இந்த டுடோரியலில் நாங்கள் காஃபர் இடைமுகத்தின் வெவ்வேறு பகுதிகளைக் குறிப்பிடுகிறோம்: {ref}`Model Browser <getting_started:model browser>`, [கருவிப்பெட்டி](getting_started:toolbox), {ref}`Property Editor <getting_started:property editor>`.
uk: У цьому підручнику ми посилаємося на різні частини інтерфейсу gaphor: {ref}`Model Browser <getting_started:model browser>`, [Toolbox](getting_started:toolbox), {ref}`Property Editor <getting_started:property editor>`.

source: Although the names should speak for themselves, you can check out the [Getting Started](getting_started) page for more information about those sections.
es: Aunque los nombres deberían hablar por sí solos, puede consultar la página [Primeros pasos](getting_started) para obtener más información sobre estas secciones.
fr: Bien que les noms parlent d'eux-mêmes, vous pouvez consulter la page [Mise en route](getting_started) pour plus d'informations sur ces sections.
ta: பெயர்கள் தங்களைத் தாங்களே பேசிக் கொள்ள வேண்டும் என்றாலும், அந்த பிரிவுகளைப் பற்றிய கூடுதல் தகவலுக்கு நீங்கள் [தொடங்குதல்](getting_started) பக்கத்தைப் பார்க்கலாம்.
uk: Хоча назви мають говорити самі за себе, ви можете переглянути сторінку [Початок роботи](getting_started), щоб дізнатися більше про ці розділи.

source: Introduction
ta: அறிமுகம்
uk: вступ

source: In the bustling town of Antville, a colony of ants had formed a Systems Engineering consulting company called AntSource. They value collaboration, transparency, and community-driven engineering, and seeks to empower their employees and customers through open communication and participation in the systems engineering process.
fr: Dans la ville animée d'Antville, une colonie de fourmis a créé une société de conseil en ingénierie des systèmes appelée AntSource. Elle valorise la collaboration, la transparence et l'ingénierie communautaire, et cherche à responsabiliser ses employés et ses clients par une communication ouverte et la participation au processus d'ingénierie des systèmes.
ta: சலசலப்பான நகரமான ஆண்ட்வில்லில், எறும்புகளின் காலனி ஆன்ட்சோர்ச் என்ற சிச்டம்ச் இன்சினியரிங் அறிவுரை நிறுவனத்தை உருவாக்கியது. அவர்கள் ஒத்துழைப்பு, வெளிப்படைத்தன்மை மற்றும் சமூகத்தால் இயக்கப்படும் பொறியியல் ஆகியவற்றை மதிக்கிறார்கள், மேலும் சிச்டம்ச் இன்சினியரிங் செயல்பாட்டில் திறந்த தொடர்பு மற்றும் பங்கேற்பு மூலம் தங்கள் ஊழியர்களுக்கும் வாடிக்கையாளர்களுக்கும் அதிகாரம் அளிக்க முற்படுகிறார்கள்.
uk: У галасливому містечку Ентвіль колонія мурашок створила консалтингову компанію з системної інженерії під назвою AntSource. Вони цінують співпрацю, прозорість і розробку, керовану спільнотою, і прагнуть розширити можливості своїх співробітників і клієнтів через відкрите спілкування та участь у процесі розробки систем.

source: The engineers at AntSource all have nicknames that reflect the key principles and concepts of their craft: Qual-ant, Reli-ant, Safe-ant, Usa-ant, and Sust-ant. They were experts in designing and optimizing complex systems, and they took pride in their work.
fr: Les ingénieurs d'AntSource ont tous des surnoms qui reflètent les principes et concepts clés de leur métier : Qual-ant, Reli-ant, Safe-ant, Usa-ant et Sust-ant. Ils étaient experts dans la conception et l'optimisation de systèmes complexes, et ils étaient fiers de leur travail.
ta: ஆண்ட்சோர்சில் உள்ள பொறியாளர்கள் அனைவருமே தங்கள் கைவினைப் பற்றிய முக்கிய கொள்கைகளையும் கருத்துகளையும் பிரதிபலிக்கும் புனைப்பெயர்களைக் கொண்டுள்ளனர்: தகுதி, மறுசீரமைப்பு, பாதுகாப்பான, அமெரிக்கா-ஆன் மற்றும் நிலையான. சிக்கலான அமைப்புகளை வடிவமைப்பதிலும் மேம்படுத்துவதிலும் அவர்கள் நிபுணர்களாக இருந்தனர், மேலும் அவர்கள் தங்கள் வேலையில் பெருமிதம் கொண்டனர்.
uk: Усі інженери AntSource мають псевдоніми, які відображають ключові принципи та концепції їх ремесла: Qual-ant, Reli-ant, Safe-ant, Usa-ant та Sust-ant. Вони були експертами з розробки та оптимізації складних систем і пишалися своєю роботою.

source: One day, a new client approached AntSource with an unusual request. Cappuccino, a cat who owned a popular coffee shop called Milk & Whiskers Café, needed a custom espresso machine designed specifically for felines. Cats just love their coffee strong, with a creamy and smooth body and topped with the perfect foamy layer of crema. The ants were intrigued by the challenge and immediately set to work.
fr: Un jour, un nouveau client s'est adressé à AntSource avec une demande inhabituelle. Cappuccino, un chat propriétaire d'un café populaire appelé Milk & Whiskers Café, avait besoin d'une machine à expresso personnalisée, conçue spécialement pour les félins. Les chats aiment leur café fort, avec un corps crémeux et lisse, et recouvert d'une parfaite couche de crème mousseuse. Les fourmis ont été intriguées par le défi et se sont immédiatement mises au travail.
ta: ஒரு நாள், ஒரு புதிய வாடிக்கையாளர் அசாதாரண கோரிக்கையுடன் ஆண்ட்சோர்சை அணுகினார். கப்புசினோ என்ற பூனைக்கு மில்க் & விச்கர்ச் கபே என்ற பிரபலமான காபி கடையை வைத்திருந்த பூனைக்கு, பூனைகளுக்காக வடிவமைக்கப்பட்ட தனிப்பயன் எச்பிரெசோ இயந்திரம் தேவைப்பட்டது. பூனைகள் தங்கள் காபியை வலுவாக நேசிக்கின்றன, ஒரு கிரீமி மற்றும் மென்மையான உடலுடன் மற்றும் க்ரீமாவின் சரியான நுரை அடுக்குடன் முதலிடம் வகிக்கின்றன. எறும்புகள் சவாலால் சூழ்ச்சி செய்து உடனடியாக வேலைக்கு அமைக்கப்பட்டன.
uk: Одного разу новий клієнт звернувся до AntSource із незвичайним запитом. Капучіно, коту, який володів популярною кав’ярнею під назвою Milk & Whiskers Café, потрібна була спеціальна еспресо-машина, розроблена спеціально для котячих. Коти просто обожнюють міцну каву з вершковим і гладким вмістом і ідеальним пінним шаром вершків. Мурахи були заінтриговані викликом і негайно взялися до роботи.

source: Qual-ant was responsible for ensuring that the machine met all quality standards and specifications, while Reli-ant was tasked with making sure that the machine was dependable and would work correctly every time it was used. Safe-ant designed the machine with safety in mind, ensuring that it wouldn't cause harm to anyone who used it. Usa-ant designed the machine to be easy and intuitive to use, while Sust-ant ensured that the machine was environmentally friendly and sustainable. In this tutorial we follow the adventures of AntSource to create the perfect kittie espresso machine.
fr: Qual-ant était chargé de veiller à ce que la machine réponde à toutes les normes et spécifications de qualité, tandis que Reli-ant avait pour mission de s'assurer que la machine était fiable et qu'elle fonctionnerait correctement à chaque fois qu'elle serait utilisée. Safe-ant a conçu la machine dans un souci de sécurité, en veillant à ce qu'elle ne cause aucun dommage à quiconque l'utilise. Usa-ant a conçu la machine pour qu'elle soit facile et intuitive à utiliser, tandis que Sust-ant a veillé à ce qu'elle soit respectueuse de l'environnement et durable. Dans ce tutoriel, nous suivons les aventures d'AntSource pour créer la machine à expresso idéale pour les chatons.
ta: இயந்திரம் அனைத்து தரமான தரங்களையும் விவரக்குறிப்புகளையும் நிறைவு செய்ததை உறுதி செய்வதற்கு குவால்ட்-ஆன்ட் பொறுப்பேற்றார், அதே நேரத்தில் இயந்திரம் நம்பகத்தன்மையுடன் இருப்பதை உறுதி செய்வதோடு, அது பயன்படுத்தப்படும் ஒவ்வொரு முறையும் சரியாக வேலை செய்யும். பாதுகாப்பான-எறும்பு இயந்திரத்தை மனதில் கொண்டு வடிவமைத்தது, அதைப் பயன்படுத்திய எவருக்கும் இது தீங்கு விளைவிக்காது என்பதை உறுதிசெய்கிறது. யுஎச்ஏ-என்ட் இயந்திரத்தை பயன்படுத்த எளிதாகவும் உள்ளுணர்வுடனும் வடிவமைத்தது, அதே நேரத்தில் இயந்திரம் சுற்றுச்சூழல் நட்பு மற்றும் நிலையானது என்பதை உறுதிப்படுத்தியது. இந்த டுடோரியலில், சரியான கிட்டி எச்பிரெசோ இயந்திரத்தை உருவாக்க ஆன்ட்சோர்சின் சாகசங்களைப் பின்பற்றுகிறோம்.
uk: Qual-ant відповідав за те, щоб машина відповідала всім стандартам якості та специфікаціям, тоді як Reli-ant мав забезпечити надійність машини та її правильну роботу щоразу, коли її використовують. Safe-ant розробив машину з урахуванням безпеки, гарантуючи, що вона не завдасть шкоди нікому, хто її використовує. Компанія Usa-ant розробила машину так, щоб вона була простою та інтуїтивно зрозумілою у використанні, а Sust-ant подбала про екологічність та екологічність машини. У цьому підручнику ми спостерігаємо за пригодами AntSource, щоб створити ідеальну кавоварку Kittie espresso.

source: ![Two shots of espresso being pulled from an espresso machine.](images/coffee-machine-double-shot.jpg)
fr: ![Deux doses d'expresso tiré d'une machine à expresso] (images/coffee-machine-double-shot.jpg)
ta: ![எச்பிரெசோ இயந்திரத்திலிருந்து எடுக்கப்பட்ட எச்பிரெசோவின் இரண்டு மூடிகள்.](images/coffee-machine-double-shot.jpg)
uk: ![Дві порції еспресо витягують із еспресо-машини.](images/coffee-machine-double-shot.jpg)

source: Two shots of espresso being pulled from an espressomachine.
fr: Deux doses d'espresso tirées d'une machine à espresso.
ta: எச்பிரெசோஐனிலிருந்து எச்பிரெசோவின் இரண்டு காட்சிகள் இழுக்கப்படுகின்றன.
uk: Дві порції еспресо витягують з еспресомашини.

source: The first thing the ants did was to open Gaphor to the Greeter window and start a new model with the _SysML_ template. You can now decide to either:
fr: La première chose que les fourmis ont faite a été d'ouvrir Gaphor dans la fenêtre du Greeter et de démarrer un nouveau modèle avec le modèle _SysML_ :
ta: எறும்புகள் செய்த முதல் சேதி, கிரீட்டர் சாளரத்திற்கு கேஃபரைத் திறந்து _SysML_ வார்ப்புருவுடன் புதிய மாதிரியைத் தொடங்குவது. நீங்கள் இப்போது முடிவு செய்யலாம்:
uk: Перше, що зробили мурахи, це відкрили Gaphor у вікні Greeter і запустили нову модель із шаблоном _SysML_. Тепер ви можете вирішити:

source: recreate their work as part of this tutorial. For this, open the SysML Example model shown at the bottom of the Greeter window
fr: recréer leur travail dans le cadre de ce tutoriel. Pour ce faire, ouvrez le modèle SysML Example figurant au bas de la fenêtre d'accueil (Greeter)
ta: இந்த டுடோரியலின் ஒரு பகுதியாக அவர்களின் வேலையை மீண்டும் உருவாக்கவும். இதற்காக, கிரீட்டர் சாளரத்தின் அடிப்பகுதியில் காட்டப்பட்டுள்ள SysML எடுத்துக்காட்டு மாதிரியைத் திறக்கவும்
uk: відтворити свою роботу в рамках цього підручника. Для цього відкрийте приклад моделі SysML, показаний у нижній частині вікна Greeter

source: inspect the result of their work by opening the `coffee-machine` model located in the `examples` folder.
fr: inspecter le résultat de leur travail en ouvrant le modèle `coffee-machine` situé dans le dossier `examples`.
ta: `எடுத்துக்காட்டுகள்` கோப்புறையில் அமைந்துள்ள` காபி-மெசின்` மாதிரியைத் திறப்பதன் மூலம் அவர்களின் பணியின் முடிவை ஆய்வு செய்யுங்கள்.
uk: перевірити результат своєї роботи, відкривши модель `кавоварка`, яка знаходиться в папці `examples`.

source: Abstraction Levels
fr: Niveaux d'abstraction
ta: சுருக்க நிலைகள்
uk: Рівні абстракції

source: Abstraction is a way of simplifying complex systems by focusing on only the most important details, while ignoring the rest. It's a process of reducing complexity by removing unnecessary details and highlighting the key aspects of a system in order to focus on the problem to be solved. It is the key to rigorous analysis of a system.
fr: L'abstraction est un moyen de simplifier les systèmes complexes en se concentrant sur les détails les plus importants et en ignorant le reste. C'est un processus qui permet de réduire la complexité en supprimant les détails inutiles et en mettant en évidence les aspects essentiels d'un système afin de se concentrer sur le problème à résoudre. C'est la clé de l'analyse rigoureuse d'un système.
ta: சுருக்கம் என்பது மிக முக்கியமான விவரங்களை மட்டுமே கவனம் செலுத்துவதன் மூலம் சிக்கலான அமைப்புகளை எளிதாக்குவதற்கான ஒரு வழியாகும், அதே நேரத்தில் மீதமுள்ளவற்றை புறக்கணிக்கிறது. இது தேவையற்ற விவரங்களை அகற்றுவதன் மூலமும், தீர்க்கப்பட வேண்டிய சிக்கலில் கவனம் செலுத்துவதற்காக ஒரு அமைப்பின் முக்கிய அம்சங்களை முன்னிலைப்படுத்துவதன் மூலமும் சிக்கலைக் குறைக்கும் ஒரு செயல்முறையாகும். இது ஒரு அமைப்பின் கடுமையான பகுப்பாய்விற்கு முக்கியமாகும்.
uk: Абстракція — це спосіб спрощення складних систем шляхом зосередження лише на найважливіших деталях, ігноруючи решту. Це процес зменшення складності шляхом видалення непотрібних деталей і виділення ключових аспектів системи, щоб зосередитися на проблемі, яку потрібно вирішити. Це ключ до ретельного аналізу системи.

source: To understand abstraction, think about a painting. When you look at a painting, you see a representation of something - perhaps a person, a landscape, or an object. The artist has simplified the real world into a set of lines, shapes, and colors that represent the most important details of the subject. In the same way, systems engineers, like our friends the ants, use abstraction to represent complex systems by breaking them down into their essential components and highlighting the most important aspects.
fr: Pour comprendre l'abstraction, il faut penser à une peinture. Lorsque vous regardez une peinture, vous voyez une représentation de quelque chose - peut-être une personne, un paysage ou un objet. L'artiste a simplifié le monde réel en un ensemble de lignes, de formes et de couleurs qui représentent les détails les plus importants du sujet. De la même manière, les ingénieurs systèmes, comme nos amis les fourmis, utilisent l'abstraction pour représenter des systèmes complexes en les décomposant en leurs éléments essentiels et en mettant en évidence les aspects les plus importants.
ta: சுருக்கத்தைப் புரிந்து கொள்ள, ஒரு ஓவியத்தைப் பற்றி சிந்தியுங்கள். நீங்கள் ஒரு ஓவியத்தைப் பார்க்கும்போது, எதையாவது பிரதிநிதித்துவப்படுத்துவதைக் காணலாம் - ஒருவேளை ஒரு நபர், ஒரு நிலப்பரப்பு அல்லது ஒரு பொருள். கலைஞர் நிச உலகத்தை இந்த விசயத்தின் மிக முக்கியமான விவரங்களைக் குறிக்கும் கோடுகள், வடிவங்கள் மற்றும் வண்ணங்களின் தொகுப்பாக எளிமைப்படுத்தியுள்ளார். அதேபோல், சிச்டம்ச் பொறியாளர்கள், எங்கள் நண்பர்களைப் போலவே, எறும்புகளைப் போலவே, சிக்கலான அமைப்புகளை அவற்றின் அத்தியாவசிய கூறுகளாக உடைத்து மிக முக்கியமான அம்சங்களை முன்னிலைப்படுத்துவதன் மூலம் சுருக்கத்தைப் பயன்படுத்துகின்றனர்.
uk: Щоб зрозуміти абстракцію, подумайте про картину. Дивлячись на картину, ви бачите зображення чогось – можливо, людини, пейзажу чи об’єкта. Художник спростив реальний світ у набір ліній, форм і кольорів, які представляють найважливіші деталі предмета. Таким же чином системні інженери, як і наші друзі мурахи, використовують абстракцію для представлення складних систем, розбиваючи їх на основні компоненти та виділяючи найважливіші аспекти.

source: Abstraction levels refer to the different levels of detail at which a system can be represented. These levels are used to break down complex systems into smaller, more manageable parts that can be analyzed and optimized. Said another way, abstraction levels group portions of a design where similar types of questions are answered.
fr: Les niveaux d'abstraction désignent les différents niveaux de détail auxquels un système peut être représenté. Ces niveaux sont utilisés pour décomposer des systèmes complexes en parties plus petites et plus faciles à gérer, qui peuvent être analysées et optimisées. En d'autres termes, les niveaux d'abstraction regroupent les parties d'une conception où l'on répond à des types de questions similaires.
ta: சுருக்க நிலைகள் ஒரு அமைப்பைக் குறிப்பிடக்கூடிய வெவ்வேறு நிலைகளின் விவரங்களைக் குறிக்கின்றன. இந்த நிலைகள் சிக்கலான அமைப்புகளை சிறிய, நிர்வகிக்கக்கூடிய பகுதிகளாக உடைக்கப் பயன்படுகின்றன, அவை பகுப்பாய்வு செய்யப்பட்டு உகந்ததாக இருக்க முடியும். மற்றொரு வழி, சுருக்கம் ஒரு வடிவமைப்பின் குழு பகுதிகளை நிலைநிறுத்துகிறது, அங்கு ஒத்த வகையான கேள்விகளுக்கு பதிலளிக்கப்படுகிறது.
uk: Рівні абстракції стосуються різних рівнів деталізації, на яких може бути представлена система. Ці рівні використовуються для розбиття складних систем на менші, більш керовані частини, які можна аналізувати та оптимізувати. Іншими словами, рівні абстракції групують частини дизайну, де відповідають схожі типи питань.

source: There are typically three levels of abstraction in systems engineering and these are the three levels used in the SysML template:
fr: Il existe généralement trois niveaux d'abstraction dans l'ingénierie des systèmes et ce sont les trois niveaux utilisés dans le modèle SysML :
ta: கணினி பொறியியலில் பொதுவாக மூன்று நிலை சுருக்கங்கள் உள்ளன, இவை SysML வார்ப்புருவில் பயன்படுத்தப்படும் மூன்று நிலைகள்:
uk: У системній інженерії зазвичай існує три рівні абстракції, і це три рівні, які використовуються в шаблоні SysML:

source: Concept Level: Sometimes also called Conceptual Level. Defines the problem being solved. This is the highest level of abstraction, where the system is described in terms of its overall purpose, goals, and functions. At this level, the focus is on understanding the system's requirements and how it will interact with other systems.
fr: Niveau conceptuel : Parfois également appelé niveau de la réflexion. Définit le problème à résoudre. Il s'agit du niveau d'abstraction le plus élevé, où le système est décrit en termes d'objectif global, de buts et de fonctions. À ce niveau, l'accent est mis sur la compréhension des exigences du système et sur la manière dont il interagira avec d'autres systèmes.
ta: கருத்து நிலை: சில நேரங்களில் கருத்தியல் நிலை என்றும் அழைக்கப்படுகிறது. தீர்க்கப்படும் சிக்கலை வரையறுக்கிறது. இது மிக உயர்ந்த சுருக்கமாகும், அங்கு கணினி அதன் ஒட்டுமொத்த நோக்கம், குறிக்கோள்கள் மற்றும் செயல்பாடுகளின் அடிப்படையில் விவரிக்கப்பட்டுள்ளது. இந்த மட்டத்தில், கணினியின் தேவைகள் மற்றும் அது மற்ற அமைப்புகளுடன் எவ்வாறு தொடர்பு கொள்ளும் என்பதைப் புரிந்துகொள்வதில் கவனம் செலுத்தப்படுகிறது.
uk: Концептуальний рівень: іноді також називається концептуальним рівнем. Визначає проблему, що розв’язується. Це найвищий рівень абстракції, де система описується з точки зору її загальної мети, цілей і функцій. На цьому рівні увага зосереджена на розумінні вимог до системи та того, як вона взаємодіятиме з іншими системами.

source: Logical Level: Defines a technology-agnostic solution. This is the middle level of abstraction, where the system is described in terms of its structure and behavior. At this level, the focus is on how the system components are organized and how they interact with each other.
fr: Niveau logique : Définit une solution indépendante de la technologie. Il s'agit du niveau intermédiaire d'abstraction, où le système est décrit en termes de structure et de comportement. À ce niveau, l'accent est mis sur la manière dont les composants du système sont organisés et sur la manière dont ils interagissent les uns avec les autres.
ta: தருக்க நிலை: தொழில்நுட்ப-அஞ்ஞான தீர்வை வரையறுக்கிறது. இது சுருக்கத்தின் நடுத்தர மட்டமாகும், அங்கு கணினி அதன் கட்டமைப்பு மற்றும் நடத்தை அடிப்படையில் விவரிக்கப்பட்டுள்ளது. இந்த மட்டத்தில், கணினி கூறுகள் எவ்வாறு ஒழுங்கமைக்கப்பட்டுள்ளன, அவை எவ்வாறு ஒருவருக்கொருவர் தொடர்பு கொள்கின்றன என்பதில் கவனம் செலுத்துகிறது.
uk: Логічний рівень: визначає технологічно-незалежне рішення. Це середній рівень абстракції, де система описується з точки зору її структури та поведінки. На цьому рівні основна увага приділяється тому, як організовані компоненти системи та як вони взаємодіють один з одним.

source: Technology Level: Sometimes also called Physical level. Defines the detailed technical solution. This is the lowest level of abstraction, where the system is described in terms of its components and their properties. At this level, the focus is on the details of the system's implementation.
fr: Niveau technologique : Parfois également appelé niveau physique. Définit la solution technique détaillée. Il s'agit du niveau d'abstraction le plus bas, où le système est décrit en termes de ses composants et de leurs propriétés. À ce niveau, l'accent est mis sur les détails de la mise en œuvre du système.
ta: தொழில்நுட்ப நிலை: சில நேரங்களில் உடல் நிலை என்றும் அழைக்கப்படுகிறது. விரிவான தொழில்நுட்ப தீர்வை வரையறுக்கிறது. இது சுருக்கத்தின் மிகக் குறைந்த நிலை ஆகும், அங்கு கணினி அதன் கூறுகள் மற்றும் அவற்றின் பண்புகளின் அடிப்படையில் விவரிக்கப்பட்டுள்ளது. இந்த மட்டத்தில், கணினியின் செயல்பாட்டின் விவரங்களில் கவனம் செலுத்தப்படுகிறது.
uk: Технологічний рівень: іноді також називається фізичним рівнем. Визначає детальне технічне рішення. Це найнижчий рівень абстракції, де система описується з точки зору її компонентів та їхніх властивостей. На цьому рівні основна увага приділяється деталям реалізації системи.

source: Each level of abstraction provides a different perspective on the system, and each level is important for different aspects of system design and analysis. For example, the conceptual level is important for understanding the overall goals and requirements of the system, while the physical level is important for understanding how the system will be built and how it will interact with the environment.
fr: Chaque niveau d'abstraction offre une perspective différente sur le système, et chaque niveau est important pour différents aspects de la conception et de l'analyse du système. Par exemple, le niveau conceptuel est important pour comprendre les objectifs et les exigences globales du système, tandis que le niveau physique est important pour comprendre comment le système sera construit et comment il interagira avec l'environnement.
ta: சுருக்கத்தின் ஒவ்வொரு மட்டமும் கணினியில் வேறுபட்ட முன்னோக்கை வழங்குகிறது, மேலும் ஒவ்வொரு நிலையும் கணினி வடிவமைப்பு மற்றும் பகுப்பாய்வின் வெவ்வேறு அம்சங்களுக்கு முக்கியமானது. எடுத்துக்காட்டாக, அமைப்பின் ஒட்டுமொத்த குறிக்கோள்கள் மற்றும் தேவைகளைப் புரிந்துகொள்வதற்கு கருத்தியல் நிலை முக்கியமானது, அதே நேரத்தில் கணினி எவ்வாறு கட்டமைக்கப்படும், அது சுற்றுச்சூழலுடன் எவ்வாறு தொடர்பு கொள்ளும் என்பதைப் புரிந்துகொள்ள உடல் நிலை முக்கியமானது.
uk: Кожен рівень абстракції забезпечує різний погляд на систему, і кожен рівень важливий для різних аспектів проектування та аналізу системи. Наприклад, концептуальний рівень важливий для розуміння загальних цілей і вимог системи, тоді як фізичний рівень важливий для розуміння того, як система буде побудована і як вона взаємодіятиме з навколишнім середовищем.
