Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: All comments beginning with the phrase "todo" can be highlighted in a different user-specific colour. This can be used to make yourself aware that you have to do some additional work to finalize the diagram.
es: Todos los comentarios que empiecen por la frase "todo" pueden resaltarse con un color diferente específico para cada usuario. Esto puede usarse para avisarle de que tiene que hacer algún trabajo adicional para finalizar el diagrama.
fr: Tous les commentaires commençant par la phrase « À faire » ("todo") peuvent être mis en évidence dans une couleur différente pour chaque utilisateur. Cela peut vous permettre de prendre conscience qu'il vous reste du travail à effectuer pour finaliser le diagramme.
ta: "செய்யவேண்டிய" என்ற சொற்றொடருடன் தொடங்கும் அனைத்து கருத்துகளையும் வேறு பயனர் குறிப்பிட்ட நிறத்தில் முன்னிலைப்படுத்தலாம். வரைபடத்தை இறுதி செய்ய நீங்கள் சில கூடுதல் வேலைகளைச் செய்ய வேண்டும் என்பதை நீங்களே அறிந்து கொள்ள இது பயன்படுத்தப்படலாம்.
uk: Усі коментарі, що починаються з фрази "todo", можуть бути виділені іншим кольором, призначеним для користувача. Це може бути використано для того, щоб нагадати собі, що вам потрібно виконати додаткову роботу, щоб завершити діаграму.

source: highlighted todo note
es: nota destacada
fr: note de tâche surlignée
ta: சிறப்பம்சமாக செய்யவேண்டிய குறிப்பு
uk: виділена нотатка про завдання

source: Emphesize abstract classes and operations
fr: Mettre l'accent sur les classes et les opérations abstraites
ta: சுருக்க வகுப்புகள் மற்றும் செயல்பாடுகளை வலியுறுத்துங்கள்
uk: Підкресліть абстрактні класи та операції

source: It may be that the italic font used is not distinguishable enough to differentiate between concrete and abstract classes or operations. To make this work we check if the `isAbstract` attribute is set on the element:
fr: Il se peut que la police italique utilisée ne permette pas de distinguer les classes ou les opérations concrètes des opérations abstraites. Pour ce faire, nous vérifions si l'attribut `isAbstract` est défini sur l'élément en question :
ta: பயன்படுத்தப்படும் சாய்வு எழுத்துரு கான்கிரீட் மற்றும் சுருக்க வகுப்புகள் அல்லது செயல்பாடுகளுக்கு இடையில் வேறுபடுவதற்கு போதுமானதாக இல்லை. இந்த வேலையைச் செய்ய, `ஐசாப்ச்ட்ராக்ட்` பண்புக்கூறு உறுப்பில் அமைக்கப்பட்டுள்ளதா என்பதை நாங்கள் சரிபார்க்கிறோம்:
uk: Можливо, використаний курсивний шрифт недостатньо помітний, щоб розрізнити конкретні та абстрактні класи або операції. Щоб це виправити, ми перевіряємо, чи встановлено для елемента атрибут `isAbstract`:

source: emphasize abstract elements
fr: Mettre l'accent sur les éléments abstraits
ta: சுருக்க கூறுகளை வலியுறுத்துங்கள்
uk: підкреслити абстрактні елементи

source: System Style Sheet
fr: Feuille de Style du Système
ta: கணினி நடை தாள்
uk: Таблиця стилів системи

source: Undo Manager
es: Gestor de deshacer
fr: Gestionnaire d'annulation
ta: மேலாளரை செயல்தவிர்க்கவும்
uk: Скасувати менеджер

source: Undo is a required feature in modern applications. Gaphor is no exception. Having an undo function in place means you can change the model and easily revert to an older state.
es: Deshacer es una característica necesaria en las aplicaciones modernas. Gaphor no es una excepción. Tener una función de deshacer en su lugar significa que puede cambiar el modelo y fácilmente volver a un estado anterior.
fr: L'annulation est une fonctionnalité indispensable dans les applications modernes. Gaphor ne fait pas exception. Disposer d'une fonction d'annulation permet de modifier le modèle et de revenir facilement à un état antérieur.
ta: நவீன பயன்பாடுகளில் செயல்தவிர் தேவையான அம்சமாகும். கஃபர் விதிவிலக்கல்ல. இடத்தில் செயல்தவிர் செயல்பாட்டைக் கொண்டிருப்பது என்பது நீங்கள் மாதிரியை மாற்றி பழைய நிலைக்கு எளிதாக மாற்றலாம் என்பதாகும்.
uk: Скасування є обов’язковою функцією в сучасних програмах. Гафор не виняток. Наявність функції скасування означає, що ви можете змінити модель і легко повернутися до старішого стану.

source: Overview of Transactions
es: Resumen de las transacciones
fr: Aperçu des transactions
ta: பரிவர்த்தனைகளின் கண்ணோட்டம்
uk: Огляд транзакцій

source: The recording and playback of changes in Gaphor is handled by the the Undo Manager. The Undo Manager works transactionally. A transaction must succeed or fail as a complete unit. If the transaction fails in the middle, it is rolled back. In Gaphor this is achieved by the :mod:`~gaphor.transaction` module, which provides a context manager :obj:`~gaphor.transaction.Transaction`.
fr: L'enregistrement et la lecture des modifications dans Gaphor sont gérés par ce dernier. Celui-ci fonctionne de manière transactionnelle. Une transaction doit réussir ou échouer dans son ensemble. Si elle échoue en cours de route, elle est annulée. Dans Gaphor, ceci est réalisé par le module :mod:`~gaphor.transaction`, qui fournit un gestionnaire de contexte :obj:`~gaphor.transaction.Transaction`.
ta: கஃபரில் ஏற்படும் மாற்றங்களின் பதிவு மற்றும் பின்னணி செயல்தவிர் மேலாளரால் கையாளப்படுகிறது. செயல்தவிர் மேலாளர் பரிவர்த்தனை ரீதியாக வேலை செய்கிறார். ஒரு பரிவர்த்தனை ஒரு முழுமையான அலகு என வெற்றிபெற வேண்டும் அல்லது தோல்வியடைய வேண்டும். பரிவர்த்தனை நடுவில் தோல்வியுற்றால், அது மீண்டும் உருட்டப்படுகிறது. Kaphor இல் இது :mod:`~gaphor.transaction` தொகுதியால் அடையப்படுகிறது, இது ஒரு சூழல் மேலாளரை :obj:`~gaphor.transaction.Transaction` ஐ வழங்குகிறது.
uk: Запис і відтворення змін у Gaphor здійснюється за допомогою Менеджера скасувань. Менеджер скасувань працює транзакційно. Транзакція повинна бути успішною або неуспішною як єдине ціле. Якщо транзакція зазнає невдачі в середині, вона відкочується назад. У Gaphor це досягається за допомогою модуля :mod:`~gaphor.transaction`, який надає контекстний менеджер :obj:`~gaphor.transaction.Transaction`.

source: When transactions take place, they emit events when the top-most transaction begins and is finished. The event notifications are for the begin of the transaction, and the commit of the transaction if it is successful or the rollback of the transaction if it fails.
fr: Lorsque des transactions ont lieu, elles émettent des événements lors du début et de la fin de la transaction la plus élevée. Les notifications d'événements concernent le début de la transaction, sa validation en cas de succès ou le retour en arrière en cas d'échec.
ta: பரிவர்த்தனைகள் நடைபெறும் போது, அவை சிறந்த பரிவர்த்தனை தொடங்கி முடிந்ததும் நிகழ்வுகளை வெளியிடுகின்றன. நிகழ்வு அறிவிப்புகள் பரிவர்த்தனையின் தொடக்கத்திற்கானவை, மேலும் பரிவர்த்தனை வெற்றிகரமாக இருந்தால் அல்லது அது தோல்வியுற்றால் பரிவர்த்தனையின் மறுசீரமைப்பு.
uk: Коли відбуваються транзакції, вони випромінюють події, коли починається і завершується транзакція, що знаходиться зверху. Сповіщення про події стосуються початку транзакції, фіксації транзакції, якщо вона успішна, або відкату транзакції, якщо вона не вдалася.

source: The Undo Manager only allows changes to be made in a transaction. If a change is made outside a transaction, an exception is raised.
fr: Le gestionnaire d'annulation ne permet d'effectuer des modifications que dans le cadre d'une transaction. Si une modification est effectuée en dehors d'une transaction, une exception est levée.
ta: செயல்தவிர் மேலாளர் ஒரு பரிவர்த்தனையில் மாற்றங்களை மட்டுமே அனுமதிக்கிறார். ஒரு பரிவர்த்தனைக்கு வெளியே ஒரு மாற்றம் செய்யப்பட்டால், ஒரு விதிவிலக்கு எழுப்பப்படுகிறது.
uk: Менеджер скасувань дозволяє лише вносити зміни в транзакцію. Якщо зміна вноситься поза транзакцією, виникає виняток.

source: Start of a Transaction
es: Inicio de una transacción
fr: Début d'une transaction
ta: ஒரு பரிவர்த்தனையின் தொடக்க
uk: Початок транзакції

source: A `Transaction` object is created.
es: Se crea un objeto `Transaction`.
ta: ஒரு `பரிவர்த்தனை` பொருள் உருவாக்கப்பட்டுள்ளது.
uk: Створюється об’єкт `Transaction`.

source: `TransactionBegin` event is emitted.
es: Se emite el evento `TransactionBegin`.
ta: `பரிவர்த்தனை பெசின்` நிகழ்வு வெளியேற்றப்படுகிறது.
uk: Випускається подія `TransactionBegin`.

source: The `UndoManager` instantiates a new `ActionStack` which is the transaction object, and adds the undo action to the stack.
es: El `UndoManager` instancia una nueva `ActionStack` que es el objeto de la transacción, y añade la acción de deshacer a la pila.
ta: `Undomanager` ஒரு புதிய` அதிரடிச்டாக்` இன் உடனடி, இது பரிவர்த்தனை பொருளாகும், மேலும் செயல்தவிர் செயலை அடுக்கில் சேர்க்கிறது.
uk: `UndoManager` створює новий `ActionStack`, який є об’єктом транзакції, і додає дію скасування до стеку.

source: Nested transactions are supported to allow a transaction to be added inside of another transaction that is already in progress.
es: Se admiten transacciones anidadas para permitir que se añada una transacción dentro de otra que ya esté en curso.
fr: Les transactions imbriquées sont prises en charge pour permettre l'ajout d'une transaction à l'intérieur d'une autre transaction déjà en cours.
ta: ஏற்கனவே நடந்து கொண்டிருக்கும் மற்றொரு பரிவர்த்தனைக்குள் ஒரு பரிவர்த்தனை சேர்க்க அனுமதிக்க உள்ளமைக்கப்பட்ட பரிவர்த்தனைகள் ஆதரிக்கப்படுகின்றன.
uk: Вкладені транзакції підтримуються, щоб дозволити додавати транзакцію всередину іншої транзакції, яка вже виконується.

source: Successful Transaction
es: Transacción exitosa
fr: Transaction réussie
ta: வெற்றிகரமான பரிவர்த்தனை
uk: Успішна транзакція

source: A `TransactionCommit` event is emitted
es: Se emite un evento `TransactionCommit`
ta: ஒரு `TransactionCommit` நிகழ்வு உமிழப்படுகிறது
uk: Випускається подія `TransactionCommit`

source: The `UndoManager` closes and stores the transaction.
es: El `UndoManager` cierra y almacena la transacción.
ta: `Undomanager` பரிவர்த்தனையை மூடிவிட்டு சேமிக்கிறது.
uk: `UndoManager` закриває та зберігає транзакцію.

source: Failed Transaction
es: Transacción fallida
fr: Échec de la transaction
ta: தோல்வியுற்ற பரிவர்த்தனை
uk: Невдала транзакція

source: A `TransactionRollback` event is emitted.
es: Se emite un evento `TransactionRollback`.
ta: ஒரு `TransactionRollback` நிகழ்வு வெளியேற்றப்படுகிறது.
uk: Випускається подія `TransactionRollback`.

source: The `UndoManager` plays back all the recorded actions, but does not store it.
es: El `UndoManager` reproduce todas las acciones grabadas, pero no las almacena.
ta: `Undomanager` பதிவுசெய்யப்பட்ட அனைத்து செயல்களையும் மீண்டும் இயக்குகிறது, ஆனால் அதை சேமிக்காது.
uk: `UndoManager` відтворює всі записані дії, але не зберігає їх.

source: Transaction API
fr: API de transaction
ta: பரிவர்த்தனை பநிஇ
uk: API транзакцій

source: You only require transactions if the undo manager is active.
fr: Les transactions ne sont nécessaires que si le gestionnaire d'annulation est actif.
ta: செயல்தவிர் மேலாளர் செயலில் இருந்தால் மட்டுமே உங்களுக்கு பரிவர்த்தனைகள் தேவை.
uk: Вам потрібні транзакції, лише якщо активний менеджер скасування.

source: The transaction.
fr: La transaction.
ta: பரிவர்த்தனை.
uk: Транзакція.

source: On start and end of a transaction an event is emitted. Transactions can be nested. Events are only emitted when the outermost transaction begins and finishes.
fr: Un événement est émis au début et à la fin d'une transaction. Les transactions peuvent être imbriquées. Les événements ne sont émis qu'au début et à la fin de la transaction la plus externe.
ta: ஒரு பரிவர்த்தனையின் தொடக்கத்திலும் முடிவிலும் ஒரு நிகழ்வு வெளிப்படும். பரிவர்த்தனைகள் கூடு கட்டப்படலாம். வெளிப்புற பரிவர்த்தனை தொடங்கி முடிவடையும் போது மட்டுமே நிகழ்வுகள் வெளிப்படும்.
uk: На початку та в кінці транзакції генерується подія. Транзакції можуть бути вкладеними. Події генеруються лише тоді, коли починається та закінчується зовнішня транзакція.

source: Note that transactions are a global construct.
fr: Notez que les transactions sont un concept global.
ta: பரிவர்த்தனைகள் உலகளாவிய கட்டமைப்பாகும் என்பதை நினைவில் கொள்க.
uk: Зверніть увагу, що транзакції є глобальною конструкцією.

source: Transactions can be nested. If the outermost transaction is committed or rolled back, an event is emitted.
fr: Les transactions peuvent être imbriquées. Si la transaction la plus externe est validée ou annulée, un événement est émis.
ta: பரிவர்த்தனைகள் கூடு கட்டப்படலாம். வெளிப்புற பரிவர்த்தனை செய்யப்பட்டால் அல்லது மீண்டும் உருட்டப்பட்டால், ஒரு நிகழ்வு வெளிப்படும்.
uk: Транзакції можуть бути вкладеними. Якщо зовнішня транзакція фіксується або відкочується, виникає подія.

source: It's most convenient to use ``Transaction`` as a context manager:
fr: Il est plus pratique d'utiliser ``Transaction`` comme gestionnaire de contexte :
ta: சூழல் மேலாளராக ``Transaction`` ஐப் பயன்படுத்துவது மிகவும் வசதியானது:
uk: Найзручніше використовувати ``Transaction`` як контекстний менеджер:

source: Events can be handled programmatically, although this is discouraged:
fr: Les événements peuvent être gérés par programme, bien que cela soit déconseillé :
ta: நிகழ்வுகளை நிரல் முறையில் கையாள முடியும், இருப்பினும் இது ஊக்கமளிக்கிறது:
uk: Події можна обробляти програмно, хоча це не рекомендується:

source: Commit the transaction.
fr: Mises à jour des traductions.
ta: பரிவர்த்தனை செய்யுங்கள்.
uk: Зафіксуйте транзакцію.

source: The transaction is closed. A :obj:`~gaphor.event.TransactionCommit` event is emitted. If the transaction needs to be rolled back, a :obj:`~gaphor.event.TransactionRollback` event is emitted instead.
fr: La transaction est clôturée. Un événement :obj:`~gaphor.event.TransactionCommit` est émis. Si la transaction doit être annulée, un événement :obj:`~gaphor.event.TransactionRollback` est émis à la place.
ta: பரிவர்த்தனை மூடப்பட்டுள்ளது. ப :obj:`~gaphor.event.TransactionCommit` நிகழ்வு உமிழப்படுகிறது. பரிவர்த்தனையை மீண்டும் உருட்ட வேண்டும் என்றால், a :obj:`~gaphor.event.TransactionRollback` நிகழ்வு அதற்கு பதிலாக வெளியேற்றப்படுகிறது.
uk: Транзакцію закрито. Випускається подія :obj:`~gaphor.event.TransactionCommit`. Якщо транзакцію потрібно відкотити, натомість створюється подія :obj:`~gaphor.event.TransactionRollback`.

source: Are you running inside a transaction?
fr: Êtes-vous en train d'effectuer une transaction ?
ta: நீங்கள் ஒரு பரிவர்த்தனைக்குள் ஓடுகிறீர்களா?
uk: Ви працюєте всередині транзакції?

source: Mark the transaction for rollback.
fr: Marquer la transaction pour un retour en arrière.
ta: ரோல்பேக்கிற்கான பரிவர்த்தனையைக் குறிக்கவும்.
uk: Позначте транзакцію для відкату.

source: This operation itself will not close the transaction, instead it will allow you to elegantly revert changes.
fr: Cette opération en elle-même ne clôturera pas la transaction, mais vous permettra de revenir élégamment sur les modifications.
ta: இந்த செயல்பாடு பரிவர்த்தனையை மூடாது, அதற்கு பதிலாக மாற்றங்களை நேர்த்தியாக மாற்றியமைக்க இது உங்களை அனுமதிக்கும்.
uk: Ця операція сама по собі не закриє транзакцію, натомість вона дозволить вам елегантно скасувати зміни.

source: Roll-back the transaction.
fr: Reprendre la transaction.
ta: பரிவர்த்தனை ரோல்-பேக்.
uk: Відкат транзакції.

source: First, the transaction is closed. A :obj:`~gaphor.event.TransactionRollback` event is emitted.
fr: Tout d'abord, la transaction est fermée. Un événement :obj:`~gaphor.event.TransactionRollback` est émis.
ta: முதலில், பரிவர்த்தனை மூடப்பட்டுள்ளது. ப :obj:`~gaphor.event.TransactionRollback` நிகழ்வு உமிழப்படுகிறது.
uk: По-перше, угода закрита. Випускається подія :obj:`~gaphor.event.TransactionRollback`.

source: This event denotes the beginning of a transaction.
fr: Cet événement marque le début d'une transaction.
ta: இந்த நிகழ்வு ஒரு பரிவர்த்தனையின் தொடக்கத்தைக் குறிக்கிறது.
uk: Ця подія означає початок транзакції.

source: Nested (sub-) transactions should not emit this signal.
fr: Les transactions (sous-) imbriquées ne doivent pas émettre ce signal.
ta: உள்ளமைக்கப்பட்ட (துணை) பரிவர்த்தனைகள் இந்த சமிக்ஞையை வெளியிடக்கூடாது.
uk: Вкладені (під) транзакції не повинні видавати цей сигнал.

source: This event is emitted when a transaction (toplevel) is successfully committed.
fr: Cet événement est émis lorsqu'une transaction (de niveau supérieur) est validée avec succès.
ta: ஒரு பரிவர்த்தனை (டோப்ல்வெல்) வெற்றிகரமாக உறுதியளிக்கும் போது இந்த நிகழ்வு வெளிப்படும்.
uk: Ця подія виникає, коли транзакція (верхнього рівня) успішно фіксується.

source: This event is emitted to tell the operation has failed.
fr: Cet événement est émis pour indiquer que l'opération a échoué.
ta: இந்த நிகழ்வு தோல்வியுற்றது என்று சொல்ல இந்த நிகழ்வு உமிழ்கிறது.
uk: Ця подія сповіщає про помилку операції.

source: If a set of operations fail (e.i. due to an exception) the transaction should be marked for rollback.
fr: Si un ensemble d'opérations échoue (par exemple en raison d'une exception), la transaction doit être marquée pour un retour en arrière.
ta: செயல்பாடுகளின் தொகுப்பு தோல்வியுற்றால் (விதிவிலக்கு காரணமாக ஈ.ஐ.
uk: Якщо набір операцій не вдається (тобто через виняток), транзакцію слід позначити для відкоту.

source: References
es: Referencias
fr: Références
ta: குறிப்புகள்
uk: Список літератури

source: [A Framework for Undoing Actions in Collaborative Systems](http://web.eecs.umich.edu/~aprakash/papers/undo-tochi94.pdf)
es: [Un marco para deshacer acciones en sistemas colaborativos](http://web.eecs.umich.edu/~aprakash/papers/undo-tochi94.pdf)
ta: [A Framework க்கு Undoing செயல்கள் in Collaborative Systems](http://web.eecs.umich.edu/~aprakash/papers/undo-tochi94.pdf)

source: [Undoing Actions in Collaborative Work: Framework and Experience](https://www.eecs.umich.edu/techreports/cse/94/CSE-TR-196-94.pdf)
es: [Deshacer acciones en el trabajo colaborativo: marco y experiencia](https://www.eecs.umich.edu/techreports/cse/94/CSE-TR-196-94.pdf)
ta: [Undoing செயல்கள் in Collaborative Work: Framework and Experience](https://www.eecs.umich.edu/techreports/cse/94/CSE-TR-196-94.pdf)

source: [Implementing a Selective Undo Framework in Python](https://legacy.python.org/workshops/1997-10/proceedings/zukowski.html)
es: [Implementación de un marco de deshacer selectivo en Python](https://legacy.python.org/workshops/1997-10/proceedings/zukowski.html)
ta: [Implementing a Selective செயல்தவிர் Framework in Python](https://legacy.python.org/workshops/1997-10/proceedings/zukowski.html)

source: Gaphor on Windows
es: Gaphor en Windows
fr: Gaphor sur Windows
ta: சாளரங்களில் கஃபர்
uk: Gaphor у Windows

source: Gaphor can be installed as with our installer. Check out the [Gaphor download page](https://gaphor.org/download#windows) for details.
fr: Gaphor peut être installé avec notre programme d'installation. Consultez la [page de téléchargement de Gaphor] (https://gaphor.org/download#windows) pour plus de détails.
ta: எங்கள் நிறுவியைப் போல கஃபர் நிறுவப்படலாம். விவரங்களுக்கு [kaphor பதிவிறக்கம் பக்கம்](https://gaphor.org/ta/download#windows) ஐப் பாருங்கள்.
uk: Gaphor можна встановити як за допомогою нашого інсталятора. Перегляньте подробиці на [сторінці завантаження Gaphor](https://gaphor.org/download#windows).

source: WinGet
ta: சாளரபெறு

source: We recommend using [WinGet](https://learn.microsoft.com/en-us/windows/package-manager/winget) as a package manager in Windows. It is available on Windows 11 and modern versions of Windows 10 as a part of the App Installer.
fr: Nous recommandons d'utiliser [WinGet] (https://learn.microsoft.com/en-us/windows/package-manager/winget) comme gestionnaire de paquets sous Windows. Il est disponible sur Windows 11 et les versions modernes de Windows 10 en tant qu'élément de l'App Installer.
ta: சாளரங்களில் ஒரு தொகுப்பு மேலாளராக [Winget](https://learn.microsoft.com/en-us/windows/package-manager/winget) ஐப் பயன்படுத்த பரிந்துரைக்கிறோம். இது பயன்பாட்டு நிறுவியின் ஒரு பகுதியாக சாளரங்கள் 11 மற்றும் சாளரங்கள் 10 இன் நவீன பதிப்புகளில் கிடைக்கிறது.
uk: Ми рекомендуємо використовувати [WinGet](https://learn.microsoft.com/en-us/windows/package-manager/winget) як менеджер пакунків у Windows. Він доступний у Windows 11 та сучасних версіях Windows 10 як частина Інсталятора додатків.

source: If you have a slightly older version of Windows, you can alternatively use [Chocolatey](https://chocolatey.org) as a package manager. After it is installed, execute `choco install` instead of the `winget install` commands below.
fr: Si vous avez une version un peu plus ancienne de Windows, vous pouvez également utiliser [Chocolatey](https://chocolatey.org) comme gestionnaire de paquets. Après l'avoir installé, exécutez `choco install` à la place des commandes `winget install` ci-dessous.
ta: விண்டோசின் சற்று பழைய பதிப்பு உங்களிடம் இருந்தால், நீங்கள் மாற்றாக [சாக்லேட்](https://chocoladey.org) ஒரு தொகுப்பு மேலாளராகப் பயன்படுத்தலாம். இது நிறுவப்பட்ட பிறகு, கீழே உள்ள `விங்கெட் நிறுவல்` கட்டளைகளுக்கு பதிலாக` CHOCO Install` ஐ இயக்கவும்.
uk: Якщо у вас трохи старіша версія Windows, ви можете скористатися [Chocolatey](https://chocolatey.org) як менеджером пакунків. Після встановлення пакунків виконайте `choco install` замість команд `winget install`, наведених нижче.

source: Git
ta: அறிவிலி

source: To set up a development environment in Windows first install [Git](https://gitforwindows.org) by executing as an administrator:
fr: Pour mettre en place un environnement de développement sous Windows, installez d'abord [Git] (https://gitforwindows.org) en vous exécutant en tant qu'administrateur :
ta: சாளரங்களில் ஒரு மேம்பாட்டு சூழலை அமைக்க முதலில் [git] (https://gitforwindows.org) ஒரு நிர்வாகியாக இயக்குவதன் மூலம் நிறுவவும்:
uk: Щоб налаштувати середовище розробки в Windows, спершу інсталюйте [Git](https://gitforwindows.org), виконавши від імені адміністратора:

source: GTK and Python with Gvsbuild
fr: GTK et Python avec Gvsbuild
ta: சி.டி.கே.பில்ட் உடன் சி.டி.கே மற்றும் பைதான்
uk: GTK і Python з Gvsbuild

source: Gvsbuild provides pre-built GTK libraries for Windows. We will install these libraries and Python.
fr: Gvsbuild fournit des bibliothèques GTK préconstruites pour Windows. Nous allons installer ces bibliothèques et Python.
ta: GVSBUILD விண்டோசுக்கு முன்பே கட்டப்பட்ட சி.டி.கே நூலகங்களை வழங்குகிறது. இந்த நூலகங்களையும் பைத்தானையும் நிறுவுவோம்.
uk: Gvsbuild надає попередньо зібрані бібліотеки GTK для Windows. Ми встановимо ці бібліотеки та Python.

source: Install the Latest Python
es: Instalar la última versión de Python
fr: Installer la dernière version de Python
ta: அண்மைக் கால பைத்தானை நிறுவவும்
uk: Установіть останню версію Python

source: In Windows, The full installer contains all the Python components and is the best option for developers using Python for any kind of project.
es: En Windows, el instalador completo contiene todos los componentes de Python y es la mejor opción para los desarrolladores que usen Python para cualquier tipo de proyecto.
fr: Sous Windows, le programme d'installation complet contient tous les composants Python et constitue la meilleure option pour les développeurs qui utilisent Python pour tous leurs projets.
ta: சாளரங்களில், முழு நிறுவி அனைத்து பைதான் கூறுகளையும் கொண்டுள்ளது மற்றும் எந்தவொரு திட்டத்திற்கும் பைத்தானைப் பயன்படுத்தும் டெவலப்பர்களுக்கு சிறந்த வழி.
uk: У Windows повний інсталятор містить усі компоненти Python і є найкращим варіантом для розробників, які використовують Python для будь-якого проекту.
