Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: On a technical level, the following principles are also applicable:
fr: Sur le plan technique, les principes suivants sont également applicables :
ta: தொழில்நுட்ப மட்டத்தில், பின்வரும் கொள்கைகளும் பொருந்தும்:
uk: На технічному рівні також застосовуються такі принципи:

source: **Idempotency** Allow the same operation to be applied multiple times. This should not affect the result.
es: **Idempotencia** Permitir que la misma operación se aplique varias veces. Esto no debería afectar al resultado.
fr: **Idempotence** Permet d'appliquer la même opération plusieurs fois. Cela ne devrait pas affecter le résultat.
ta: ** ஐடெம்போடென்சி ** ஒரே செயல்பாட்டை பல முறை பயன்படுத்த அனுமதிக்கவும். இது முடிவை பாதிக்கக்கூடாது.
uk: **Ідемпотентність** Дозволяє застосовувати ту саму операцію кілька разів. Це не повинно вплинути на результат.

source: **Event Driven** Gaphor is a user application. It acts to user events. The application uses an internal event dispatches (event bus) to distribute events to interested parties. Everyone should be able to listen to events.
es: **Dirigido por eventos** Gaphor es una aplicación de usuario. Actúa ante eventos del usuario. La aplicación usa un despachador de eventos interno (bus de eventos) para distribuir los eventos a las partes interesadas. Todo el mundo debe ser capaz de escuchar los eventos.
fr: **Piloté par les événements.** Gaphor est une application destinée aux utilisateurs. Elle réagit aux actions de l'utilisateur. Elle utilise un système de distribution d'événements interne (ou « bus d'événements ») pour les acheminer aux parties intéressées. Tout le monde peut écouter les événements.
ta: ** நிகழ்வு இயக்கப்படும் ** காஃபர் ஒரு பயனர் பயன்பாடு. இது பயனர் நிகழ்வுகளுக்கு செயல்படுகிறது. ஆர்வமுள்ள தரப்பினருக்கு நிகழ்வுகளை விநியோகிக்க பயன்பாடு உள் நிகழ்வு அனுப்புதல்களை (நிகழ்வு பச்) பயன்படுத்துகிறது. எல்லோரும் நிகழ்வுகளைக் கேட்க முடியும்.
uk: **Gaphor - це користувацький додаток, керований подіями. Він реагує на події користувача. Додаток використовує внутрішню шину подій для розповсюдження подій серед зацікавлених осіб. Кожен повинен мати можливість прослуховувати події.

source: Event System
es: Sistema de eventos
fr: Système d'événements
ta: நிகழ்வு அமைப்பு
uk: Система подій

source: The event system in Gaphor provides an API to *handle* events and to *subscribe* to events.
es: El sistema de eventos de Gaphor proporciona una API para *manejar* eventos y *suscribirse* a eventos.
fr: Le système d'événements de Gaphor fournit une API pour *gérer* les événements et pour *s'abonner* aux événements.
ta: கஃபரில் உள்ள நிகழ்வு அமைப்பு * நிகழ்வுகளை * கையாளவும், நிகழ்வுகளுக்கு * குழுசேரவும் ஒரு பநிஇ ஐ வழங்குகிறது.
uk: Система подій у Gaphor надає API для *обробки* подій і *підписки* на події.

source: In Gaphor we manage event handler subscriptions through the `EventManager` service. Gaphor is highly event driven:
es: En Gaphor gestionamos las suscripciones a los manejadores de eventos a través del servicio `EventManager`. Gaphor está altamente orientado a eventos:
fr: Dans Gaphor, nous gérons les abonnements aux gestionnaires d'événements via le service `EventManager`. Gaphor est fortement axé sur les événements :
ta: Kaphor இல் `EventAlanager` சேவையின் மூலம் நிகழ்வு கையாளுபவர் சந்தாக்களை நிர்வகிக்கிறோம். கஃபர் மிகவும் நிகழ்வு உந்துதல்:
uk: У Gaphor ми керуємо підписками на обробник подій через службу EventManager. Gaphor дуже орієнтований на події:

source: Changes in the loaded model are emitted as events
es: Los cambios en el modelo cargado se emiten como eventos
fr: Les modifications du modèle chargé sont émises sous forme d'événements
ta: ஏற்றப்பட்ட மாதிரியில் மாற்றங்கள் நிகழ்வுகளாக வெளியேற்றப்படுகின்றன
uk: Зміни в завантаженій моделі видаються як події

source: Changes on diagrams are emitted as events
es: Los cambios en los diagramas se emiten como eventos
fr: Les modifications apportées aux diagrammes sont émises sous forme d'événements
ta: வரைபடங்களில் மாற்றங்கள் நிகழ்வுகளாக வெளியேற்றப்படுகின்றன
uk: Зміни на діаграмах видаються як події

source: Changes in the UI are emitted as events
es: Los cambios en la interfaz de usuario se emiten como eventos
fr: Les modifications de l'interface utilisateur sont émises sous forme d'événements
ta: இடைமுகம் இல் மாற்றங்கள் நிகழ்வுகளாக வெளியேற்றப்படுகின்றன
uk: Зміни в інтерфейсі користувача випромінюються як події

source: Although Gaphor depends heavily on GTK for its user interface, Gaphor is using its own event dispatcher. Events can be structured in hierarchies. For example, an `AttributeUpdated` event is a subtype of `ElementUpdated`. If we are interested in all changes to elements, we can also register `ElementUpdated` and receive all `AttributeUpdated` events as well.
es: Aunque Gaphor depende en gran medida de GTK para su interfaz de usuario, Gaphor usa su propio despachador de eventos. Los eventos se pueden estructurar en jerarquías. Por ejemplo, un evento `AttributeUpdated` es un subtipo de `ElementUpdated`. Si estamos interesados en todos los cambios en los elementos, también podemos registrar `ElementUpdated` y recibir todos los eventos `AttributeUpdated` también.
fr: Bien que Gaphor dépende fortement de GTK pour son interface utilisateur, il utilise son propre système de distribution d'événements. Les événements peuvent être structurés en hiérarchies. Par exemple, un événement `AttributeUpdated` est un sous-type de `ElementUpdated`. Si nous sommes intéressés par toutes les modifications apportées aux éléments, nous pouvons également enregistrer l'événement `ElementUpdated` et recevoir tous les événements `AttributeUpdated`.
ta: காஃபர் அதன் பயனர் இடைமுகத்திற்காக சி.டி.கே. நிகழ்வுகள் படிநிலைகளில் கட்டமைக்கப்படலாம். எடுத்துக்காட்டாக, ஒரு `பண்புக்கூறு 'நிகழ்வு என்பது` எலிமெண்ட்டேட்டட்` இன் துணை வகையாகும். கூறுகளுக்கான அனைத்து மாற்றங்களிலும் நாங்கள் ஆர்வமாக இருந்தால், நாங்கள் `எலிமெண்டப் டேட்டட்` ஐ பதிவுசெய்து அனைத்து` பண்புக்கூறு 'நிகழ்வுகளையும் பெறலாம்.
uk: Хоча користувацький інтерфейс Gaphor значною мірою залежить від GTK, Gaphor використовує власний диспетчер подій. Події можна структурувати у вигляді ієрархій. Наприклад, подія `AttributeUpdated` є підтипом події `ElementUpdated`. Якщо нас цікавлять всі зміни в елементах, ми також можемо зареєструвати `ElementUpdated` і отримувати всі події `AttributeUpdated`.

source: The Event Manager provides a flexible way to dispatch events.
fr: Le gestionnaire d'événements offre un moyen souple de distribuer des événements.
ta: நிகழ்வுகளை அனுப்ப நிகழ்வு மேலாளர் ஒரு நெகிழ்வான வழியை வழங்குகிறது.
uk: Менеджер подій забезпечує гнучкий спосіб відправки подій.

source: Event dispatching is a central component in Gaphor. It allows components in Gaphor to react to changes in the application.
fr: La gestion des événements est un élément central de Gaphor. Il permet aux composants de Gaphor de réagir aux changements dans l'application.
ta: நிகழ்வு அனுப்புதல் என்பது கஃபரில் ஒரு மைய அங்கமாகும். இது பயன்பாட்டின் மாற்றங்களுக்கு எதிர்வினையாற்ற காஃபரில் உள்ள கூறுகளை அனுமதிக்கிறது.
uk: Диспетчеризація подій є центральним компонентом Gaphor. Це дозволяє компонентам Gaphor реагувати на зміни в програмі.

source: Events are dispatched by type.
fr: Les événements sont distribués par type.
ta: நிகழ்வுகள் வகை மூலம் அனுப்பப்படுகின்றன.
uk: Події розсилаються за типом.

source: Register a handler.
es: Registrar un manejador.
fr: Enregistrer un gestionnaire.
ta: ஒரு கையாளுபவரை பதிவு செய்யுங்கள்.
uk: Зареєструйте обробника.

source: Handlers are triggered (executed) when events are emitted through the :obj:`~gaphor.core.eventmanager.EventManager.handle` method.
fr: Les gestionnaires sont déclenchés (exécutés) lorsque des événements sont émis par la méthode :obj:`~gaphor.core.eventmanager.EventManager.handle`.
ta: நிகழ்வுகள் வெளிப்படும் போது கையாளுபவர்கள் தூண்டப்படுகிறார்கள் (செயல்படுத்தப்படுகிறார்கள்) :obj:`~ gaphor.core.eventmanager.EventManager.handle` முறை.
uk: Обробники запускаються (виконуються), коли події надходять через метод :obj:`~gaphor.core.eventmanager.EventManager.handle`.

source: Unregister a previously registered handler.
es: Anula el registro de un manipulador previamente registrado.
fr: Annuler l'enregistrement d'un gestionnaire précédemment enregistré.
ta: முன்னர் பதிவுசெய்யப்பட்ட கையாளுபவரை பதிவு செய்யவும்.
uk: Скасувати реєстрацію попередньо зареєстрованого обробника.

source: Send event notifications to registered handlers.
es: Enviar notificaciones de eventos a los manejadores registrados.
fr: Envoyer des notifications d'événements aux gestionnaires enregistrés.
ta: பதிவு செய்யப்பட்ட கையாளுபவர்களுக்கு நிகழ்வு அறிவிப்புகளை அனுப்பவும்.
uk: Надсилати сповіщення про події зареєстрованим обробникам.

source: Mark a function/method as an event handler for a particular type of event.
fr: Marquer une fonction/méthode comme gestionnaire d'événement pour un type d'événement particulier.
ta: ஒரு குறிப்பிட்ட வகை நிகழ்வுக்கு நிகழ்வு கையாளுபவராக ஒரு செயல்பாடு/முறையைக் குறிக்கவும்.
uk: Позначте функцію/метод як обробник події для певного типу події.

source: Given a custom event type:
fr: Compte tenu du type d'événement personnalisé :
ta: தனிப்பயன் நிகழ்வு வகை கொடுக்கப்பட்டுள்ளது:
uk: Враховуючи настроюваний тип події:

source: You can apply this to a handler method or function:
fr: Vous pouvez l'appliquer à une méthode ou à une fonction de traitement :
ta: இதை நீங்கள் ஒரு கையாளுபவர் முறை அல்லது செயல்பாட்டிற்கு பயன்படுத்தலாம்:
uk: Ви можете застосувати це до методу або функції обробника:

source: This will allow you to let the even be handled by an event manager:
fr: Cela vous permettra de laisser un gestionnaire d'événements s'occuper de l'événement :
ta: நிகழ்வு மேலாளரால் கூட கையாள அனுமதிக்க இது உங்களை அனுமதிக்கும்:
uk: Це дозволить вам дозволити керування подією менеджеру подій:

source: Under the hood events are handled by the Generics library. For more information about how the Generic library handles events see the `Generic documentation <https://generic.readthedocs.io>`_.
ta: ஊட் நிகழ்வுகளின் கீழ் செனரிக்ச் நூலகத்தால் கையாளப்படுகிறது. பொதுவான நூலகம் நிகழ்வுகளை எவ்வாறு கையாளுகிறது என்பது பற்றிய கூடுதல் தகவலுக்கு `பொதுவான ஆவணங்கள் <https://generic.readthedocs.io>`_ ஐப் பார்க்கவும்.

source: Your First Model
es: Su primer modelo
fr: Votre premier modèle
ta: உங்கள் முதல் மாதிரி
uk: Ваша перша модель

source: Although the names should speak for themselves, you can check out the [Getting Started](getting_started) page for more information.
fr: Bien que les noms parlent d'eux-mêmes, vous pouvez consulter la page [Getting Started](getting_started) pour plus d'informations.
ta: பெயர்கள் தங்களைத் தாங்களே பேச வேண்டும் என்றாலும், மேலும் தகவலுக்கு [தொடங்குதல்](getting_started) பக்கத்தைப் பார்க்கலாம்.
uk: Хоча назви повинні говорити самі за себе, ви можете переглянути сторінку [Початок роботи](getting_started) для отримання додаткової інформації.

source: Once Gaphor is started, and you can start a new model with the _Generic_ template. The initial diagram is already open in the Diagram section.
es: Una vez iniciado Gaphor, puede iniciar un modelo nuevo con la plantilla _Genérico_. El diagrama inicial ya está abierto en la sección Diagrama.
fr: Une fois Gaphor lancé, vous pouvez commencer un nouveau modèle avec le modèle Générique (the _Generic_ template). Le diagramme initial est déjà ouvert dans la section « Diagramme ».
ta: கஃபர் தொடங்கப்பட்டதும், நீங்கள் _செனெரிக்_ வார்ப்புருவுடன் ஒரு புதிய மாதிரியைத் தொடங்கலாம். ஆரம்ப வரைபடம் ஏற்கனவே வரைபடப் பிரிவில் திறக்கப்பட்டுள்ளது.
uk: Після запуску Gaphor ви можете почати нову модель за допомогою шаблону _Generic_. Початкова діаграма вже відкрита в розділі Діаграма.

source: Select an element you want to place, in this case a Class (![Icon for Class.](../gaphor/ui/icons/hicolor/scalable/actions/gaphor-class-symbolic.svg)) by clicking on the icon in the Toolbox and click on the diagram. This will place a new Class item instance on the diagram and add a new Class to the model -- it shows up in the Model Browser. The selected tool will reset itself to the Pointer tool after the element is placed on the diagram.
fr: Sélectionnez un élément que vous souhaitez placer, dans ce cas une classe (![Icône de classe](../gaphor/ui/icons/hicolor/scalable/actions/gaphor-class-symbolic.svg)) en cliquant sur l'icône correspondante dans la boîte à outils, puis cliquez sur le diagramme. Cela placera une nouvelle instance de l'élément de classe sur le diagramme et ajoutera une nouvelle classe au modèle, qui apparaît alors dans le navigateur de modèle. Une fois l'élément placé sur le diagramme, l'outil sélectionné se réinitialise en outil Pointeur.
ta: கருவிப்பெட்டியில் உள்ள ஐகானைக் சொடுக்கு செய்து வரைபடத்தில் சொடுக்கு செய்வதன் மூலம் ஒரு வகுப்பு (![வகுப்பிற்கான ஐகான்.](../gaphor/ui/icons/hicolor/scalable/actions/gaphor-class-symbolic.svg)) இது வரைபடத்தில் ஒரு புதிய வகுப்பு உருப்படி நிகழ்வை வைக்கும் மற்றும் மாதிரியில் ஒரு புதிய வகுப்பை சேர்க்கும் - இது மாதிரி உலாவியில் காண்பிக்கப்படும். வரைபடத்தில் உறுப்பு வைக்கப்பட்ட பிறகு தேர்ந்தெடுக்கப்பட்ட கருவி சுட்டிக்காட்டி கருவிக்கு தன்னை மீட்டமைக்கும்.
uk: Виберіть елемент, який ви хочете розмістити, у цьому випадку клас (![Іконка для класу.](../gaphor/ui/icons/hicolor/scalable/actions/gaphor-class-symbolic.svg)), натиснувши на іконку на панелі інструментів, і клацніть на діаграмі. Це розмістить новий екземпляр класу на діаграмі і додасть новий клас до моделі - він з'явиться у Браузері моделей. Після розміщення елемента на діаграмі вибраний інструмент зміниться на інструмент Вказівник.

source: Icon for Class.
fr: Icône pour la classe.
ta: வகுப்பிற்கான படவுரு.
uk: Значок для класу.

source: The Property Editor on the right side will show you details about the newly added class, such as its name (_New Class_), attributes and operations (methods). The Note field can contain any text you wish to associate with the element, (this will not show on a diagram).
fr: L'éditeur de propriétés situé à droite vous indiquera des informations détaillées sur la classe nouvellement ajoutée, telles que son nom (_Nouvelle classe_), ses attributs et ses opérations (méthodes). Le champ Note peut contenir tout texte que vous souhaitez associer à l'élément (il n'apparaîtra pas sur un diagramme).
ta: வலது பக்கத்தில் உள்ள சொத்து எடிட்டர் புதிதாக சேர்க்கப்பட்ட வகுப்பு, அதாவது அதன் பெயர் (_new வகுப்பு_), பண்புக்கூறுகள் மற்றும் செயல்பாடுகள் (முறைகள்) போன்ற விவரங்களைக் காண்பிக்கும். குறிப்பு புலத்தில் நீங்கள் உறுப்புடன் இணைக்க விரும்பும் எந்த உரையையும் கொண்டிருக்கலாம், (இது ஒரு வரைபடத்தில் காட்டப்படாது).
uk: Редактор властивостей праворуч покаже вам детальну інформацію про щойно доданий клас, зокрема його назву (_Новий клас_), атрибути та операції (методи). Поле Примітка може містити будь-який текст, який ви бажаєте пов'язати з елементом (на діаграмі він не відображатиметься).

source: ![The Gaphor main window showing a single class added to the model.](images/first-model-class.png)
fr: ![La fenêtre principale de Gaphor montrant une seule classe ajoutée au modèle](images/first-model-class.png)
ta: ![மாதிரியில் சேர்க்கப்பட்ட ஒற்றை வகுப்பைக் காட்டும் காஃபோர் முதன்மை சாளரம்.](images/first-model-class.png)
uk: ![Головне вікно Gaphor, у якому показано один клас, доданий до моделі.](images/first-model-class.png)

source: The Gaphor main window showing a single class added to the model.
fr: La fenêtre principale de Gaphor montre une seule classe ajoutée au modèle.
ta: மாதிரியில் சேர்க்கப்பட்ட ஒற்றை வகுப்பைக் காட்டும் கஃபர் முதன்மையான சாளரம்.
uk: Головне вікно Gaphor, у якому показано один клас, доданий до моделі.

source: It's simple to add elements to a diagram.
es: Añadir elementos a un diagrama es muy sencillo.
fr: Il est facile d'ajouter des éléments à un diagramme.
ta: ஒரு வரைபடத்தில் கூறுகளைச் சேர்ப்பது எளிது.
uk: До діаграми легко додавати елементи.

source: Gaphor does not make any assumptions about which elements should be placed on a diagram. A diagram is a diagram. UML defines all different kinds of diagrams, such as Class diagrams, Component diagrams, Action diagrams, Sequence diagrams. But Gaphor does not place any restrictions.
es: Gaphor no hace suposiciones sobre qué elementos deben colocarse en un diagrama. Un diagrama es un diagrama. UML define todos los diferentes tipos de diagramas, tales como diagramas de clase, diagramas de componentes, diagramas de acción, diagramas de secuencia. Pero Gaphor no impone ninguna restricción.
fr: Gaphor ne fait aucune supposition quant aux éléments à placer sur un diagramme. Un diagramme est un diagramme. UML définit toutes sortes de diagrammes, tels que les diagrammes de classes, les diagrammes de composants, les diagrammes d'actions et les diagrammes de séquences. Mais Gaphor n'impose aucune restriction.
ta: எந்த கூறுகளை ஒரு வரைபடத்தில் வைக்க வேண்டும் என்பது குறித்து எந்தவொரு அனுமானங்களையும் கஃபர் செய்யவில்லை. ஒரு வரைபடம் ஒரு வரைபடம். வகுப்பு வரைபடங்கள், கூறு வரைபடங்கள், செயல் வரைபடங்கள், வரிசை வரைபடங்கள் போன்ற அனைத்து வகையான வரைபடங்களையும் யுஎம்எல் வரையறுக்கிறது. ஆனால் காஃபர் எந்த கட்டுப்பாடுகளையும் வைக்கவில்லை.
uk: Gaphor не робить жодних припущень щодо того, які елементи слід розміщувати на діаграмі. Діаграма є діаграмою. UML визначає різні типи діаграм, такі як діаграми класів, діаграми компонентів, діаграми дій, діаграми послідовності. Але Gaphor не накладає жодних обмежень.

source: Adding Relations
es: Añadir relaciones
fr: Ajout de relations
ta: உறவுகளைச் சேர்ப்பது
uk: Додавання відносин

source: Add another Class. Change the names to `Shape` and `Circle`. Let's define that `Circle` is a sub-type of `Shape`. You can do this by selecting one and changing the name in the Property Editor, or by double-clicking the element.
es: Añada otra clase. Cambie los nombres a `Forma` y `Círculo`. Definamos que `Círculo` es un subtipo de `Forma`. Puede hacerlo seleccionando uno y cambiando el nombre en el Editor de propiedades, o haciendo doble clic en el elemento.
fr: Ajoutez une autre classe. Changez les noms en `Shape`(Forme) et `Circle`(Cercle). Définissons que `Circle` est un sous-type de `Shape`. Vous pouvez le faire en sélectionnant un élément et en changeant son nom dans l'éditeur de propriétés, ou en double-cliquant sur l'élément.
ta: மற்றொரு வகுப்பு சேர்க்கவும். பெயர்களை `வடிவம்` மற்றும்` வட்டம்` என மாற்றவும். `வட்டம்` என்பது` வடிவத்தின்` துணை வகை என்பதை வரையறுப்போம். ஒன்றைத் தேர்ந்தெடுத்து பெயரை சொத்து எடிட்டரில் மாற்றுவதன் மூலமோ அல்லது உறுப்பை இருமுறை சொடுக்கு செய்வதன் மூலமோ இதைச் செய்யலாம்.
uk: Додайте ще один клас. Змінимо імена на `Shape` та `Circle`. Визначимо, що `Circle` є підтипом `Shape`. Ви можете зробити це, вибравши його і змінивши назву в редакторі властивостей, або двічі клацнувши елемент.

source: Select Generalization (![Icon for generalization relationships.](../gaphor/ui/icons/hicolor/scalable/actions/gaphor-generalization-symbolic.svg)).
fr: Sélectionner la généralisation (![Icon for generalization relationships.](../gaphor/ui/icons/hicolor/scalable/actions/gaphor-generalization-symbolic.svg)).
ta: பொதுமைப்படுத்தல் என்பதைத் தேர்ந்தெடுக்கவும் (![பொதுமைப்படுத்தல் உறவுகளுக்கான ஐகான்.](../gaphor/ui/icons/hicolor/scalable/actions/gaphor-generalization-symbolic.svg)).
uk: Виберіть Узагальнення (![Піктограма для зв’язків узагальнення.](../gaphor/ui/icons/hicolor/scalable/actions/gaphor-generalization-symbolic.svg)).

source: Icon for generalization relationships.
fr: Icône pour la diffusion des relations.
ta: பொதுமைப்படுத்தல் உறவுகளுக்கான படவுரு.
uk: Піктограма для зв'язків узагальнення.

source: Move the mouse cursor over `Shape`. Click, hold and drag the line end over `Circle`. Release the mouse button, and you should have your relationship between `Shape` and `Circle`. You can see both ends of the relation are red, indicating they are connected to their class.
es: Mueva el cursor del ratón sobre `Forma`. Pulse, mantenga pulsado y arrastre el extremo de la línea sobre `Círculo`. Suelte el botón del ratón y tendrá la relación entre `Forma` y `Círculo`. Puede ver que ambos extremos de la relación están en rojo, indicando que están conectados a su clase.
fr: Déplacez le curseur de la souris sur `Shape`(Forme). Cliquez, maintenez et faites glisser l'extrémité de la ligne sur `Circle`(Cercle). Relâchez le bouton de la souris, et vous devriez avoir votre relation entre `Shape` et `Circle`. Vous pouvez voir que les deux extrémités de la relation sont rouges, ce qui indique qu'elles sont connectées à leur classe.
ta: மவுச் கர்சரை `வடிவம்` மீது நகர்த்தவும். சொடுக்கு செய்து, பிடி மற்றும் வரி முடிவை `வட்டம்` மீது இழுக்கவும். சுட்டி பொத்தானை விடுவிக்கவும், `வடிவம்` மற்றும்` வட்டம்` இடையே உங்கள் உறவை நீங்கள் கொண்டிருக்க வேண்டும். உறவின் இரு முனைகளும் சிவப்பு நிறத்தை நீங்கள் காணலாம், அவை அவற்றின் வகுப்போடு இணைக்கப்பட்டுள்ளன என்பதைக் குறிக்கிறது.
uk: Наведіть курсор миші на `Фігуру`. Клацніть, утримуючи, і перетягніть кінець лінії на `Circle`. Відпустіть кнопку миші, і ви отримаєте зв'язок між `Shape` та `Circle`. Ви можете бачити, що обидва кінці зв'язку червоні, що вказує на те, що вони з'єднані зі своїми класами.

source: ![The Gaphor main window showing two classes connected by a generalization relationship.](images/first-model-generalization.png)
fr: ![La fenêtre principale de Gaphor montre deux classes connectées par une relation de généralisation.](images/first-model-generalization.png)
ta: ![பொதுமைப்படுத்தல் உறவால் இணைக்கப்பட்ட இரண்டு வகுப்புகளைக் காட்டும் காஃபோர் முதன்மை சாளரம்.](images/first-model-generalization.png)
uk: ![Головне вікно Gaphor, що показує два класи, з’єднані узагальнюючим відношенням.](images/first-model-generalization.png)

source: The Gaphor main window showing two classes connected by a generalization relationship.
fr: La fenêtre principale de Gaphor montre deux classes connectées par une relation de généralisation.
ta: பொதுமைப்படுத்தல் உறவால் இணைக்கப்பட்ட இரண்டு வகுப்புகளைக் காட்டும் கஃபர் முதன்மையான சாளரம்.
uk: Головне вікно Gaphor, що показує два класи, з’єднані узагальнюючим відношенням.

source: Optionally you can run the auto-layout (![Menu icon](images/open-menu-symbolic.svg) → Tools → Auto Layout) to align the elements on the diagram.
fr: En option, vous pouvez lancer la mise en page automatique (![Menu icon](images/open-menu-symbolic.svg) → Tools (Outils) → Auto Layout(Mise en page automatique)) pour aligner les éléments sur le diagramme.
ta: விருப்பமாக நீங்கள் வரைபடத்தில் உள்ள உறுப்புகளை சீரமைக்க ஆட்டோ-லேஅவுட்டை (![மெனு ஐகான்](images/open-menu-symbolic.svg) → கருவிகள் → ஆட்டோ தளவமைப்பு) இயக்கலாம்.
uk: За бажанням ви можете запустити автоматичний макет (![Піктограма меню](images/open-menu-symbolic.svg) → Інструменти → Автоматичний макет), щоб вирівняти елементи на діаграмі.

source: Menu icon
fr: Icône de menu
ta: பட்டியல் படவுரு
uk: Значок меню

source: Creating New Diagrams
es: Crear diagramas nuevos
fr: Création de nouveaux diagrammes
ta: புதிய வரைபடங்களை உருவாக்குதல்
uk: Створення нових діаграм
