Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: Since Gaphor is written in Python, it also functions as a library.
es: Dado que Gaphor está escrito en Python, también funciona como una biblioteca.
fr: Comme Gaphor est écrit en Python, il fonctionne également comme une bibliothèque.
ta: கஃபர் பைத்தானில் எழுதப்பட்டிருப்பதால், இது ஒரு நூலகமாகவும் செயல்படுகிறது.
uk: Оскільки Gaphor написаний на Python, він також функціонує як бібліотека.

source: Getting started
es: Primeros pasos
fr: Pour commencer
ta: தொடங்குதல்
uk: Початок роботи

source: To get started, you’ll need a Python console. You can use the interactive console in Gaphor, use a Jupyter notebook, although that will require setting up a Python development environment.
es: Para empezar, necesitarás una consola Python. Puedes usar la consola interactiva en Gaphor, usar un Jupyter notebook, aunque eso requerirá configurar un entorno de desarrollo Python.
fr: Pour commencer, vous aurez besoin d'une console Python. Vous pouvez utiliser la console interactive de Gaphor ou un bloc-notes Jupyter, bien que cela nécessite la mise en place d'un environnement de développement Python.
ta: தொடங்குவதற்கு, உங்களுக்கு பைதான் கன்சோல் தேவை. நீங்கள் கஃபரில் ஊடாடும் கன்சோலைப் பயன்படுத்தலாம், சூபிட்டர் நோட்புக்கைப் பயன்படுத்தலாம், இருப்பினும் இது பைதான் மேம்பாட்டு சூழலை அமைக்க வேண்டும்.
uk: Для початку вам знадобиться консоль Python. Ви можете використовувати інтерактивну консоль у Gaphor, використовувати блокнот Jupyter, хоча для цього потрібно налаштувати середовище розробки Python.

source: Query a model
es: Consultar un modelo
fr: Interroger un modèle
ta: ஒரு மாதிரியை வினவவும்
uk: Запит моделі

source: The first step is to load a model. For this you’ll need an {obj}`gaphor.core.modeling.ElementFactory`. The `ElementFactory` is responsible to creating and maintaining the model. It acts as a repository for the model while you’re working on it.
fr: La première étape consiste à charger un modèle. Pour cela, vous aurez besoin d'un {obj}`gaphor.core.modeling.ElementFactory`. La `ElementFactory` est responsable de la création et de la maintenance du modèle. Elle agit comme un référentiel pour le modèle pendant que vous travaillez dessus.
ta: முதல் படி ஒரு மாதிரியை ஏற்றுவது. இதற்காக உங்களுக்கு {obj}`gaphor.core.modeling.ElementFactory` தேவை. மாதிரியை உருவாக்குவதற்கும் பராமரிப்பதற்கும் `ElementFactory` பொறுப்பு. நீங்கள் பணிபுரியும் போது இது மாதிரிக்கான களஞ்சியமாக செயல்படுகிறது.
uk: Першим кроком є завантаження моделі. Для цього вам знадобиться {obj}`gaphor.core.modeling.ElementFactory`. `ElementFactory` відповідає за створення та підтримку моделі. Вона діє як репозиторій для моделі, поки ви над нею працюєте.

source: The module `gaphor.storage` contains everything to load and save models. Gaphor supports multiple [modeling languages](modeling_language). The `ModelingLanguageService` consolidates those languages and makes it easy for the loader logic to find the appropriate classes.
es: El módulo `gaphor.storage` contiene todo lo necesario para cargar y guardar modelos. Gaphor soporta múltiples [modeling languages](modeling_language). El `ModelingLanguageService` consolida esos idiomas y hace que sea fácil para la lógica del cargador encontrar las clases apropiadas.
fr: Le module `gaphor.storage` contient tout ce qu'il faut pour charger et sauvegarder les modèles. Gaphor supporte plusieurs [langages de modélisation](modeling_language). Le `ModelingLanguageService` consolide ces langages et permet à la logique de chargement de trouver facilement les classes appropriées.
ta: `gaphor.storage` தொகுதி மாதிரிகளை ஏற்றவும் சேமிக்கவும் எல்லாவற்றையும் கொண்டுள்ளது. கஃபர் பல [மாடலிங் மொழிகள்](modeling_language) ஐ ஆதரிக்கிறது. `ModelingLanguageService` அந்த மொழிகளை ஒருங்கிணைத்து, ஏற்றி தர்க்கத்திற்கு பொருத்தமான வகுப்புகளைக் கண்டுபிடிப்பதை எளிதாக்குகிறது.
uk: Модуль `gaphor.storage` містить все необхідне для завантаження та збереження моделей. Gaphor підтримує декілька [мов моделювання](modeling_language). Служба `ModelingLanguageService` об'єднує ці мови і полегшує логіці завантажувача пошук відповідних класів.

source: In versions before 2.13, an `EventManager` is required. In later versions, the `ModelingLanguageService` can be initialized without event manager.
es: En versiones anteriores a la 2.13, se requiere un `EventManager`. En versiones posteriores, el `ModelingLanguageService` puede ser inicializado sin gestor de eventos.
fr: Dans les versions antérieures à 2.13, un `EventManager` est nécessaire. Dans les versions ultérieures, le `ModelingLanguageService` peut être initialisé sans gestionnaire d'événements.
ta: 2.13 க்கு முந்தைய பதிப்புகளில், ஒரு `நிகழ்வு மேலாளர்` தேவை. பிற்கால பதிப்புகளில், `மாடலிங் லாங்குவேச் சர்வீச்` நிகழ்வு மேலாளர் இல்லாமல் துவக்கப்படலாம்.
uk: У версіях до 2.13 потрібен `EventManager`. У пізніших версіях `ModelingLanguageService` можна ініціалізувати без менеджера подій.

source: At this point the model is loaded in the `element_factory` and can be queried.
es: En este punto el modelo se carga en la `element_factory` y puede ser consultado.
fr: A ce stade, le modèle est chargé dans la `element_factory` et peut être interrogé.
ta: இந்த கட்டத்தில் மாதிரி `உறுப்பு_பாக்டரி` இல் ஏற்றப்பட்டு வினவப்படலாம்.
uk: На цьому етапі модель завантажується в `element_factory` і її можна запитувати.

source: A modeling language consists of the model elements, and diagram items. Graphical components are loaded separately. For the most basic manupilations, GTK (the GUI toolkit we use) is not required, but you may run into situations where Gaphor tries to load the GTK library.
es: Un lenguaje de modelado se compone de los elementos del modelo y de los elementos del diagrama. Los componentes gráficos se cargan por separado. Para las manipulaciones más básicas, GTK (el conjunto de herramientas GUI que utilizamos) no es necesario, pero puede encontrarse con situaciones en las que Gaphor intente cargar la biblioteca GTK.
fr: Un langage de modélisation se compose d'éléments de modèle et d'éléments de diagramme. Les composants graphiques sont chargés séparément. Pour les manipulations les plus basiques, GTK (la boîte à outils GUI que nous utilisons) n'est pas nécessaire, mais il peut arriver que Gaphor tente de charger la bibliothèque GTK.
ta: ஒரு மாடலிங் மொழி மாதிரி கூறுகள் மற்றும் வரைபட உருப்படிகளைக் கொண்டுள்ளது. வரைகலை கூறுகள் தனித்தனியாக ஏற்றப்படுகின்றன. மிக அடிப்படையான மேனபிலேசன்களுக்கு, சி.டி.கே (நாங்கள் பயன்படுத்தும் சி.யு.ஐ கருவித்தொகுப்பு) தேவையில்லை, ஆனால் நீங்கள் சி.டி.கே நூலகத்தை ஏற்ற முயற்சிக்கும் சூழ்நிலைகளுக்கு நீங்கள் ஓடலாம்.
uk: Мова моделювання складається з елементів моделі та елементів діаграми. Графічні компоненти завантажуються окремо. Для найпростіших маніпуляцій GTK (інструментарій графічного інтерфейсу, який ми використовуємо) не потрібен, але ви можете зіткнутися з ситуаціями, коли Gaphor намагається завантажити бібліотеку GTK.

source: One trick to avoid this (when generating Sphinx docs at least) is to use autodoc’s mock function to mock out the GTK and GDK libraries. However, Pango needs to be installed for text rendering.
es: Un truco para evitar esto (al menos cuando se generan documentos Sphinx) es usar la función mock de autodoc para imitar las librerías GTK y GDK. Sin embargo, Pango necesita ser instalado para el renderizado de texto.
fr: Une astuce pour éviter cela (du moins lors de la génération de documents Sphinx) consiste à utiliser la fonction mock d'autodoc pour simuler les bibliothèques GTK et GDK. Cependant, Pango doit être installé pour le rendu du texte.
ta: இதைத் தவிர்ப்பதற்கான ஒரு தந்திரம் (குறைந்த பட்சம் சூரரிமாச்சிலை டாக்சை உருவாக்கும் போது) சி.டி.கே மற்றும் சி.டி.கே நூலகங்களை கேலி செய்ய ஆட்டோடோக்கின் போலி செயல்பாட்டைப் பயன்படுத்துவது. இருப்பினும், உரை ரெண்டரிங்கிற்கு பாங்கோ நிறுவப்பட வேண்டும்.
uk: Один трюк, щоб уникнути цього (принаймні, під час генерації документів Sphinx) полягає у використанні функції mock autodoc для імітації бібліотек GTK і GDK. Однак для відтворення тексту потрібно встановити Pango.

source: A simple query only tells you what elements are in the model. The method `ElementFactory.select()` returns an iterator. Sometimes it’s easier to obtain a list directly. For those cases you can use `ElementFatory.lselect()`. Here we select the last five elements:
es: Una consulta simple sólo te dice qué elementos hay en el modelo. El método `ElementFactory.select()` devuelve un iterador. A veces es más fácil obtener una lista directamente. Para esos casos puedes usar `ElementFatory.lselect()`. Aquí seleccionamos los últimos cinco elementos:
fr: Une requête simple vous indique seulement quels éléments se trouvent dans le modèle. La méthode `ElementFactory.select()` renvoie un itérateur. Il est parfois plus facile d'obtenir une liste directement. Dans ce cas, vous pouvez utiliser la méthode `ElementFatory.lselect()`. Ici, nous sélectionnons les cinq derniers éléments :
ta: ஒரு எளிய வினவல் மாதிரியில் என்ன கூறுகள் உள்ளன என்பதை மட்டுமே உங்களுக்குக் கூறுகிறது. `Elielagefactory.select ()` ஒரு மறுசீரமைப்பாளரைத் தருகிறது. சில நேரங்களில் ஒரு பட்டியலை நேரடியாகப் பெறுவது எளிது. அந்த நிகழ்வுகளுக்கு நீங்கள் `ElementFatory.lselect ()` ஐப் பயன்படுத்தலாம். இங்கே கடைசி ஐந்து கூறுகளைத் தேர்ந்தெடுக்கிறோம்:
uk: Простий запит лише показує, які елементи є в моделі. Метод `ElementFactory.select()` повертає ітератор. Іноді простіше отримати список безпосередньо. Для таких випадків ви можете використовувати `ElementFatory.lselect()`. Тут ми вибираємо останні п'ять елементів:

source: Elements can also be queried by type and with a predicate function:
es: Los elementos también pueden consultarse por tipo y con una función de predicado:
fr: Les éléments peuvent également être interrogés par type et à l'aide d'une fonction de prédiction :
ta: கூறுகளை வகை மற்றும் முன்கணிப்பு செயல்பாட்டுடன் வினவலாம்:
uk: Елементи також можна запитувати за типом і за допомогою функції предикату:

source: Now, let’s say we want to do some simple (pseudo-)code generation. We can iterate class attributes and write some output.
es: Ahora, digamos que queremos hacer una generación simple de (pseudo) código. Podemos iterar atributos de clase y escribir algunos resultados.
fr: Supposons maintenant que nous souhaitions générer du (pseudo-)code simple. Nous pouvons itérer les attributs de la classe et écrire une sortie.
ta: இப்போது, சில எளிய (போலி-) குறியீடு உருவாக்கம் செய்ய விரும்புகிறோம் என்று சொல்லலாம். நாம் வர்க்க பண்புகளை மீண்டும் உருவாக்கலாம் மற்றும் சில வெளியீட்டை எழுதலாம்.
uk: Тепер, скажімо, ми хочемо створити просту (псевдо)код. Ми можемо перебирати атрибути класу та писати деякі результати.

source: To find out which relations can be queried, have a look at the [modeling language](modeling_language) documentation. Gaphor’s data models have been built using the [UML](models/uml) language.
es: Para saber qué relaciones se pueden consultar, eche un vistazo a la documentación de [modeling language](modeling_language). Los modelos de datos de Gaphor se han construido utilizando el lenguaje [UML](models/uml).
fr: Pour savoir quelles relations peuvent être interrogées, consultez la documentation du [langage de modélisation](modeling_language). Les modèles de données de Gaphor ont été construits en utilisant le langage [UML](models/uml).
ta: எந்த உறவுகளை வினவ முடியும் என்பதை அறிய, [மாடலிங் மொழி](modeling_language) ஆவணங்களைப் பாருங்கள். [யுஎம்எல்](models/uml) மொழியைப் பயன்படுத்தி கஃபரின் தரவு மாதிரிகள் கட்டப்பட்டுள்ளன.
uk: Щоб дізнатися, які відносини можна запитувати, перегляньте документацію [modeling language](modeling_language). Моделі даних Gaphor були створені за допомогою мови [UML](models/uml).

source: You can find out more about a model property by printing it.
es: Puede obtener más información sobre una propiedad de modelo imprimiéndola.
fr: Vous pouvez en savoir plus sur une propriété de modèle en l'imprimant.
ta: ஒரு மாதிரி சொத்தை அச்சிடுவதன் மூலம் அதை மேலும் அறியலாம்.
uk: Ви можете дізнатися більше про властивість моделі, роздрукувавши її.

source: In this case it tells us that the type of `UML.Class.ownedAttribute` is `UML.Property`. `UML.Property.class_` is set to the owner class when `ownedAttribute` is set. It is a bidirectional relation.
es: En este caso nos dice que el tipo de `UML.Class.ownedAttribute` es `UML.Property`. El atributo `UML.Property.class_` se establece en la clase propietaria cuando se establece `ownedAttribute`. Se trata de una relación bidireccional.
fr: Dans ce cas, cela nous indique que le type de `UML.Class.ownedAttribute` est `UML.Property`. `UML.Property.class_` est défini à la classe propriétaire lorsque `ownedAttribute` est défini. Il s'agit d'une relation bidirectionnelle.
ta: இந்த விசயத்தில் `uml.class.ownedattribute` வகை` uml.property` என்று அது நமக்கு சொல்கிறது. `சொந்தமாக சொந்தமானவர்` அமைக்கப்படும்போது` uml.property.class_` உரிமையாளர் வகுப்பிற்கு அமைக்கப்பட்டுள்ளது. இது ஒரு இருதரப்பு உறவு.
uk: У цьому випадку це повідомляє нам, що тип `UML.Class.ownedAttribute` є `UML.Property`. `UML.Property.class_` встановлюється як клас власника, коли встановлено `ownedAttribute`. Це двонаправлене відношення.

source: Draw a diagram
es: Dibujar un diagrama
fr: Dessiner un diagramme
ta: ஒரு வரைபடத்தை வரையவும்
uk: Намалюйте схему

source: Another nice feature is drawing the diagrams. At this moment this requires a function. This behavior is similar to the [`diagram` directive](sphinx).
es: Otra buena función es la de dibujar diagramas. En este momento esto requiere una función. Este comportamiento es similar a la [`diagram` directive](sphinx).
fr: Une autre fonction intéressante consiste à dessiner les diagrammes. Pour l'instant, cela nécessite une fonction. Ce comportement est similaire à [`diagram` directive](sphinx).
ta: மற்றொரு நல்ல நற்பொருத்தம் வரைபடங்களை வரைவது. இந்த நேரத்தில் இதற்கு ஒரு செயல்பாடு தேவை. இந்த நடத்தை [`வரைபடம்` டைரெக்டிவ்](sphinx) க்கு ஒத்ததாகும்.
uk: Ще одна приємна функція - малювання схем. На даний момент для цього потрібна функція. Ця поведінка схожа на директиву [`diagram`] (sphinx).

source: Create a diagram
es: Crear un diagrama
fr: Créer un diagramme
ta: ஒரு வரைபடத்தை உருவாக்கவும்
uk: Створіть діаграму

source: (Requires Gaphor 2.13)
es: (Requiere Gaphor 2.13)
fr: (Nécessite Gaphor 2.13)
ta: (காஃபர் 2.13 தேவை)
uk: (Потрібен Gaphor 2.13)

source: Now let's make something a little more fancy. We still have the core model loaded in the element factory. From this model we can create a custom diagram. With a little help of the auto-layout service, we can make it a readable diagram.
es: Ahora vamos a hacer algo un poco más elegante. Todavía tenemos el modelo central cargado en la fábrica de elementos. A partir de este modelo podemos crear un diagrama personalizado. Con un poco de ayuda del servicio de auto-diseño, podemos hacer que sea un diagrama legible.
fr: Faisons maintenant quelque chose d'un peu plus fantaisiste. Nous avons toujours le modèle de base chargé dans la fabrique d'éléments. A partir de ce modèle, nous pouvons créer un diagramme personnalisé. Avec un peu d'aide du service de mise en page automatique, nous pouvons en faire un diagramme lisible.
ta: இப்போது இன்னும் கொஞ்சம் ஆடம்பரமான ஒன்றை உருவாக்குவோம். உறுப்பு தொழிற்சாலையில் இன்னும் முக்கிய மாதிரி ஏற்றப்பட்டுள்ளது. இந்த மாதிரியிலிருந்து தனிப்பயன் வரைபடத்தை உருவாக்கலாம். ஆட்டோ லேஅவுட் சேவையின் சிறிய உதவியுடன், அதை படிக்கக்கூடிய வரைபடமாக மாற்றலாம்.
uk: Тепер давайте зробимо дещо більш вигадливе. У нас все ще є основна модель, завантажена у фабриці елементів. З цієї моделі ми можемо створити кастомну схему. З невеликою допомогою сервісу авторозмітки ми можемо зробити її читабельною схемою.

source: To create the diagram, we [`drop` elements](modeling_language:dropping) on the diagram. Items on a diagram represent an element in the model. We'll also drop all associations on the model. Only if both ends can connect, the association will be added.
es: Para crear el diagrama, [`drop` elements](modeling_language:dropping) en el diagrama. Los elementos en un diagrama representan un elemento en el modelo. También arrastraremos todas las asociaciones en el modelo. Solo si ambos extremos se pueden conectar, la asociación será añadida.
fr: Pour créer le diagramme, nous déposons [`drop` elements](modeling_language:dropping) sur le diagramme. Les éléments d'un diagramme représentent un élément du modèle. Nous allons également déposer toutes les associations sur le modèle. L'association ne sera ajoutée que si les deux extrémités peuvent se connecter.
ta: வரைபடத்தை உருவாக்க, வரைபடத்தில் [`டிராப்` கூறுகளை](modeling_language:dropping) கைவிடுதல்). ஒரு வரைபடத்தில் உள்ள உருப்படிகள் மாதிரியில் உள்ள ஒரு உறுப்பைக் குறிக்கின்றன. எல்லா சங்கங்களையும் மாதிரியில் கைவிடுவோம். இரு முனைகளும் இணைக்க முடிந்தால் மட்டுமே, சங்கம் சேர்க்கப்படும்.
uk: Щоб створити діаграму, ми [`кидаємо` елементи](мова_моделювання:кидання) на діаграму. Елементи на діаграмі представляють елемент у моделі. Ми також відкинемо всі асоціації на моделі. Тільки якщо обидва кінці можуть з'єднуватися, асоціація буде додана.

source: The diagram is not perfect, but you get the picture.
es: El diagrama no es perfecto, pero te haces una idea.
fr: Le schéma n'est pas parfait, mais vous avez compris.
ta: வரைபடம் சரியானதல்ல, ஆனால் நீங்கள் படத்தைப் பெறுவீர்கள்.
uk: Діаграма не ідеальна, але ви отримуєте картину.

source: Update a model
es: Actualizar un modelo
fr: Mise à jour d'un modèle
ta: ஒரு மாதிரியைப் புதுப்பிக்கவும்
uk: Оновіть модель

source: Updating a model always starts with the element factory: that’s where elements are created.
es: La actualización de un modelo siempre empieza por la fábrica de elementos: es ahí donde se crean los elementos.
fr: La mise à jour d'un modèle commence toujours par la fabrique d'éléments (element factory) : c'est là que les éléments sont créés.
ta: ஒரு மாதிரியைப் புதுப்பிப்பது எப்போதும் உறுப்பு தொழிற்சாலையுடன் தொடங்குகிறது: அங்குதான் கூறுகள் உருவாக்கப்படுகின்றன.
uk: Оновлення моделі завжди починається з фабрики елементів: саме там створюються елементи.

source: To create a UML Class instance, you can:
es: Para crear una instancia de clase UML, puede:
fr: Pour créer une instance de classe UML, vous pouvez :
ta: யுஎம்எல் வகுப்பு நிகழ்வை உருவாக்க, உங்களால் முடியும்:
uk: Щоб створити екземпляр класу UML, ви можете:

source: To give it an attribute, create an attribute type (`UML.Property`) and then assign the attribute values.
es: Para darle un atributo, cree un tipo de atributo ('UML. Property') y, a continuación, asigne los valores de atributo.
fr: Pour lui donner un attribut, créez un type d'attribut (`UML.Property`) et attribuez-lui des valeurs.
ta: அதற்கு ஒரு பண்புக்கூறு கொடுக்க, ஒரு பண்புக்கூறு வகையை (`uml.property`) உருவாக்கி பின்னர் பண்புக்கூறு மதிப்புகளை ஒதுக்கவும்.
uk: Щоб надати йому атрибут, створіть тип атрибута (`UML.Property`), а потім призначте значення атрибута.

source: Adding it to the diagram looks like this:
es: Añadiéndolo al diagrama queda así:
fr: En l'ajoutant au diagramme, on obtient le résultat suivant :
ta: வரைபடத்தில் இதைச் சேர்ப்பது இது போல் தெரிகிறது:
uk: Додавання його до діаграми виглядає так:

source: If you save the model, your changes are persisted:
es: Si guarda el modelo, los cambios se mantienen:
fr: Si vous enregistrez le modèle, vos modifications sont conservées :
ta: நீங்கள் மாதிரியைச் சேமித்தால், உங்கள் மாற்றங்கள் தொடர்ந்து உள்ளன:
uk: Якщо ви збережете модель, ваші зміни збережуться:

source: Updating elements
fr: Mise à jour des éléments
ta: கூறுகளைப் புதுப்பித்தல்
uk: Оновлення елементів

source: If you need to update existing elements, this can be done by keeping track of the element ID. Each element in the model has a unique internal id. Once again we need some imports from Gaphor:
fr: Si vous devez mettre à jour des éléments existants, vous pouvez le faire en gardant une trace de l'identifiant de l'élément. Chaque élément du modèle possède un identifiant interne unique. Une fois de plus, nous avons besoin d'importations de Gaphor :
ta: ஏற்கனவே உள்ள கூறுகளை நீங்கள் புதுப்பிக்க வேண்டும் என்றால், உறுப்பு ஐடியைக் கண்காணிப்பதன் மூலம் இதைச் செய்யலாம். மாதிரியில் உள்ள ஒவ்வொரு உறுப்புக்கும் ஒரு தனித்துவமான உள் ஐடி உள்ளது. மீண்டும் எங்களுக்கு கஃபரிடமிருந்து சில இறக்குமதிகள் தேவை:
uk: Якщо вам потрібно оновити існуючі елементи, це можна зробити, відстежуючи ідентифікатор елемента. Кожен елемент у моделі має унікальний внутрішній ідентифікатор. Знову нам потрібні імпортовані дані з Gaphor:

source: Then start up the services we will use:
fr: Ensuite, nous lancerons les services que nous utiliserons :
ta: நாங்கள் பயன்படுத்தும் சேவைகளைத் தொடங்கவும்:
uk: Потім запустіть сервіси, якими ми будемо користуватися:

source: and load in the model to the session
fr: et charger le modèle dans la session
ta: மற்றும் அமர்வுக்கு மாதிரியில் ஏற்றவும்
uk: і завантажте модель до сеансу

source: Importantly, the changes are made as part of a `Transaction`. Here we find the element with the same id, and then update the content. We then save the altered model to a file.
fr: Il est important de noter que les changements sont effectués dans le cadre d'une `Transaction`. Ici, nous trouvons l'élément avec le même identifiant, puis nous mettons à jour le contenu. Nous sauvegardons ensuite le modèle modifié dans un fichier.
ta: முக்கியமாக, மாற்றங்கள் `பரிவர்த்தனை` இன் ஒரு பகுதியாக செய்யப்படுகின்றன. இங்கே நாம் அதே ஐடியுடன் உறுப்பைக் கண்டுபிடித்து, பின்னர் உள்ளடக்கத்தைப் புதுப்பிக்கவும். மாற்றப்பட்ட மாதிரியை ஒரு கோப்பில் சேமிக்கிறோம்.
uk: Важливо, що зміни вносяться як частина «Транзакції». Тут ми знаходимо елемент із тим самим id, а потім оновлюємо вміст. Потім ми зберігаємо змінену модель у файл.

source: What else
es: Qué más
fr: Quoi d'autre
ta: வேறு என்ன
uk: Що ще

source: What else is there to know…
es: Qué más hay que saber…
fr: Qu'y a-t-il d'autre à savoir …
ta: தெரிந்து கொள்ள வேறு என்ன இருக்கிறது…
uk: Що ще потрібно знати…

source: Gaphor supports derived associations. For example, `element.owner` points to the owner element. For an attribute that would be its containing class.
es: Gaphor admite asociaciones derivadas. Por ejemplo, `element.owner` apunta al elemento propietario. Para un atributo que sería su clase contenedora.
fr: Gaphor supporte les associations dérivées. Par exemple, `element.owner` pointe vers l'élément propriétaire. Pour un attribut, il s'agirait de la classe qui le contient.
ta: பெறப்பட்ட சங்கங்களை கஃபர் ஆதரிக்கிறது. எடுத்துக்காட்டாக, `உறுப்பு. உரிமையாளர் உறுப்பை சுட்டிக்காட்டுகிறது. ஒரு பண்புக்கூறுக்கு அது கொண்டிருக்கும் வகுப்பாக இருக்கும்.
uk: Gaphor підтримує похідні асоціації. Наприклад, `element.owner` вказує на елемент owner. Для атрибута, який буде його класом, що містить.

source: The module `gaphor.UML.recipes` contains several functions for manipulating elements and their associations.
fr: Le module `gaphor.UML.recipes` contient plusieurs fonctions pour manipuler les éléments et leurs associations.
ta: `Gaphor.uml.recipes` தொகுதி கூறுகள் மற்றும் அவற்றின் சங்கங்களை கையாள பல செயல்பாடுகளைக் கொண்டுள்ளது.
uk: Модуль `gaphor.UML.recipes` містить кілька функцій для маніпулювання елементами та їхніми асоціаціями.

source: The tests for a given modelling language are a good place to find reference examples of element creation and modification.
fr: Les tests d'un langage de modélisation donné sont un bon moyen de trouver des exemples de référence pour la création et la modification d'éléments.
ta: கொடுக்கப்பட்ட மாடலிங் மொழிக்கான சோதனைகள் உறுப்பு உருவாக்கம் மற்றும் மாற்றத்தின் குறிப்பு எடுத்துக்காட்டுகளைக் கண்டறிய ஒரு நல்ல இடமாகும்.
uk: Тести для даної мови моделювання є хорошим місцем для пошуку довідкових прикладів створення та модифікації елементів.
