Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: General Concepts Library/Dysfunctional Event
es: Biblioteca de conceptos generales/Evento disfuncional
fr: Bibliothèque des Concepts Généraux/Événement dysfonctionnel
ta: பொதுவான கருத்துக்கள் நூலகம்/செயலற்ற நிகழ்வு
uk: Бібліотека загальних понять/Дисфункціональна подія

source: General Concepts Library/Effect
es: Biblioteca de conceptos generales/Efecto
fr: Bibliothèque des Concepts Généraux/Éffet
ta: பொதுவான கருத்துக்கள் நூலகம்/விளைவு
uk: Бібліотека загальних понять/Ефект

source: General Concepts Library/Error Propagation
es: Biblioteca de conceptos generales/propagación de errores
fr: Bibliothèque des Concepts Généraux/Propagation des Érreurs
ta: பொதுவான கருத்துக்கள் நூலகம்/பிழை பரப்புதல்
uk: Бібліотека загальних понять/розповсюдження помилок

source: General Concepts Library/Error Realization
es: Biblioteca de conceptos generales/Realización de errores
fr: Bibliothèque des Concepts Généraux/Réalisation de l'Érreur
ta: பொதுவான கருத்துக்கள் நூலகம்/பிழை உணர்தல்
uk: Бібліотека загальних понять/Реалізація помилок

source: General Concepts Library/Harm Potential
es: Biblioteca de conceptos generales/Potencial de daño
fr: Bibliothèque des Concepts Généraux/Potentiel de Nuisance
ta: பொதுவான கருத்துக்கள் நூலகம்/தீங்கு திறன்
uk: Бібліотека загальних понять/Потенціал шкоди

source: General Concepts Library/Hazard
es: Biblioteca de conceptos generales/Peligros
fr: Bibliothèque des Concepts Généraux/Risques
ta: பொது கருத்துக்கள் நூலகம்/ஆபத்து
uk: Бібліотека загальних понять/Hazard

source: General Concepts Library/Scenario
es: Biblioteca de conceptos generales/escenario
fr: Bibliothèque des Concepts Généraux/Risques
ta: பொதுவான கருத்துக்கள் நூலகம்/காட்சி
uk: Бібліотека загальних понять/Сценарій

source: General Concepts Library/Undesired State
es: Biblioteca de conceptos generales/Estado no deseado
fr: Bibliothèque des Concepts Généraux/État Non Désiré
ta: பொது கருத்துக்கள் நூலகம்/விரும்பத்தகாத நிலை
uk: Бібліотека загальних понять/Небажаний стан

source: General Concepts Profile/Detection
es: Perfil de Conceptos Generales/Detección
fr: Bibliothèque des Concepts Généraux/Détection
ta: பொதுவான கருத்துக்கள் சுயவிவரம்/கண்டறிதல்
uk: Загальні поняття Профіль/Виявлення

source: General Concepts Profile/Failure State
es: Perfil de Conceptos Generales/Estado de fallo
fr: Profile des Concepts Généraux/État de défaillance
ta: பொதுவான கருத்துக்கள் சுயவிவரம்/தோல்வி நிலை
uk: Загальні поняття Профіль/Стан відмови

source: General Concepts Profile/Mitigation
es: Perfil de Conceptos Generales/Mitigación
fr: Profile des Concepts Généraux/Atténuation
ta: பொதுவான கருத்துக்கள் சுயவிவரம்/தணிப்பு
uk: Профіль загальних понять/пом’якшення

source: General Concepts Profile/Prevention
es: Perfil de Conceptos Generales/Prevención
fr: Profile des Concepts Généraux/Prévention
ta: பொதுவான கருத்துக்கள் சுயவிவரம்/தடுப்பு
uk: Загальні поняття Профіль/Профілактика

source: General Concepts Profile/Recommendation
es: Perfil de Conceptos Generales/Recomendación
fr: Profile des Concepts Généraux/Recommendation
ta: பொதுவான கருத்துக்கள் சுயவிவரம்/பரிந்துரை
uk: Загальні поняття Профіль/Рекомендація

source: General Concepts Profile/Undeveloped
es: Perfil de Conceptos Generales/Sin Desarrollar
fr: Profile des Concepts Généraux/Non développé
ta: பொதுவான கருத்துக்கள் சுயவிவரம்/வளர்ச்சியடையாதவை
uk: Профіль загальних понять/нерозвинений

source: Methods
es: Métodos
fr: Méthodes
ta: முறைகள்
uk: Методи

source: FTA/FTA Library/Events/Basic Event
es: FTA/FTA Biblioteca/Eventos/Eventos básicos
fr: FTA/Bibliothèque FTA/Événements/Événement de Base
ta: FTA/FTA நூலகம்/நிகழ்வுகள்/அடிப்படை நிகழ்வு
uk: FTA/FTA Бібліотека/Події/Основна подія

source: FTA/FTA Library/Events/Conditional Event
es: FTA/FTA Biblioteca/Eventos/Eventos condicionales
fr: FTA/Bibliothèque FTA/Événements/Événement conditionnel
ta: FTA/FTA நூலகம்/நிகழ்வுகள்/நிபந்தனை நிகழ்வு
uk: FTA/FTA Бібліотека/Події/Умовна подія

source: FTA/FTA Library/Events/Dormant Event
es: FTA/FTA Biblioteca/Eventos/Evento inactivo
fr: FTA/FTA Bibliothèque/Événements/Événement inactif
ta: FTA/FTA நூலகம்/நிகழ்வுகள்/செயலற்ற நிகழ்வு
uk: FTA/FTA Бібліотека/Події/Неактивна подія

source: FTA/FTA Library/Events/Events
es: FTA/FTA Biblioteca/Eventos/Eventos
fr: FTA/FTA Bibliothèque/Événements/Événements
ta: FTA/FTA நூலகம்/நிகழ்வுகள்/நிகழ்வுகள்
uk: FTA/FTA Бібліотека/Події/Події

source: FTA/FTA Library/Events/Event
es: FTA/FTA Biblioteca/Eventos/Evento
fr: FTA/FTA Bibliothèque/Événements/Événement
ta: FTA/FTA நூலகம்/நிகழ்வுகள்/நிகழ்வு
uk: FTA/FTA Бібліотека/Події/Подія

source: FTA/FTA Library/Events/House Event
es: FTA/Biblioteca FTA/Eventos/Evento de la casa
fr: FTA/FTA Bibliothèque/Événements/Événement spécifique
ta: FTA/FTA நூலகம்/நிகழ்வுகள்/வீட்டு நிகழ்வு
uk: FTA/FTA Бібліотека/Події/Домашня подія

source: FTA/FTA Library/Events/Intermediate Event
es: FTA/Biblioteca FTA/Eventos/Evento intermedio
fr: FTA/FTA Bibliothèque/Événements/Événement intermédiaire
ta: FTA/FTA நூலகம்/நிகழ்வுகள்/இடைநிலை நிகழ்வு
uk: FTA/FTA Бібліотека/Події/Проміжна подія

source: FTA/FTA Library/Events/Top Event
es: FTA/Biblioteca FTA/Eventos/Evento principal
fr: FTA/FTA Bibliothèque/Événements/Événement majeur
ta: FTA/FTA நூலகம்/நிகழ்வுகள்/சிறந்த நிகழ்வு
uk: FTA/FTA Бібліотека/Події/Головна подія

source: FTA/FTA Library/Events/Undeveloped Event
es: FTA/Biblioteca FTA/Eventos/Evento sin desarrollar
fr: FTA/FTA Bibliothèque/Événements/Événement non développé
ta: FTA/FTA நூலகம்/நிகழ்வுகள்/வளர்ச்சியடையாத நிகழ்வு
uk: FTA/FTA Бібліотека/Події/Нерозроблена подія

source: FTA/FTA Library/Events/Zero Event
es: FTA/Biblioteca FTA/Eventos/Evento cero
fr: FTA/FTA Bibliothèque/Événements/Événement zéro
ta: FTA/FTA நூலகம்/நிகழ்வுகள்/பூச்சிய நிகழ்வு
uk: FTA/FTA Бібліотека/Події/Нульова подія

source: FTA/FTA Library/FTA Element
es: FTA/Biblioteca FTA/Elemento FTA
fr: FTA/FTA Bibliothèque/Élément FTA
ta: FTA/FTA நூலகம்/FTA உறுப்பு
uk: FTA/FTA Бібліотека/Елемент FTA

source: FTA/FTA Library/FTA Library
es: FTA/Biblioteca FTA/Biblioteca FTA
fr: FTA/Bibliothèque FTA/Bibliothèque FTA
ta: FTA/FTA நூலகம்/FTA நூலகம்
uk: FTA/FTA Бібліотека/ЗВТ бібліотека

source: FTA/FTA Library/FTA Tree
es: FTA/Biblioteca FTA/Árbol FTA
fr: FTA/Bibliothèque FTA/Arbre FTA
ta: FTA/FTA நூலகம்/FTA மரம்
uk: FTA/FTA Дерево бібліотеки/FTA

source: FTA/FTA Library/Gates/AND
es: FTA/Biblioteca FTA/Puertas/Y
fr: FTA/Bibliothèque FTA/Portes/AND
ta: FTA/FTA நூலகம்/வாயில்கள்/மற்றும்
uk: FTA/FTA Бібліотека/Ворота/І

source: FTA/FTA Library/Gates/Gate
es: FTA/Biblioteca FTA/Puertas/Puerta
fr: FTA/Bibliothèque FTA/Portes/Porte
ta: FTA/FTA நூலகம்/வாயில்கள்/வாயில்
uk: FTA/FTA Бібліотека/Ворота/Вороті

source: FTA/FTA Library/Gates/INHIBIT
es: FTA/Biblioteca FTA/Puertas/INHIBIR
fr: FTA/Bibliothèque FTA/Portes/INHIBITION
ta: FTA/FTA நூலகம்/வாயில்கள்/தடுப்பு
uk: FTA/FTA Бібліотека/Ворота/INHIBIT

source: FTA/FTA Library/Gates/MAJORITY_VOTE
es: FTA/Biblioteca FTA/Puertas/MAJORITY_VOTE
fr: FTA/Bibliothèque FTA/Portes/VOTE_MAJORITAIRE
ta: FTA/FTA நூலகம்/வாயில்கள்/பெரும்பான்மை_வோட்
uk: FTA/FTA Бібліотека/Ворота/БІЛЬШІСТЬ_ГОЛОСІВ

source: FTA/FTA Library/Gates/NOT
es: FTA/Biblioteca FTA/Puertas/NOT
fr: FTA/Bibliothèque FTA/Portes/NON
ta: FTA/FTA நூலகம்/வாயில்கள்/இல்லை
uk: FTA/FTA Бібліотека/Ворота/НІ

source: FTA/FTA Library/Gates/OR
es: FTA/Biblioteca FTA/Puertas/OR
fr: FTA/Bibliothèque FTA/Portes/OU
ta: FTA/FTA நூலகம்/வாயில்கள்/அல்லது
uk: FTA/FTA Бібліотека/Ворота/OR

source: FTA/FTA Library/Gates/SEQ
es: FTA/Biblioteca FTA/Puertas/SEQ
fr: FTA/Bibliothèque FTA/Portes/SEQ
ta: FTA/FTA நூலகம்/வாயில்கள்/SEQ
uk: FTA/FTA Бібліотека/Gates/SEQ

source: FTA/FTA Library/Gates/XOR
es: FTA/Biblioteca FTA/Puertas/XOR
fr: FTA/Bibliothèque FTA/Portes/OU EXCLUSIF
ta: FTA/FTA நூலகம்/வாயில்கள்/XOR
uk: FTA/FTA Бібліотека/Ворота/XOR

source: FTA/FTA Profile/AND
es: FTA/Perfil FTA/AND
fr: FTA/Profile FTA/ET
ta: FTA/FTA சுயவிவரம்/மற்றும்
uk: FTA/FTA Профіль/І

source: FTA/FTA Profile/Conditional Event
es: FTA/Perfil FTA/Evento condicional
fr: FTA/Profile FTA/Événement conditionnel
ta: FTA/FTA சுயவிவரம்/நிபந்தனை நிகழ்வு
uk: FTA/FTA Профіль/умовна подія

source: FTA/FTA Profile/Dormant Event
es: FTA/Perfil FTA/Evento inactivo
fr: FTA/Profile FTA/Événement inactif
ta: FTA/FTA சுயவிவரம்/செயலற்ற நிகழ்வு
uk: FTA/FTA Профіль/спляча подія

source: FTA/FTA Profile/Event
es: FTA/Perfil FTA/Evento
fr: FTA/Profile FTA/Événement
ta: FTA/FTA சுயவிவரம்/நிகழ்வு
uk: FTA/FTA Профіль/подія

source: FTA/FTA Profile/Gate
es: FTA/Perfil FTA/Puerta
fr: FTA/Profile FTA/Porte
ta: FTA/FTA சுயவிவரம்/வாயில்
uk: FTA/FTA Профіль/Ворота

source: FTA/FTA Profile/House Event
es: FTA/Perfil de FTA/Evento de la casa
fr: FTA/Profile FTA/Événement spécifique
ta: FTA/FTA சுயவிவரம்/வீட்டு நிகழ்வு
uk: FTA/FTA Профіль/домашня подія

source: FTA/FTA Profile/INHIBIT
es: FTA/Perfil FTA/INHIBIT
fr: FTA/Profile FTA/INHIBITION
ta: FTA/FTA சுயவிவரம்/தடுப்பு
uk: FTA/FTA Профіль/ІНГІБ

source: FTA/FTA Profile/Intermediate Event
es: FTA/Perfil FTA/Evento intermedio
fr: FTA/Profile FTA/Événement intermédiaire
ta: FTA/FTA சுயவிவரம்/இடைநிலை நிகழ்வு
uk: FTA/FTA Профіль/проміжна подія

source: FTA/FTA Profile/MAJORITY_VOTE
es: FTA/Perfil de FTA/MAJORITY_VOTE
fr: FTA/Profile FTA/VOTE_MAJORITAIRE
ta: FTA/FTA சுயவிவரம்/பெரும்பான்மை_வோட்
uk: FTA/FTA Профіль / MAJORITY_VOTE

source: FTA/FTA Profile/NOT
es: FTA/Perfil FTA/NOT
fr: FTA/Profile FTA/NON
ta: FTA/FTA சுயவிவரம்/இல்லை
uk: FTA/FTA Профіль/НІ

source: FTA/FTA Profile/OR
es: FTA/Perfil FTA/OR
fr: FTA/Profile FTA/OU
ta: FTA/FTA சுயவிவரம்/அல்லது
uk: FTA/FTA Профіль/АБО

source: FTA/FTA Profile/SEQ
es: FTA/Perfil FTA/SEQ
fr: FTA/Profile FTA/SEQ
ta: FTA/FTA சுயவிவரம்/SEQ
uk: FTA/FTA Профіль/SEQ

source: FTA/FTA Profile/Top Event
es: FTA/Perfil de FTA/Evento Principal
fr: FTA/Profile FTA/Événement Majeur
ta: FTA/FTA சுயவிவரம்/சிறந்த நிகழ்வு
uk: FTA/FTA Профіль/Головна подія

source: FTA/FTA Profile/Transfer In
es: FTA/Perfil FTA/Transferencia entrante
fr: FTA/Profil FTA/Transfert In
ta: FTA/FTA சுயவிவரம்/பரிமாற்றம்
uk: FTA/FTA Профіль/Перенести в

source: FTA/FTA Profile/Transfer Out
es: FTA/Perfil FTA/Transferencia de salida
fr: FTA/Profil FTA/Transfert Out
ta: FTA/FTA தன்வயவிவரம்/பரிமாற்றம்
uk: FTA/FTA Профіль/Передача

source: FTA/FTA Profile/Tree
es: FTA/Perfil FTA/Árbol
fr: FTA/Profil FTA/Arbre
ta: FTA/FTA சுயவிவரம்/மரம்
uk: FTA/FTA Профіль/Дерево

source: FTA/FTA Profile/XOR
es: FTA/Perfil FTA/XOR
fr: FTA/Profile FTA/OU EXCLUSIF
ta: FTA/FTA சுயவிவரம்/XOR
uk: FTA/FTA Профіль/XOR

source: FTA/FTA Profile/Zero Event
es: FTA/Perfil FTA/Evento cero
fr: FTA/Profile FTA/Événement Zéro
ta: FTA/FTA சுயவிவரம்/பூச்சிய நிகழ்வு
uk: FTA/FTA Профіль/нульова подія

source: Systems Modeling Language
es: Lenguaje de modelado de sistemas
fr: Langage de Modélisation des Systèmes
ta: அமைப்புகள் மாடலிங் மொழி
uk: Мова моделювання систем

source: Gaphor implements part of the [SysML 1.6](https://www.omg.org/spec/SysML) specification.
es: Gaphor implementa parte de la especificación [SysML 1.6](https://www.omg.org/spec/SysML).
fr: Gaphor met en œuvre une partie de la spécification [SysML 1.6](https://www.omg.org/spec/SysML).
ta: [SysML 1.6](https://www.omg.org/spec/SysML) விவரக்குறிப்பின் ஒரு பகுதியை கஃபர் செயல்படுத்துகிறது.
uk: Gaphor реалізує частину специфікації [SysML 1.6](https://www.omg.org/spec/SysML).

source: Activities
es: Actividades
fr: Activités
ta: நடவடிக்கைகள்
uk: Діяльністі

source: Allocations
es: Asignaciones
ta: ஒதுக்கீடுகள்
uk: Виділення

source: AllocatedActivityPartition
fr: RépartitionActivitésAllouées
ta: ஒதுக்கப்பட்ட செயல்பாட்டு பகிர்வு

source: Allocation
es: Asignación
ta: ஒதுக்கீடு
uk: Виділення

source: Blocks
es: Bloques
fr: Blocs
ta: தொகுதிகள்
uk: Блоки

source: Adjunt and Classifier Behavior Properties
es: Propiedades de comportamiento de adjetivos y clasificadores
fr: Adjoindre et classifier propriétés du comportement
ta: துணை மற்றும் வகைப்படுத்தி நடத்தை பண்புகள்
uk: Властивості поведінки ад’юнтів і класифікаторів

source: Bound References
es: Referencias vinculantes
fr: Références liées
ta: கட்டுப்பட்ட குறிப்புகள்
uk: Переплетені посилання

source: Connector Ends
es: Extremos del conector
fr: Extrémités du connecteur
ta: இணைப்பு முடிவடைகிறது
uk: Кінці з’єднувача

source: Properties
es: Propiedades
fr: Propriétés
ta: பண்புகள்
uk: Властивості

source: Property Paths
es: Rutas de acceso a las propiedades
fr: Chemins des propriétés
ta: சொத்து பாதைகள்
uk: Шляхи власності

source: Property-Specific Types
es: Tipos específicos de propiedad
fr: Types de Propriétés-Spécifiques
ta: சொத்து சார்ந்த வகைகள்
uk: Типи властивостей

source: Property Strings
es: Cadenas de propiedades
fr: Chaînes de propriété
ta: சொத்து சரங்கள்
uk: Рядки властивостей

source: Value Types
es: Tipos de valores
fr: Types de valeurs
ta: மதிப்பு வகைகள்
uk: Типи значень

source: ConstraintBlocks
es: Bloques de restricción
fr: BlocsContraintes
ta: கட்டுப்பாடு பிளாக்ச்

source: Libraries
es: Bibliotecas
fr: Bibliothèques
ta: நூலகங்கள்
uk: Бібліотеки

source: ModelElements
fr: ÉlémentsModèle
ta: மாதிரி
uk: Елементи моделі

source: PortsAndFlows
fr: PortsEtFlux
ta: போர்ட்சாண்ட்ஃப்ளோச்

source: Actions on Nested Ports
es: Acciones en puertos anidados
fr: Actions sur les Ports Imbriqués
ta: உள்ளமைக்கப்பட்ட துறைமுகங்களில் நடவடிக்கைகள்
uk: Дії над вкладеними портами

source: Port Stereotypes
es: Estereotipos del puerto
fr: Stéréotypes du Port
ta: துறைமுகம் ச்டீரியோடைப்கள்
uk: Портові стереотипи

source: Property Value Change Events
es: Eventos de cambio de valor de la propiedad
fr: Événements de Changement de la Valeur des Propriétés
ta: சொத்து மதிப்பு நிகழ்வுகளை மாற்றவும்
uk: Події зміни вартості майна

source: Provided and Required Features
es: Funciones previstas y necesarias
fr: Caractéristiques Fournies et Requises
ta: வழங்கப்பட்ட மற்றும் தேவையான நற்பொருத்தங்கள்
uk: Надані та необхідні функції

source: Item Flow
es: Flujo de elementos
fr: Flux de l'article
ta: உருப்படி ஓட்டம்
uk: Потік предметів

source: Requirements
es: Requisitos
fr: Exigences
ta: தேவைகள்
uk: Вимоги

source: Unified Modeling Language
es: Lenguaje Unificado de Modelado
fr: Langage de Modélisation Unifié
ta: ஒருங்கிணைந்த மாடலிங் மொழி
uk: Уніфікована мова моделювання

source: The UML model is the most extensive model in Gaphor. It is used as a base language for [SysML](sysml.md), [RAAML](raaml.md), and [C4](c4model.md).
es: El modelo UML es el más extenso de Gaphor. Se usa como lenguaje base para [SysML](sysml.md), [RAAML](raaml.md), y [C4](c4model.md).
fr: Le modèle UML est le modèle le plus complet de Gaphor. Il est utilisé comme langage de base pour [SysML](sysml.md), [RAAML](raaml.md) et [C4](c4model.md).
ta: யுஎம்எல் மாதிரி கஃபரில் மிகவும் விரிவான மாடலாகும். இது [SysML](sysml.md) [RAAML](raaml.md) மற்றும் [C4](c4model.md) ஆகியவற்றிற்கான அடிப்படை மொழியாகப் பயன்படுத்தப்படுகிறது.
uk: Модель UML є найширшою моделлю в Gaphor. Він використовується як базова мова для [SysML](sysml.md), [RAAML](raaml.md) і [C4](c4model.md).

source: Gaphor follows the [official UML 2.5.1 data model](https://www.omg.org/spec/UML/). Where changes have been made a comment has been added to the model. In particular where _m:n_ relationships subset _1:n_ relationships.
es: Gaphor sigue el [modelo oficial de datos UML 2.5.1](https://www.omg.org/spec/UML/). Cuando se han realizado cambios, se ha añadido un comentario al modelo. En particular, cuando las relaciones _m:n_ sustituyen a las relaciones _1:n_.
fr: Gaphor suit le [modèle de données officiel UML 2.5.1](https://www.omg.org/spec/UML/). Lorsque des modifications ont été apportées, un commentaire a été ajouté au modèle. En particulier, lorsque les relations _m:n_ sous-tendent les relations _1:n_.
ta: Kaphor [அதிகாரப்பூர்வ யுஎம்எல் 2.5.1 தரவு மாதிரி] (https://www.omg.org/spec/uml/) ஐப் பின்பற்றுகிறது. மாற்றங்கள் செய்யப்பட்டுள்ள இடத்தில் ஒரு கருத்து சேர்க்கப்பட்டுள்ளது. குறிப்பாக _M: n_ உறவுகள் துணைக்குழு _1: n_ உறவுகள்.
uk: Gaphor дотримується [офіційної моделі даних UML 2.5.1] (https://www.omg.org/spec/UML/). Там, де були внесені зміни, до моделі було додано коментар. Зокрема, де _m:n_ відношень підмножина _1:n_ відношень.

source: 01. Common Structure
es: 01. Estructura común
fr: 01. Structure commune
ta: 01. பொதுவான அமைப்பு
uk: 01. Загальна структура

source: 1. Root
es: 1. Raíz
fr: 1. Racine
ta: 1. ரூட்
uk: 1. Корінь

source: 2. Templates
es: 2. Plantillas
fr: 2. Modèles
ta: 2. வார்ப்புருக்கள்
uk: 2. Шаблони

source: Not implemented.
es: No implementado.
fr: Pas implémenté.
ta: செயல்படுத்தப்படவில்லை.
uk: Не реалізовано.

source: 3. Namespaces
es: 3. Espacios de nombres
fr: 3. Espaces de noms
ta: 3. பெயர்வெளிகள்
uk: 3. Простори імен

source: 4. Types and Multiplicity
es: 4. Tipos y multiplicidad
fr: 4. Types et Multiplicité
ta: 4. வகைகள் மற்றும் பெருக்கம்
uk: 4. Типи та множинність

source: 5. Constraints
es: 5. Restricciones
fr: 5. Contraintes
ta: 5. கட்டுப்பாடுகள்
uk: 5. Обмеження

source: 6. Dependencies
es: 6. Dependencias
fr: 6. Dépendances
ta: 6. சார்புநிலைகள்
uk: 6. Залежності

source: 02. Values
es: 02. Valores
fr: 02. Valeurs
ta: 02. மதிப்புகள்
uk: 02. Цінності

source: 1. Literals
es: 1. Literales
fr: 1. Valeurs constantes
ta: 1. லிட்டரர்கள்
uk: 1. Літерали

source: 2. Expressions
es: 2. Expresiones
ta: 2. வெளிப்பாடுகள்
uk: 2. Вирази

source: 03. Classification
es: 03. Clasificación
ta: 03. வகைப்பாடு
uk: 03. Класифікація

source: 1. Classifiers
es: 1. Clasificadores
fr: Les classificateurs
ta: 1. வகைப்படுத்திகள்
uk: 1. Класифікатори

source: 3. Features
es: 3. Características
fr: 3. Caractéristiques
ta: 3. நற்பொருத்தங்கள்
uk: 3. Особливості

source: 4. Properties
es: 4. Propiedades
fr: 4. Propriétés
ta: 4. பண்புகள்
uk: 4. Властивості

source: 5. Operations
es: 5. Operaciones
fr: 5. Opérations
ta: 5. செயல்பாடுகள்
uk: 5. Операції

source: 7. Instances
es: 7. Instancias
ta: 7. நிகழ்வுகள்
uk: 7. Примірники

source: 04. Simple Classifiers
es: 04. Clasificadores simples
fr: 04. Classificateurs simples (Simple Classifiers)
ta: 04. எளிய வகைப்படுத்திகள்
uk: 04. Прості класифікатори

source: 1. Data Types
es: 1. Tipos de datos
fr: 1. Types de Données (Data Types)
ta: 1. தரவு வகைகள்
uk: 1. Типи даних

source: 3. Interfaces
ta: 3. இடைமுகங்கள்
uk: 3. Інтерфейси

source: 05. Structured Classifiers
es: 05. Clasificadores estructurados
fr: 05. Classificateurs structurés (Structured Classifiers)
ta: 05. கட்டமைக்கப்பட்ட வகைப்படுத்திகள்
uk: 05. Структуровані класифікатори

source: 1. Structured Classifiers
es: 1. Clasificadores estructurados
fr: 1. Classificateurs structurés (Structured Classifiers)
ta: 1. கட்டமைக்கப்பட்ட வகைப்படுத்திகள்
uk: 1. Структуровані класифікатори

source: 2. Encapsulated Classifiers
es: 2. Clasificadores encapsulados
fr: 2. Classificateurs encapsulés (Encapsulated Classifiers)
ta: 2. இணைக்கப்பட்ட வகைப்படுத்திகள்
uk: 2. Інкапсульовані класифікатори

source: 3. Classes
es: 3. Clases
ta: 3. வகுப்புகள்
uk: 3. Заняття

source: 4. Associations
es: 4. Asociaciones
ta: 4. சங்கங்கள்
uk: 4. Асоціації

source: 5. Components
es: 5. Componentes
fr: 5. Composants (Components)
ta: 5. கூறுகள்
uk: 5. Компоненти

source: 6. Collaborations
es: 6. Colaboraciones
ta: 6. ஒத்துழைப்புகள்
uk: 6. Співпраця

source: 06. Packaging
es: 06. Empaquetado
ta: 06. பேக்கேசிங்
uk: 06. Упаковка

source: 1. Packages
es: 1. Paquetes
fr: 1. Paquets (Packages)
ta: 1. தொகுப்புகள்
uk: 1. Пакети

source: 2. Profiles
es: 2. Perfiles
ta: 2. சுயவிவரங்கள்
uk: 2. Профілі

source: 07. Common Behaviors
es: 07. Comportamientos comunes
fr: 07. Comportements commun (Common Behaviors)
ta: 07. பொதுவான நடத்தைகள்
uk: 07. Звичайна поведінка

source: 1. Behaviors
es: 1. Comportamientos
fr: 1. Comportements
ta: 1. நடத்தைகள்
uk: 1. Поведінки

source: 2. Events
es: 2. Eventos
fr: 2. Evénements
ta: 2. நிகழ்வுகள்
uk: 2. Події

source: 08. State Machines
es: 08. Máquinas de estado
fr: 08. Machines d'État (State Machines)
ta: 08. மாநில இயந்திரங்கள்
uk: 08. Державні машини

source: 1. Behavior State Machines
es: 1. Máquinas de estado de comportamiento
fr: 1. Comportement Machine d'État (Behavior State Machines)
ta: 1. நடத்தை மாநில இயந்திரங்கள்
uk: 1. Автомати стану поведінки

source: 09. Activities
es: 09. Actividades
fr: 09. Activités
ta: 09. செயல்பாடுகள்
uk: 09. Діяльність

source: 1. Activities
es: 1. Actividades
fr: 1. Activités
ta: 1. செயல்பாடுகள்
uk: 1. Діяльність

source: 2. Control Nodes
es: 2. Nodos de control
fr: 2. Nœuds de contrôle (Control Nodes)
ta: 2. கட்டுப்பாட்டு முனைகள்
uk: 2. Вузли управління

source: 3. Object Nodes
es: 3. Nodos objeto
fr: 3. Nœuds d'objets (Object Nodes)
ta: 3. பொருள் முனைகள்
uk: 3. Вузли об’єктів

source: 4. Executable Nodes
es: 4. Nodos ejecutables
fr: 4. Nœuds exécutables
ta: 4. இயங்கக்கூடிய முனைகள்
uk: 4. Виконувані вузли

source: 5. Activity Groups
es: 5. Grupos de actividad
fr: 5. Groupes d'activités (Activity Groups)
ta: 5. செயல்பாட்டுக் குழுக்கள்
uk: 5. Групи діяльності

source: 10. Actions
es: 10. Acciones
ta: 10. செயல்கள்
uk: 10. Дії

source: 1. Actions
es: 1. Acciones
ta: 1. செயல்கள்
uk: 1. Дії

source: 2. Invocation Actions
es: 2. Acciones de invocación
fr: 2. Actions d'invocation
ta: 2. அழைப்பிதழ் நடவடிக்கைகள்
uk: 2. Дії виклику

source: 7. Structural Feature Actions
es: 7. Acciones de características estructurales
fr: 7. Caractéristiques Struturelles des Actions (Structural Feature Action)
ta: 7. கட்டமைப்பு அம்ச நடவடிக்கைகள்
uk: 7. Дії структурних ознак

source: 9. Accept Event Actions
es: 9. Aceptar acciones de eventos
fr: 9. Accepter Actions sur les Événements (Accept Event Actions)
ta: 9. நிகழ்வு நடவடிக்கைகளை ஏற்றுக்கொள்ளுங்கள்
uk: 9. Прийняти дії подій

source: 11. Interactions
es: 11. Interacciones
ta: 11. இடைவினைகள்
uk: 11. Взаємодії

source: 1. Interactions
es: 1. Interacciones
ta: 1. தொடர்புகள்
uk: 1. Взаємодії

source: 2. Lifelines
es: 2. Líneas de vida
fr: 2. Lignes de vie (Lifelines)
ta: 2. ஆயுட்காலம்
uk: 2. Лінії життя

source: 3. Messages
es: 3. Mensajes
ta: 3. செய்திகள்
uk: 3. Повідомлення

source: 4. Occurrences
es: 4. Ocurrencias
ta: 4. நிகழ்வுகள்
uk: 4. Випадки

source: 12. Use Cases
es: 12. Casos prácticos
fr: 12. Cas d'utilisation (Use Cases)
ta: 12. வழக்குகளைப் பயன்படுத்துங்கள்
uk: 12. Випадки використання

source: UseCases
fr: Cas d'utilisation (UseCases)
ta: பயன்படுத்தும்வழக்குகள்
uk: Випадки використання

source: 13. Deployments
es: 13. Despliegues
fr: 13. Déploiements (Deployments)
ta: 13. வரிசைப்படுத்தல்
uk: 13. Розгортання

source: 1. Deployments
es: 1. Despliegues
fr: 1. Deployments (Deployments)
ta: 1. வரிசைப்படுத்தல்
uk: 1. Розгортання

source: 2. Artifacts
es: 2. Artefactos
fr: 2. Artefacts (Artifacts)
ta: 2. கலைப்பொருட்கள்
uk: 2. Артефакти

source: 3. Nodes
es: 3. Nodos
fr: 3. Nœuds (Nodes)
ta: 3. முனைகள்
uk: 3. Вузли

source: 14. Information Flows
es: 14. Flujos de información
fr: 14. Flux d'informations ( Information Flows)
ta: 14. செய்தி பாய்கிறது
uk: 14. Інформаційні потоки

source: A. Gaphor Specific Constructs
es: A. Constructores específicos de Gaphor
fr: A. Constructions spécifiques à Gaphor
ta: A. காஃபர் குறிப்பிட்ட கட்டுமானங்கள்
uk: A. Специфічні конструкції Gaphor

source: 1. Diagrams
fr: 1. Diagrammes
ta: 1. வரைபடங்கள்
uk: 1. Діаграми

source: 2. Stereotype Applications
fr: 2. Applications des Stéréotypes
ta: 2. ச்டீரியோடைப் பயன்பாடுகள்
uk: 2. Застосування стереотипів

source: B. Gaphor Profile
es: B. Perfil de Gaphor
fr: B. Profil de Gaphor
ta: பி. காஃபர் சுயவிவரம்
uk: B. Профіль Gaphor
