Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: All data models are described in the `Modeling Languages` section of the docs.
es: Todos los modelos de datos se describen en la sección "Lenguajes de modelado" de la documentación.
fr: Tous les modèles de données sont décrits dans la section `Modeling Languages` (Langages de modélisation) de la documentation.
ta: அனைத்து தரவு மாதிரிகள் டாக்சின் `மாடலிங் மொழிகள்` பிரிவில் விவரிக்கப்பட்டுள்ளன.
uk: Усі моделі даних описано в розділі «Мови моделювання» документів.

source: If you use Gaphor’s Console, you’ll need to apply all changes in a transaction, or they will result in an error.
es: Si utiliza la consola de Gaphor, tendrá que aplicar todos los cambios en una transacción, o se producirá un error.
fr: Si vous utilisez la console de Gaphor, vous devrez appliquer toutes les modifications dans une transaction, sinon une erreur se produira.
ta: நீங்கள் காஃபரின் கன்சோலைப் பயன்படுத்தினால், நீங்கள் ஒரு பரிவர்த்தனையில் அனைத்து மாற்றங்களையும் பயன்படுத்த வேண்டும், அல்லது அவை பிழையை ஏற்படுத்தும்.
uk: Якщо ви використовуєте консоль Gaphor, вам потрібно буде застосувати всі зміни в транзакції, інакше вони призведуть до помилки.

source: If you want a comprehensive example of a code generator, have a look at [Gaphor’s `coder` module](https://github.com/gaphor/gaphor/blob/main/gaphor/codegen/coder.py). This module is used to generate the code for the data models used by Gaphor.
es: Si quieres un ejemplo completo de un generador de código, echa un vistazo al [modulo `coder` de Gaphor](https://github.com/gaphor/gaphor/blob/main/gaphor/codegen/coder.py). Este módulo se utiliza para generar el código de los modelos de datos utilizados por Gaphor.
fr: Si vous voulez un exemple complet de générateur de code, jetez un coup d'œil au [module `coder` de Gaphor] (https://github.com/gaphor/gaphor/blob/main/gaphor/codegen/coder.py). Ce module est utilisé pour générer le code des modèles de données utilisés par Gaphor.
ta: ஒரு குறியீடு செனரேட்டரின் விரிவான எடுத்துக்காட்டு நீங்கள் விரும்பினால், [kaphor’s `coder` தொகுதி] (https://github.com/gaphor/gaphor/blob/main/gaphor/codegen/coder.py) ஐப் பாருங்கள். காஃபர் பயன்படுத்தும் தரவு மாதிரிகளுக்கான குறியீட்டை உருவாக்க இந்த தொகுதி பயன்படுத்தப்படுகிறது.
uk: Якщо вам потрібен повний приклад генератора коду, погляньте на [Gaphor's `coder` module] (https://github.com/gaphor/gaphor/blob/main/gaphor/codegen/coder.py). Цей модуль використовується для генерації коду для моделей даних, що використовуються у Gaphor.

source: This page is rendered with [MyST-NB](https://myst-nb.readthedocs.io/). It’s actually a Jupyter Notebook!
es: Esta página se renderiza con [MyST-NB](https://myst-nb.readthedocs.io/). ¡En realidad es un Jupyter Notebook!
fr: Cette page est réalisée avec [MyST-NB](https://myst-nb.readthedocs.io/). Il s'agit en fait d'un carnet de notes Jupyter !
ta: இந்த பக்கம் [myst-nb](https://myst-nb.readthedocs.io/) உடன் வழங்கப்படுகிறது. இது உண்மையில் சூபிட்டர் நோட்புக்!
uk: Ця сторінка відображається за допомогою [MyST-NB](https://myst-nb.readthedocs.io/). Це насправді блокнот Юпітера!

source: Examples
es: Ejemplos
fr: Exemples
ta: எடுத்துக்காட்டுகள்
uk: Приклади

source: Expanding on the information above the following snippetts show how to create requirements and interfaces.
fr: En développant les informations ci-dessus, les extraits suivants montrent comment créer des exigences et des interfaces.
ta: பின்வரும் துணுக்குகளுக்கு மேலே உள்ள தகவல்களை விரிவாக்குவது தேவைகள் மற்றும் இடைமுகங்களை எவ்வாறு உருவாக்குவது என்பதைக் காட்டுகிறது.
uk: Розширюючи наведену вище інформацію, у наступних фрагментах показано, як створювати вимоги та інтерфейси.

source: Requirements from text fields
fr: Exigences des champs de texte
ta: உரை புலங்களிலிருந்து தேவைகள்
uk: Вимоги до текстових полів

source: Interfaces from dictionaries
fr: Interfaces à partir de dictionnaires
ta: அகராதிகளிலிருந்து இடைமுகங்கள்
uk: Інтерфейси зі словників

source: Basic Validation
fr: Validation de base
ta: அடிப்படை சரிபார்ப்பு
uk: Базова перевірка

source: Some simple validation checks can be run using a couple of small functions to select and evaluate elements.
fr: Des contrôles de validation simples peuvent être effectués à l'aide de quelques petites fonctions pour sélectionner et évaluer les éléments.
ta: சில எளிய சரிபார்ப்பு காசோலைகளை உறுப்புகளைத் தேர்ந்தெடுத்து மதிப்பீடு செய்ய இரண்டு சிறிய செயல்பாடுகளைப் பயன்படுத்தி இயக்க முடியும்.
uk: Деякі прості перевірки можна запустити за допомогою кількох невеликих функцій для вибору та оцінки елементів.

source: Here is another example:
es: Aquí hay otro ejemplo:
fr: Voici un autre exemple :
ta: இங்கே மற்றொரு எடுத்துக்காட்டு:
uk: Ось інший приклад:

source: Service Oriented Architecture
es: Arquitectura orientada a Servicios
fr: Architecture Orientée Service
ta: பணி சார்ந்த கட்டமைப்பு
uk: Сервісно-орієнтована архітектура

source: Gaphor has a service oriented architecture. What does this mean? Well, Gaphor is built as a set of small islands (services). Each island provides a specific piece of functionality. For example, we use separate services to load/save models, provide the menu structure, and to handle the undo system.
es: Gaphor tiene una arquitectura orientada a servicios. ¿Qué significa esto? Bueno, Gaphor está construido como un conjunto de pequeñas islas (servicios). Cada isla proporciona una funcionalidad específica. Por ejemplo, utilizamos servicios separados para cargar/guardar modelos, proporcionar la estructura del menú, y para manejar el sistema de deshacer.
fr: Gaphor a une architecture orientée services. Qu'est-ce que cela signifie ? Gaphor est construit comme un ensemble de petites îles (services). Chaque îlot fournit une fonctionnalité spécifique. Par exemple, nous utilisons des services distincts pour charger/sauvegarder les modèles, pour fournir la structure du menu, et pour gérer le système d'annulation.
ta: கஃபர் ஒரு பணி சார்ந்த கட்டமைப்பைக் கொண்டுள்ளது. இதன் பொருள் என்ன? சரி, காஃபர் சிறிய தீவுகளின் (சேவைகள்) தொகுப்பாக கட்டப்பட்டுள்ளது. ஒவ்வொரு தீவும் ஒரு குறிப்பிட்ட செயல்பாட்டை வழங்குகிறது. எடுத்துக்காட்டாக, மாதிரிகளை ஏற்றவும்/சேமிக்கவும், பட்டியல் கட்டமைப்பை வழங்கவும், செயல்தவிர் அமைப்பைக் கையாளவும் தனி சேவைகளைப் பயன்படுத்துகிறோம்.
uk: Gaphor має сервіс-орієнтовану архітектуру. Що це означає? Ну, Gaphor побудований як набір маленьких острівців (сервісів). Кожен острівець забезпечує певну частину функціональності. Наприклад, ми використовуємо окремі сервіси для завантаження/збереження моделей, забезпечення структури меню та роботи з системою скасування.

source: We define services as entry points in the `pyproject.toml`. With entry points, applications can register functionality for specific purposes. We also group entry points in to *entry point groups*. For example, we use the console_scripts entry point group to start an application from the command line.
es: Definimos los servicios como puntos de entrada en el `pyproject.toml`. Con los puntos de entrada, las aplicaciones pueden registrar funcionalidades para fines específicos. También agrupamos los puntos de entrada en *grupos de puntos de entrada*. Por ejemplo, utilizamos el grupo de puntos de entrada console_scripts para iniciar una aplicación desde la línea de comandos.
fr: Nous définissons les services comme des points d'entrée dans le fichier `pyproject.toml`. Grâce à ces points d'entrée, les applications peuvent enregistrer des fonctionnalités à des fins spécifiques. Nous les regroupons également en groupes de points d'entrée. Par exemple, nous utilisons le groupe e points d'entrée 'console_scripts 'pour démarrer une application à partir de la ligne de commande.
ta: `Pyproject.toml` இல் உள்ள நுழைவு புள்ளிகளாகச் சேவைகளை வரையறுக்கிறோம். நுழைவு புள்ளிகளுடன், பயன்பாடுகள் குறிப்பிட்ட நோக்கங்களுக்காகச் செயல்பாட்டைப் பதிவு செய்யலாம். நுழைவு புள்ளி குழுக்களுக்கும் *நுழைவு புள்ளிகளையும் குழுக் குழு செய்கிறது. எடுத்துக்காட்டாக, கட்டளை வரியிலிருந்து ஒரு பயன்பாட்டைத் தொடங்க கன்சோல்_ச்கிரிப்ட்ச் நுழைவு புள்ளி குழுவைப் பயன்படுத்துகிறோம்.
uk: Ми визначаємо сервіси як точки входу в `pyproject.toml`. За допомогою точок входу програми можуть реєструвати функціональність для певних цілей. Ми також групуємо точки входу у *групи точок входу*. Наприклад, ми використовуємо групу точок входу console_scripts для запуску програми з командного рядка.

source: Services
es: Servicios
ta: சேவைகள்
uk: Послуги

source: Gaphor is modeled around the concept of services. Each service can be registered with the application and then it can be used by other services or other objects living within the application.
es: Gaphor se modela en torno al concepto de servicios. Cada servicio puede ser registrado con la aplicación y luego puede ser utilizado por otros servicios u otros objetos que existen dentro de la aplicación.
fr: Gaphor est modélisé autour du concept de services. Chaque service peut être enregistré auprès de l'application et peut ensuite être utilisé par d'autres services ou d'autres objets présents dans l'application.
ta: கஃபர் சேவைகளின் கருத்தை சுற்றி வடிவமைக்கப்பட்டுள்ளது. ஒவ்வொரு சேவையையும் பயன்பாட்டில் பதிவு செய்யலாம், பின்னர் அதை பிற சேவைகள் அல்லது பயன்பாட்டிற்குள் வாழும் பிற பொருள்களால் பயன்படுத்தலாம்.
uk: Gaphor моделюється навколо концепції послуг. Кожну послугу можна зареєструвати в програмі, а потім нею можуть користуватися інші служби або інші об’єкти, що знаходяться в програмі.

source: Each service should implement the Service interface. This interface defines one method:
es: Cada servicio debe implementar la interfaz Service. Esta interfaz define un método:
fr: Chaque service doit implémenter l'interface Service. Cette interface définit une méthode :
ta: ஒவ்வொரு சேவையும் பணி இடைமுகத்தை செயல்படுத்த வேண்டும். இந்த இடைமுகம் ஒரு முறையை வரையறுக்கிறது:
uk: Кожна служба повинна реалізовувати інтерфейс служби. Цей інтерфейс визначає один метод:

source: Which is called when a service needs to be cleaned up.
es: Que se llama cuando hay que limpiar un servicio.
fr: C'est ce qu'on appelle lorsqu'un service doit être nettoyé.
ta: ஒரு சேவையை தூய்மை செய்ய வேண்டியிருக்கும் போது இது அழைக்கப்படுகிறது.
uk: Викликається, коли послугу потрібно очистити.

source: We allow each service to define its own methods, as long as the service is implemented too.
es: Permitimos que cada servicio defina sus propios métodos, siempre y cuando el servicio también esté implementado.
fr: Nous permettons à chaque service de définir ses propres méthodes, à condition que le service soit également implémenté.
ta: ஒவ்வொரு சேவையும் அதன் சொந்த முறைகளை வரையறுக்க அனுமதிக்கிறோம், சேவையும் செயல்படுத்தப்படும் வரை.
uk: Ми дозволяємо кожній службі визначати власні методи, якщо послугу також реалізовано.

source: Services should be defined as entry points in the `pyproject.toml` file.
es: Los servicios deben definirse como puntos de entrada en el archivo `pyproject.toml`.
fr: Les services doivent être définis comme des points d'entrée dans le fichier `pyproject.toml`.
ta: `Pyproject.toml` கோப்பில் உள்ள நுழைவு புள்ளிகளாக சேவைகளை வரையறுக்க வேண்டும்.
uk: Послуги мають бути визначені як точки входу у файлі `pyproject.toml`.

source: Typically, a service does some work in the background. Services can also expose actions that can be invoked by users. For example, the _Ctrl-z_ key combo (undo) is implemented by the UndoManager service.
es: Normalmente, un servicio realiza algún trabajo en segundo plano. Los servicios también pueden exponer acciones que pueden ser invocadas por los usuarios. Por ejemplo, la combinación de teclas _Ctrl-z_ (deshacer) está implementada por el servicio UndoManager.
fr: En général, un service effectue un travail en arrière-plan. Les services peuvent également exposer des actions qui peuvent être invoquées par les utilisateurs. Par exemple, la combinaison de touches _Ctrl-z_ (annuler) est implémentée par le service UndoManager.
ta: பொதுவாக, ஒரு பணி பின்னணியில் சில வேலை செய்கிறது. பயனர்களால் செயல்படுத்தக்கூடிய செயல்களையும் சேவைகள் அம்பலப்படுத்தலாம். எடுத்துக்காட்டாக, _CTRL-Z_ விசை காம்போ (செயல்தவிர்) Undomanager சேவையால் செயல்படுத்தப்படுகிறது.
uk: Зазвичай, сервіс виконує певну роботу у фоновому режимі. Сервіси також можуть надавати дії, які можуть бути викликані користувачами. Наприклад, комбінація клавіш _Ctrl-z_ (скасувати) реалізована за допомогою сервісу UndoManager.

source: A service can also depend on another services. Service initialization resolves these dependencies. To define a service dependency, just add it to the constructor by its name defined in the entry point:
es: Un servicio también puede depender de otros servicios. La inicialización del servicio resuelve estas dependencias. Para definir una dependencia de servicio, basta con añadirla al constructor por su nombre definido en el punto de entrada:
fr: Un service peut également dépendre d'autres services. L'initialisation du service résout ces dépendances. Pour définir une dépendance de service, il suffit de l'ajouter au constructeur par son nom défini dans le point d'entrée :
ta: ஒரு சேவையும் மற்றொரு சேவையைப் பொறுத்தது. பணி துவக்கம் இந்த சார்புகளை தீர்க்கிறது. ஒரு பணி சார்புநிலையை வரையறுக்க, நுழைவு புள்ளியில் வரையறுக்கப்பட்ட அதன் பெயரால் அதை கட்டமைப்பாளரிடம் சேர்க்கவும்:
uk: Послуга також може залежати від інших служб. Ініціалізація служби усуває ці залежності. Щоб визначити залежність служби, просто додайте її до конструктора за її іменем, визначеним у точці входу:

source: Services that expose actions should also inherit from the ActionProvider interface. This interface does not require any additional methods to be implemented. Action methods should be annotated with an `@action` annotation.
es: Los servicios que exponen acciones también deben heredar de la interfaz ActionProvider. Esta interfaz no requiere la implementación de ningún método adicional. Los métodos de acción deben llevar la anotación `@action`.
fr: Les services qui proposent des actions doivent également hériter de l'interface ActionProvider. Cette interface ne nécessite pas l'implémentation de méthodes supplémentaires. Les méthodes d'action doivent être annotées avec l'annotation `@action`.
ta: செயல்களை அம்பலப்படுத்தும் சேவைகள் ஆக்சன் ப்ரோவைடர் இடைமுகத்திலிருந்து பெற வேண்டும். இந்த இடைமுகத்திற்கு கூடுதல் முறைகள் செயல்படுத்தப்பட தேவையில்லை. செயல் முறைகள் `@செயல்` சிறுகுறிப்பு மூலம் சிறுகுறிப்பு செய்யப்பட வேண்டும்.
uk: Сервіси, які виставляють дії, також повинні успадковувати інтерфейс ActionProvider. Цей інтерфейс не вимагає реалізації жодних додаткових методів. Методи дій повинні мати анотацію `@action`.

source: Example: ElementFactory
es: Ejemplo: fábrica de elementos
fr: Exemple : ElementFactory
ta: எடுத்துக்காட்டு: எலிமெண்ட்பாக்டரி
uk: Приклад: ElementFactory

source: A nice example of a service in use is the {obj}`~gaphor.core.modeling.ElementFactory`. It is one of the core services.
fr: Un bon exemple de service utilisé est le {obj}`~gaphor.core.modeling.ElementFactory`. C'est l'un des services de base.
ta: பயன்பாட்டில் உள்ள ஒரு சேவையின் ஒரு நல்ல எடுத்துக்காட்டு {obj}`~gaphor.core.modeling.ElementFactory`. இது முக்கிய சேவைகளில் ஒன்றாகும்.
uk: Гарним прикладом використовуваної служби є {obj}`~gaphor.core.modeling.ElementFactory`. Це одна з основних послуг.

source: When an important events occurs, like an element is created or destroyed, that event is emitted. We then use an event handler for `ElementFactory` that stores the add/remove signals in the undo system. Another example of events that are emitted are with {obj}`~gaphor.core.modeling.Element`'s. Those classes, or more specifically, the properties, send notifications every time their state changes.
fr: Lorsqu'un événement important se produit, comme la création ou la destruction d'un élément, l'événement correspondant est émis. Nous utilisons alors un gestionnaire d'événement pour la classe `ElementFactory` qui stocke les signaux d'ajout/suppression dans le système d'annulation. Un autre exemple d'événements émis concerne les {obj}`~gaphor.core.modeling.Element`. Ces classes, ou plus précisément leurs propriétés, envoient des notifications à chaque fois que leur état change.
ta: ஒரு முக்கியமான நிகழ்வுகள் நிகழும்போது, ஒரு உறுப்பு உருவாக்கப்படுவது அல்லது அழிக்கப்படுவது போல, அந்த நிகழ்வு வெளிப்படும். செயல்தவிர் கணினியில் சேர்க்கை/அகற்று சமிக்ஞைகளை சேமிக்கும் `ElementFactory` க்கு ஒரு நிகழ்வு கையாளுபவரைப் பயன்படுத்துகிறோம். வெளிப்படும் நிகழ்வுகளின் மற்றொரு எடுத்துக்காட்டு {obj}`~gaphor.core.modeling.Element` உடன். அந்த வகுப்புகள், அல்லது இன்னும் குறிப்பாக, பண்புகள், ஒவ்வொரு முறையும் அவற்றின் நிலை மாறும்போது அறிவிப்புகளை அனுப்புகின்றன.
uk: Коли відбувається важлива подія, наприклад, створюється або знищується елемент, ця подія випромінюється. Потім ми використовуємо обробник подій для `ElementFactory`, який зберігає сигнали додавання/видалення у системі скасування. Іншим прикладом подій, які генеруються, є події для {obj}`~gaphor.core.modeling.Element``. Ці класи, або, точніше, властивості, надсилають сповіщення щоразу, коли змінюється їхній стан.

source: Entry Points
es: Puntos de entrada
fr: Points d'entrée (Entry Points)
ta: நுழைவு புள்ளிகள்
uk: Точки входу

source: Gaphor uses a main :ref`entry point <https://packaging.python.org/en/latest/specifications/entry-points/>` group called `gaphor.services`.
fr: Gaphor utilise un groupe principal :ref`entry point <https://packaging.python.org/en/latest/specifications/entry-points/>` appelé `gaphor.services`.
ta: காஃபர் ஒரு முக்கிய :ref`entry புள்ளி <https://packaging.python.org/en/latest/specifications/entry-points/>` `gaphor.services` எனப்படும் குழு.
uk: Gaphor використовує основну групу :ref`entry point <https://packaging.python.org/en/latest/specifications/entry-points/>` під назвою `gaphor.services`.

source: Services are used to perform the core functionality of the application while breaking the functions in to individual components. For example, the element factory and undo manager are both services.
es: Los servicios se utilizan para llevar a cabo la funcionalidad básica de la aplicación, dividiendo las funciones en componentes individuales. Por ejemplo, la fábrica de elementos y el gestor de deshacer son ambos servicios.
fr: Les services sont utilisés pour réaliser la fonctionnalité de base de l'application tout en décomposant les fonctions en composants individuels. Par exemple, la fabrique d'éléments et le gestionnaire d'annulation sont tous deux des services.
ta: தனிப்பட்ட கூறுகளுடன் செயல்பாடுகளை உடைக்கும்போது பயன்பாட்டின் முக்கிய செயல்பாட்டை செய்ய சேவைகள் பயன்படுத்தப்படுகின்றன. எடுத்துக்காட்டாக, உறுப்பு தொழிற்சாலை மற்றும் செயல்தவிர் மேலாளர் இருவரும் சேவைகள்.
uk: Послуги використовуються для виконання основних функцій програми, одночасно розбиваючи функції на окремі компоненти. Наприклад, фабрика елементів і диспетчер скасування є послугами.

source: Plugins can also be created to extend Gaphor beyond the core functionality as an add-on. For example, a plugin could be created to connect model data to other applications. Plugins are also defined as services. For example a new XMI export plugin would be defined as follows in the `pyproject.toml`:
es: Plugins pueden ser creados también para extender Gaphor más allá de la funcionalidad de núcleo como un add-on. Por ejemplo, un plugin podría ser creado para conectar los datos del modelo a otras aplicaciones. Los plugins también son definidos como servicios. Por ejemplo, un nuevo plugin XMI de exportación sería definido como sigue en el `pyproject.toml`:
fr: Des plugins peuvent également être créés pour étendre Gaphor au-delà de ses fonctionnalités de base. Par exemple, un plugin peut être créé pour connecter les données du modèle à d'autres applications. Les plugins sont également définis comme des services. Par exemple, un nouveau plugin d'exportation XMI serait défini comme suit dans le fichier `pyproject.toml` :
ta: முக்கிய செயல்பாட்டிற்கு அப்பால் கேஃபரை ஒரு துணை நிரலாக நீட்டிக்க செருகுநிரல்களையும் உருவாக்கலாம். எடுத்துக்காட்டாக, மாதிரி தரவை பிற பயன்பாடுகளுடன் இணைக்க ஒரு சொருகி உருவாக்கப்படலாம். செருகுநிரல்களும் சேவைகளாகவும் வரையறுக்கப்படுகின்றன. எடுத்துக்காட்டாக ஒரு புதிய எக்ச்எம்ஐ ஏற்றுமதி சொருகி `pyproject.toml` இல் பின்வருமாறு வரையறுக்கப்படும்:
uk: Плагіни також можуть бути створені для розширення функціональності Gaphor за межі основної функціональності в якості надбудови. Наприклад, можна створити плагін для підключення даних моделі до інших додатків. Плагіни також визначаються як сервіси. Наприклад, новий плагін для експорту XMI може бути визначений наступним чином у файлі `pyproject.tml`:

source: Interfaces
ta: இடைமுகங்கள்
uk: Інтерфейси

source: Each service (and plugin) should implement the `gaphor.abc.Service` interface:
es: Cada servicio (y plugin) debe implementar la interfaz `gaphor.abc.Service`:
fr: Chaque service (et plugin) doit implémenter l'interface `gaphor.abc.Service` :
ta: ஒவ்வொரு சேவையும் (மற்றும் சொருகி) `gaphor.abc.service` இடைமுகத்தை செயல்படுத்த வேண்டும்:
uk: Кожна служба (і плагін) має реалізовувати інтерфейс `gaphor.abc.Service`:

source: Base interface for all services in Gaphor.
es: Interfaz base para todos los servicios de Gaphor.
fr: Interface de base pour tous les services de Gaphor.
ta: GAPHOR இல் உள்ள அனைத்து சேவைகளுக்கும் அடிப்படை இடைமுகம்.
uk: Базовий інтерфейс для всіх сервісів Gaphor.

source: Shutdown the services, free resources.
es: Apagar los servicios, liberar recursos.
fr: Fermez les services, libérez les ressources.
ta: சேவைகளை நிறுத்துங்கள், இலவச வளங்கள்.
uk: Вимкнення служб, звільнення ресурсів.

source: Another more specialized service that also inherits from `gaphor.abc.Service`, is the UI Component service. Services that use this interface are used to define windows and user interface functionality. A UI component should implement the `gaphor.ui.abc.UIComponent` interface:
es: Otro servicio más especializado que también hereda de `gaphor.abc.Service`, es el servicio UI Component. Los servicios que utilizan esta interfaz se utilizan para definir las ventanas y la funcionalidad de la interfaz de usuario. Un componente de interfaz de usuario debe implementar la interfaz `gaphor.ui.abc.UIComponent`:
fr: Un autre service plus spécialisé, qui hérite également de `gaphor.abc.Service`, est le service UI Component. Les services qui utilisent cette interface servent à définir les fenêtres et les fonctionnalités de l'interface utilisateur. Un composant d'interface utilisateur doit implémenter l'interface `gaphor.ui.abc.UIComponent` :
ta: `Gaphor.abc.service` இலிருந்து பெறும் மற்றொரு சிறப்பு பணி, இடைமுகம் கூறு சேவையாகும். இந்த இடைமுகத்தைப் பயன்படுத்தும் சேவைகள் சாளரங்கள் மற்றும் பயனர் இடைமுக செயல்பாட்டை வரையறுக்கப் பயன்படுகின்றன. ஒரு இடைமுகம் கூறு `gaphor.ui.abc.uicomponent` இடைமுகத்தை செயல்படுத்த வேண்டும்:
uk: Іншим більш спеціалізованим сервісом, який також успадковується від `gaphor.abc.Service`, є сервіс UI Component. Служби, які використовують цей інтерфейс, використовуються для визначення вікон та функціональності інтерфейсу користувача. UI-компонент має реалізовувати інтерфейс `gaphor.ui.abc.UIComponent`:

source: A user interface component.
es: Un componente de la interfaz de usuario.
fr: Un composant de l'interface utilisateur.
ta: ஒரு பயனர் இடைமுக கூறு.
uk: Компонент інтерфейсу користувача.

source: Close the UI component.
es: Cierre el componente de la interfaz de usuario.
fr: Fermez le composant de l'interface utilisateur.
ta: இடைமுகம் கூறுகளை மூடு.
uk: Закрийте компонент інтерфейсу користувача.

source: The component can decide to hide or destroy the UI components.
es: El componente puede decidir ocultar o destruir los componentes de la interfaz de usuario.
fr: Le composant peut décider de cacher ou de détruire les composants de l'interface utilisateur.
ta: இடைமுகம் கூறுகளை மறைக்க அல்லது அழிக்க கூறு முடிவு செய்யலாம்.
uk: Компонент може вирішити приховати або знищити компоненти інтерфейсу користувача.
