Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: Gaphor is a UML and SysML modeling application written in Python. It is designed to be easy to use, while still being powerful. Gaphor implements a fully-compliant UML 2 data model, so it is much more than a picture drawing tool.
es: Gaphor es una aplicación de modelado UML y SysML escrita en Python. Está diseñado para ser fácil de usar, sin dejar de ser potente. Gaphor implementa un modelo de datos UML 2 totalmente compatible, por lo que es mucho más que una herramienta de dibujo de imágenes.
fr: Gaphor est une application de modélisation UML et SysML écrite en Python. Il est conçu pour être facile à utiliser, tout en étant puissant. Gaphor met en œuvre un modèle de données UML 2 entièrement conforme, ce qui en fait bien plus qu'un outil de schématisation.
ta: GAPHOR என்பது பைத்தானில் எழுதப்பட்ட யுஎம்எல் மற்றும் சிச்எம்எல் மாடலிங் பயன்பாடு ஆகும். இது சக்திவாய்ந்ததாக இருக்கும்போது, பயன்படுத்த எளிதானதாக வடிவமைக்கப்பட்டுள்ளது. கஃபர் ஒரு முழுமையான இணக்கமான யுஎம்எல் 2 தரவு மாதிரியை செயல்படுத்துகிறது, எனவே இது ஒரு பட வரைதல் கருவியை விட அதிகம்.
uk: Gaphor - це програма для моделювання UML та SysML, написана на Python. Він розроблений, щоб бути простим у використанні, але водночас потужним. Gaphor реалізує повністю сумісну модель даних UML 2, тому це набагато більше, ніж просто інструмент для малювання малюнків.

source: You can use Gaphor to quickly visualize different aspects of a system as well as create complete, highly complex models.
es: Puede usar Gaphor para visualizar rápidamente distintos aspectos de un sistema, así como para crear modelos completos de gran complejidad.
fr: Vous pouvez utiliser Gaphor pour visualiser rapidement différents aspects d'un système ainsi que pour créer des modèles complets et très complexes.
ta: ஒரு அமைப்பின் வெவ்வேறு அம்சங்களை விரைவாகக் காட்சிப்படுத்தவும், முழுமையான, மிகவும் சிக்கலான மாதிரிகளை உருவாக்கவும் நீங்கள் கஃபரைப் பயன்படுத்தலாம்.
uk: Ви можете використовувати Gaphor для швидкого візуалізації різних аспектів системи, а також для створення повних, дуже складних моделей.

source: Gaphor is 100% Open source, available under a friendly `Apache 2 license <https://github.com/gaphor/gaphor/blob/main/LICENSES/Apache-2.0.txt>`_. The code and issue tracker can be found on `GitHub <https://github.com/gaphor/gaphor>`_.
fr: Gaphor est 100% Open source, disponible sous une licence conviviale `Apache 2 <https://github.com/gaphor/gaphor/blob/main/LICENSES/Apache-2.0.txt>`_. Le code et le gestionnaire de problèmes peuvent être trouvés sur `GitHub <https://github.com/gaphor/gaphor>`_.
ta: Kaphor என்பது 100% திறந்த மூலமாகும், இது ஒரு நட்பு `அப்பாச்சி 2 உரிமத்தின் கீழ் கிடைக்கிறது <https://github.com/gaphor/gaphor/blob/main/LICENSES/Apache-2.0.txt>`_. குறியீடு மற்றும் வெளியீட்டு டிராக்கரை `github <https://github.com/gaphor/gaphor>`_ இல் காணலாம்.
uk: Gaphor має 100% відкритий вихідний код, доступний під дружньою ліцензією `Apache 2 <https://github.com/gaphor/gaphor/blob/main/LICENSES/Apache-2.0.txt>`_. Код і трекер випусків можна знайти на `GitHub <https://github.com/gaphor/gaphor>`_.

source: What are you waiting for? :doc:`Let's get started <getting_started>`!
es: ¿A qué espera? :doc:`¡Comencemos <getting_started>`!
fr: Qu'attendez-vous ? :doc:`Commençons <getting_started>` !
ta: நீங்கள் எதற்காக காத்திருக்கிறீர்கள்? :doc:`தொடங்குவோம் <getting_started>`!
uk: Чого ти чекаєш :doc:`Почнемо <getting_started>`!

source: For download instructions, and the blog, please visit the `Gaphor Website <https://gaphor.org>`_.
es: Para obtener instrucciones de descarga y consultar el blog, visite el sitio web de `Gaphor <https://gaphor.org>`_.
fr: Pour les instructions de téléchargement et le blog, veuillez visiter le `Gaphor Website <https://gaphor.org>`_.
ta: பதிவிறக்க வழிமுறைகள் மற்றும் வலைப்பதிவுக்கு, தயவுசெய்து `Kaphor வலைத்தளத்தைப் பார்வையிடவும் <https://gaphor.org>`_.
uk: Щоб отримати інструкції щодо завантаження та блог, відвідайте `Веб-сайт Gaphor <https://gaphor.org>`_.

source: Did you know Gaphor has excellent integration with :doc:`Sphinx <sphinx>` and :doc:`Jupyter notebooks <scripting>`?
fr: Saviez-vous que Gaphor a une excellente intégration avec :doc:`Sphinx <sphinx>` et :doc:`Jupyter notebooks <scripting>` ?
ta: காஃபருக்கு சிறந்த ஒருங்கிணைப்பு உங்களுக்குத் தெரியுமா :doc:`ச்பின்க்ச் <sphinx>` மற்றும் :doc:`சூபிட்டர் நோட்புக்குகள் <scripting>`?
uk: Чи знаєте ви, що Gaphor має чудову інтеграцію з :doc:`Sphinx <sphinx>` і :doc:`Jupyter notebooks <scripting>`?

source: Gaphor on Linux
es: Gaphor en Linux
fr: Gaphor avec Linux
ta: லினக்சில் கஃபர்
uk: Gaphor на Linux

source: Gaphor can be installed as Flatpak on Linux, some distributions provide packages. Check out the [Gaphor download page](https://gaphor.org/download/#linux) for details.
fr: Gaphor peut être installé sous forme de Flatpak sous Linux, certaines distributions fournissent des paquets. Consultez la [page de téléchargement de Gaphor] (https://gaphor.org/download/#linux) pour plus de détails.
ta: கஃபர் லினக்சில் பிளாட்பேக்காக நிறுவப்படலாம், சில விநியோகங்கள் தொகுப்புகளை வழங்குகின்றன. விவரங்களுக்கு [kaphor பதிவிறக்கம் பக்கம்](https://gaphor.org/ta/download/#linux) ஐப் பாருங்கள்.
uk: Gaphor можна встановити як Flatpak на Linux, деякі дистрибутиви надають пакети. Перегляньте подробиці на [сторінці завантаження Gaphor](https://gaphor.org/download/#linux).

source: Older releases are available from [GitHub](https://github.com/gaphor/gaphor/releases).
es: Las versiones anteriores están disponibles en [GitHub](https://github.com/gaphor/gaphor/releases).
fr: Les versions antérieures sont disponibles sur [GitHub] (https://github.com/gaphor/gaphor/releases).
ta: பழைய வெளியீடுகள் [github](https://github.com/gaphor/gaphor/relaess) இலிருந்து கிடைக்கின்றன.
uk: Старіші випуски доступні на [GitHub](https://github.com/gaphor/gaphor/releases).

source: [CI builds](https://github.com/gaphor/gaphor/actions/workflows/full-build.yml) are also available.
es: También están disponibles [construcciones CI](https://github.com/gaphor/gaphor/actions/workflows/full-build.yml).
fr: [CI builds] (https://github.com/gaphor/gaphor/actions/workflows/full-build.yml) sont également disponibles.
ta: [CI builds](https://github.com/gaphor/gaphor/actions/workflows/full-build.yml) அரே also available.
uk: Також доступні [сборки CI](https://github.com/gaphor/gaphor/actions/workflows/full-build.yml).

source: Development Environment
es: Entorno de desarrollo
fr: Environnement de développement
ta: மேம்பாட்டு சூழல்
uk: Середовище розробки

source: There are two ways to set up a development environment:
es: Hay dos formas de configurar un entorno de desarrollo:
fr: Il existe deux façons de mettre en place un environnement de développement :
ta: மேம்பாட்டு சூழலை அமைக்க இரண்டு வழிகள் உள்ளன:
uk: Є два способи налаштувати середовище розробки:

source: [GNOME Builder](#gnome-builder), ideal for “drive by” contributions.
es: [GNOME Builder](#gnome-builder), ideal para contribuciones "drive by".
fr: [GNOME Builder](#gnome-builder), idéal pour «engager des» contributions.
ta: [க்னோம் பில்டர்](#gnome-builder), “இயக்கி மூலம்” பங்களிப்புகளுக்கு ஏற்றது.
uk: [GNOME Builder](#gnome-builder), ідеально підходить для внесків «проїздом».

source: [A local environment](#a-local-environment).
es: [Un entorno local](#a-local-environment).
fr: [Un environnement local] (#a-local-environment).
ta: [ஒரு உள்ளக சூழல்](#a-local-environment).
uk: [Місцеве середовище](#a-local-environment).

source: GNOME Builder
fr: Constructeur GNOME
ta: க்னோம் பில்டர்
uk: GNOME Збірник

source: Open [GNOME Builder](https://flathub.org/apps/details/org.gnome.Builder) 43 or newer, [clone the repository](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository). Check if the _Build Profile_ is set to `org.gaphor.Gaphor.json`. If so, hit the _Run_ button to start the application.
es: Abra [GNOME Builder](https://flathub.org/apps/details/org.gnome.Builder) 43 o más reciente, [clone el repositorio](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository). Compruebe si la _Configuración activa_ está configurada como `org.gaphor.Gaphor.json`. Si es así, pulse el botón _Ejecutar_ para iniciar la aplicación.
fr: Ouvrez [GNOME Builder](https://flathub.org/apps/details/org.gnome.Builder) 43 ou plus récent, [clonez le dépôt](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository). Vérifiez que le _Build Profile_ (Profil de construction) est bien `org.gaphor.Gaphor.json`. Si c'est le cas, cliquez sur le bouton _Run_ pour démarrer l'application.
ta: [க்னோம் பில்டர்](https://flathub.org/apps/details/org.gnome.Builder) 43 திற அல்லது புதியது, [களஞ்சியத்தை நகலி](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository). _Build Profile_, `org.gaphor.gaphor.json` என அமைக்கப்பட்டுள்ளதா என்று சரிபார்க்கவும். அப்படியானால், பயன்பாட்டைத் தொடங்க _Run_ பொத்தானை அழுத்தவும்.
uk: Відкрийте [GNOME Builder](https://flathub.org/apps/details/org.gnome.Builder) 43 або новішої версії, [клонуйте сховище](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository). Перевірте, чи встановлено _Профіль збірки_ на `org.gaphor.Gaphor.json`. Якщо так, натисніть кнопку _Run_, щоб запустити програму.

source: A Local Environment
es: Un entorno local
fr: Un environnement local
ta: ஒரு உள்ளக சூழல்
uk: Місцеве середовище

source: To set up a development environment with Linux, you first need a fairly new Linux distribution version. For example, the latest Ubuntu LTS or newer, Arch, Debian Testing, SUSE Tumbleweed, or similar. Gaphor depends on newer versions of GTK, and we don't test for backwards compatibility. You will also need the latest stable version of Python. In order to get the latest stable version without interfering with your system-wide Python version, we recommend that you install [pyenv](https://github.com/pyenv/pyenv).
es: Para configurar un entorno de desarrollo con Linux, primero necesita una versión de distribución de Linux bastante nueva. Por ejemplo, la última Ubuntu LTS o más reciente, Arch, Debian Testing, SUSE Tumbleweed, o similar. Gaphor depende de versiones más recientes de GTK, y no comprobamos la compatibilidad con versiones anteriores. También necesitará la última versión estable de Python. Para obtener la última versión estable sin interferir con la versión de Python de todo el sistema, le recomendamos que instale [pyenv](https://github.com/pyenv/pyenv).
fr: Pour mettre en place un environnement de développement sous Linux, vous devez disposer d'une version assez récente de la distribution Linux. Par exemple, la dernière version LTS d'Ubuntu, une version plus récente d'Arch, de Debian Testing ou de SUSE Tumbleweed, ou une version similaire. Gaphor dépend de versions plus récentes de GTK, et nous ne testons pas la compatibilité ascendante. Vous aurez également besoin de la dernière version stable de Python. Afin d'obtenir la dernière version stable sans interférer avec la version de Python de votre système, nous vous recommandons d'installer [pyenv] (https://github.com/pyenv/pyenv).
ta: லினக்சுடன் ஒரு மேம்பாட்டு சூழலை அமைக்க, உங்களுக்கு முதலில் புதிய லினக்ச் விநியோக பதிப்பு தேவை. எடுத்துக்காட்டாக, அண்மைக் கால உபுண்டு எல்.டி.எச் அல்லது புதிய, ஆர்ச், டெபியன் சோதனை, சுச் டம்பிள்வீட் அல்லது ஒத்த. GAPHOR GTK இன் புதிய பதிப்புகளைப் பொறுத்தது, மேலும் பின்னோக்கி பொருந்தக்கூடிய தன்மையை நாங்கள் சோதிக்கவில்லை. பைத்தானின் அண்மைக் கால நிலையான பதிப்பும் உங்களுக்கு தேவைப்படும். உங்கள் கணினி அளவிலான பைதான் பதிப்பில் தலையிடாமல் அண்மைக் கால நிலையான பதிப்பைப் பெற, நீங்கள் [pyenv] (https://github.com/pyenv/pyenv) ஐ நிறுவ பரிந்துரைக்கிறோம்.
uk: Щоб налаштувати середовище розробки з Linux, вам спочатку потрібна досить нова версія дистрибутива Linux. Наприклад, остання версія Ubuntu LTS або новіша, Arch, Debian Testing, SUSE Tumbleweed або подібні. Gaphor залежить від нових версій GTK, і ми не тестуємо на зворотну сумісність. Вам також знадобиться остання стабільна версія Python. Щоб отримати останню стабільну версію без втручання у вашу системну версію Python, ми рекомендуємо вам встановити [pyenv](https://github.com/pyenv/pyenv).

source: Install the pyenv [prerequisites](https://github.com/pyenv/pyenv/wiki/Common-build-problems) first, and then install pyenv:
es: Instale primero pyenv [prerrequisitos](https://github.com/pyenv/pyenv/wiki/Common-build-problems) y, a continuación, instale pyenv:
fr: Installez d'abord les [prérequis] de pyenv (https://github.com/pyenv/pyenv/wiki/Common-build-problems), puis installez pyenv :
ta: முதலில் PYENV [முன்நிபந்தனைகள்](https://github.com/pyenv/pyenv/wiki/common-build-problems) ஐ நிறுவவும், பின்னர் பியென்வை நிறுவவும்:
uk: Спочатку встановіть pyenv [передумови](https://github.com/pyenv/pyenv/wiki/Common-build-problems), а потім встановіть pyenv:

source: Make sure you follow the instruction at the end of the installation script to install the commands in your shell's rc file. Next install the latest version of Python by executing:
es: Asegúrese de seguir las instrucciones al final del script de instalación para instalar los comandos en el archivo rc de su shell. A continuación instale la última versión de Python ejecutando:
fr: Assurez-vous de suivre les instructions à la fin du script d'installation pour installer les commandes dans le fichier rc de votre shell. Installez ensuite la dernière version de Python en exécutant :
ta: உங்கள் செல்லின் ஆர்.சி கோப்பில் கட்டளைகளை நிறுவ நிறுவல் ச்கிரிப்டின் முடிவில் உள்ள வழிமுறைகளைப் பின்பற்றுவதை உறுதிசெய்க. அடுத்து இயக்குவதன் மூலம் பைத்தானின் அண்மைக் கால பதிப்பை நிறுவவும்:
uk: Переконайтеся, що ви дотримуєтесь інструкцій у кінці сценарію встановлення, щоб установити команди у файлі rc вашої оболонки. Далі встановіть останню версію Python, виконавши:

source: Where 3.x.x is replaced by the latest stable version of Python (pyenv should let you tab-complete available versions).
es: Donde 3.x.x se sustituye por la última versión estable de Python (pyenv debería permitirte completar por tabuladores las versiones disponibles).
fr: Où 3.x.x est remplacé par la dernière version stable de Python (pyenv devrait vous permettre de sélectionner les versions disponibles à l'aide de tabulations).
ta: பைதனின் அண்மைக் கால நிலையான பதிப்பால் 3.x.x மாற்றப்படுகிறது (பியென்வி உங்களுக்கு தாவல்-முழுமையான கிடைக்கக்கூடிய பதிப்புகளை அனுமதிக்க வேண்டும்).
uk: Де 3.x.x замінено останньою стабільною версією Python (pyenv має дозволити вам заповнювати доступні версії за допомогою вкладок).

source: Next install the Gaphor prerequisites by installing the gobject introspection and cairo build dependencies, for example, in Ubuntu execute:
es: A continuación, instale los requisitos previos de Gaphor instalando las dependencias de gobject introspection y cairo build, por ejemplo, en Ubuntu execute:
fr: Installez ensuite les prérequis de Gaphor en installant les dépendances gobject introspection et cairo build, par exemple, dans Ubuntu execute :
ta: அடுத்து கோபெக்ட் உள்நோக்கம் மற்றும் கெய்ரோ பில்ட் சார்புநிலைகளை நிறுவுவதன் மூலம் கஃபர் முன்நிபந்தனைகளை நிறுவவும், எடுத்துக்காட்டாக, உபுண்டு இயக்கத்தில்:
uk: Далі встановіть передумови Gaphor, встановивши залежності gobject introspection і cairo build, наприклад, у Ubuntu execute:

source: For Redhat/RPM/Fedora based systems:
fr: Pour les systèmes basés sur Redhat/RPM/Fedora :
ta: ரெட்ஆட்/ஆர்.பி.எம்/ஃபெடோரா அடிப்படையிலான அமைப்புகளுக்கு:
uk: Для систем на основі Redhat/RPM/Fedora:

source: Install [Poetry](https://python-poetry.org) using [pipx](https://pypa.github.io/pipx/):
es: Instale [Poetry](https://python-poetry.org) usando [pipx](https://pypa.github.io/pipx/):
fr: Installer [Poetry](https://python-poetry.org) en utilisant [pipx](https://pypa.github.io/pipx/) :
ta: [PIPX](https://pypa.github.io/pipx/) ஐப் பயன்படுத்தி [கவிதை](https://python-poetry.org) ஐ நிறுவவும்:
uk: Встановіть [Poetry](https://python-poetry.org) за допомогою [pipx](https://pypa.github.io/pipx/):

source: Next, [clone the repository](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository), after which you need to execute the following consecutive commands:
fr: Ensuite, [clonez le dépôt] (https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository), après quoi vous devez exécuter les commandes suivantes :
ta: அடுத்து, [களஞ்சியத்தை குளோன்](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository), அதன் பிறகு நீங்கள் பின்வரும் தொடர்ச்சியான கட்டளைகளை இயக்க வேண்டும்:
uk: Далі [клонуємо сховище](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository), після чого потрібно виконати наступні послідовні команди:

source: Now, you can run gaphor as
fr: Maintenant, vous pouvez exécuter gaphor en tant que
ta: இப்போது, நீங்கள் கஃபரை இயக்கலாம்
uk: Тепер ви можете запустити gaphor як

source: NOTE: Gaphor requires GTK 4. It works best with GTK >=4.8 and libadwaita >=1.2.
es: NOTA: Gaphor requiere GTK 4. Funciona mejor con GTK >=4.8 y libadwaita >=1.2.
fr: NOTE : Gaphor nécessite GTK 4. Il fonctionne mieux avec GTK >=4.8 et libadwaita >=1.2.
ta: குறிப்பு: Kaphor க்கு GTK 4 தேவைப்படுகிறது. இது GTK> = 4.8 மற்றும் லிபாட்வைட்டா> = 1.2 உடன் சிறப்பாக செயல்படுகிறது.
uk: ПРИМІТКА: Gaphor вимагає GTK 4. Він найкраще працює з GTK >=4.8 і libadwaita >=1.2.

source: Debugging using Visual Studio Code
es: Depuración con Visual Studio Code
fr: Débogage à l'aide de Visual Studio Code
ta: விசுவல் ச்டுடியோ குறியீட்டைப் பயன்படுத்தி பிழைத்திருத்தம்
uk: Налагодження за допомогою Visual Studio Code

source: Before you start debugging you'll need to open Gaphor in vscode (the folder containing `pyproject.toml`). You'll need to have the Python extension installed.
fr: Avant de commencer à déboguer, vous devez ouvrir Gaphor dans vscode (le dossier contenant `pyproject.toml`). Vous devez avoir installé l'extension Python.
ta: நீங்கள் பிழைத்திருத்தத்தைத் தொடங்குவதற்கு முன், நீங்கள் VSCODE (`pyproject.toml` கொண்ட கோப்புறை) VSCODE இல் Kaphor ஐத் திறக்க வேண்டும். பைதான் நீட்டிப்பு நிறுவப்பட்டிருக்க வேண்டும்.
uk: Перш ніж розпочати налагодження, вам потрібно відкрити Gaphor у vscode (тека, що містить `pyproject.toml`). Вам потрібно буде встановити розширення Python.

source: Create a file `.vscode/launch.json` with the following content:
fr: Créez un fichier `.vscode/launch.json` avec le contenu suivant :
ta: பின்வரும் உள்ளடக்கத்துடன் `.vscode/துவக்க. Json` கோப்பை உருவாக்கவும்:
uk: Створіть файл `.vscode/launch.json` з таким вмістом:

source: `GDK_BACKEND` is added since VSCode by default uses XWayland (the X11 emulator).
fr: `GDK_BACKEND` est ajouté car VSCode utilise par défaut XWayland (l'émulateur X11).
ta: `Gdk_backend` சேர்க்கப்படுகிறது, ஏனெனில் VSCODE இயல்பாக XWayland (X11 முன்மாதிரி) ஐப் பயன்படுத்துகிறது.
uk: `GDK_BACKEND` додано, оскільки VSCode за замовчуванням використовує XWayland (емулятор X11).

source: Create a Flatpak Package
es: Crear un paquete Flatpak
fr: Créer un paquet Flatpak
ta: ஒரு பிளாட்பாக் தொகுப்பை உருவாக்கவும்
uk: Створіть пакет Flatpak

source: The main method that Gaphor is packaged for Linux is with a Flatpak package. [Flatpak](https://flatpak.org) is a software utility for software deployment and package management for Linux. It offers a sandbox environment in which users can run application software in isolation from the rest of the system.
fr: La principale méthode de package de Gaphor pour Linux est un package Flatpak. [Flatpak](https://flatpak.org) est un utilitaire logiciel de déploiement de logiciels et de gestion de packages pour Linux. Il offre un environnement sandbox dans lequel les utilisateurs peuvent exécuter des logiciels d'application indépendamment du reste du système.
ta: லினக்சுக்கு காஃபர் தொகுக்கப்பட்டுள்ள முக்கிய முறை ஒரு பிளாட்பாக் தொகுப்புடன் உள்ளது. . இது ஒரு சாண்ட்பாக்ச் சூழலை வழங்குகிறது, இதில் பயனர்கள் பயன்பாட்டு மென்பொருளை கணினியின் மற்ற பகுதிகளிலிருந்து தனிமையில் இயக்க முடியும்.
uk: Основним способом пакування Gaphor для Linux є пакунок Flatpak. [Flatpak] (https://flatpak.org) - це програмна утиліта для розгортання програмного забезпечення та керування пакунками для Linux. Вона пропонує середовище пісочниці, в якому користувачі можуть запускати прикладне програмне забезпечення ізольовано від решти системи.

source: We distribute the official Flatpak using [Flathub](https://flathub.org), and building of the image is done at the [Gaphor Flathub repository](https://github.com/flathub/org.gaphor.Gaphor).
es: Distribuimos el Flatpak oficial usando [Flathub](https://flathub.org), y la construcción de la imagen se realiza en el [repositorio Gaphor Flathub](https://github.com/flathub/org.gaphor.Gaphor).
fr: Nous distribuons le Flatpak officiel en utilisant [Flathub](https://flathub.org), et la construction de l'image est effectuée dans le [dépôt Gaphor Flathub](https://github.com/flathub/org.gaphor.Gaphor).
ta: [பிளாதப்](https://flathub.org) ஐப் பயன்படுத்தி அதிகாரப்பூர்வ பிளாட்பேக்கை விநியோகிக்கிறோம், மேலும் படத்தை உருவாக்குவது [kaphor flathub களஞ்சியத்தில்](https://github.com/flathub/org.gaphor.gaphor) இல் செய்யப்படுகிறது .
uk: Ми розповсюджуємо офіційний Flatpak за допомогою [Flathub](https://flathub.org), а створення образу виконується в [репозиторії Gaphor Flathub](https://github.com/flathub/org.gaphor.Gaphor).

source: [Install Flatpak](https://flatpak.org/setup)
es: [Instalar Flatpak](https://flatpak.org/setup)
fr: [Installer Flatpak](https://flatpak.org/setup)
ta: [பிளாட்பேக்கை நிறுவவும்](https://flatpak.org/setup)
uk: [Встановіть Flatpak](https://flatpak.org/setup)

source: Install flatpak-builder
es: Instalar flatpak-builder
fr: Installer flatpak-builder
ta: பிளாட்பாக்-பில்டரை நிறுவவும்
uk: Встановити flatpak-builder

source: Install the GNOME SDK
es: Instalar el SDK de GNOME
fr: Installer le SDK GNOME
ta: க்னோம் SDK ஐ நிறுவவும்
uk: Встановіть GNOME SDK

source: Clone the Flathub repository and install the necessary SDK:
es: Clone el repositorio de Flathub e instale el SDK necesario:
fr: Clonez le dépot Flathub et installez le SDK nécessaire :
ta: பிளாட்டப் களஞ்சியத்தை நகலி செய்து தேவையான SDK ஐ நிறுவவும்:
uk: Клонуйте репозиторій Flathub і встановіть необхідний SDK:

source: Build Gaphor Flatpak
es: Construir Gaphor Flatpak
fr: Construire Gaphor Flatpak
ta: கஃபர் பிளாட்பாக் உருவாக்குங்கள்
uk: Збірка Gaphor Flatpak

source: Install the Flatpak
es: Instalar el Flatpak
fr: Installer le Flatpak
ta: பிளாட்பேக்கை நிறுவவும்
uk: Встановіть Flatpak

source: Linux Distribution Packages
es: Paquetes de distribución Linux
fr: Paquets de distribution Linux
ta: லினக்ச் விநியோக தொகுப்புகள்
uk: Дистрибутивні пакети Linux

source: Examples of Gaphor and Gaphas RPM spec files can be found in [PLD Linux](https://www.pld-linux.org/) [repository](https://github.com/pld-linux/):
es: Se pueden encontrar ejemplos de archivos de especificaciones RPM de Gaphor y Gaphas en [PLD Linux](https://www.pld-linux.org/) [repositorio](https://github.com/pld-linux/):
fr: Des exemples de fichiers de spécifications Gaphor et Gaphas RPM peuvent être trouvés dans [PLD Linux](https://www.pld-linux.org/) [dépôt](https://github.com/pld-linux/) :
ta: காஃபர் மற்றும் காஃபாச் ஆர்.பி.எம் ச்பெக் கோப்புகளின் எடுத்துக்காட்டுகளை [பி.எல்.டி லினக்ச்](https://www.pld-linux.org/) [களஞ்சியம்] (https://github.com/pld-linux/) இல் காணலாம்:
uk: Приклади файлів специфікацій Gaphor і Gaphas RPM можна знайти в [PLD Linux](https://www.pld-linux.org/) [репозиторій](https://github.com/pld-linux/):
