Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: Now, to develop with Gaphor, you will want to set it up with your development. If you want to work with `ipython`, install it below:
fr: Maintenant, pour développer avec Gaphor, vous allez devoir le configurer avec votre développement. Si vous voulez travailler avec `ipython`, installez-le ci-dessous :
ta: இப்போது, காஃபருடன் வளர, உங்கள் வளர்ச்சியுடன் அதை அமைக்க விரும்புவீர்கள். நீங்கள் `ஐபிதான்` உடன் வேலை செய்ய விரும்பினால், அதை கீழே நிறுவவும்:
uk: Тепер, щоб розвиватися за допомогою Gaphor, ви захочете налаштувати його за допомогою своєї розробки. Якщо ви хочете працювати з `ipython`, встановіть його нижче:

source: VSCode Tips
fr: Astuces VSCode
ta: Vscode உதவிக்குறிப்புகள்
uk: Поради VSCode

source: VSCode should work out-of-the box if it is already installed. Just set 'gaphor' as the kernel in your VSCode Profile or notebook.
fr: VSCode devrait fonctionner sans problème s'il est déjà installé. Il suffit de définir 'gaphor' comme noyau dans votre profil ou bloc-notes VSCode.
ta: ஏற்கனவே நிறுவப்பட்டிருந்தால் VSCODE பெட்டியில் வேலை செய்ய வேண்டும். உங்கள் vscode சுயவிவரம் அல்லது நோட்புக்கில் 'கஃபர்' ஐ கர்னலாக அமைக்கவும்.
uk: VSCode повинен працювати з коробки, якщо він уже встановлений. Просто встановіть «gaphor» як ядро у своєму профілі VSCode або блокноті.

source: Spyder Tips
fr: Astuces Spyder
ta: ச்பைடர் உதவிக்குறிப்புகள்
uk: Поради Spyder

source: You can install spyder in this environment using `conda install spyder`.
fr: Vous pouvez installer Spyder dans cet environnement en utilisant `conda install spyder`.
ta: `காண்டா நிறுவு ச்பைடர்` ஐப் பயன்படுத்தி இந்த சூழலில் ச்பைடரை நிறுவலாம்.
uk: Ви можете встановити spyder у цьому середовищі за допомогою `conda install spyder`.

source: If this does not work, (i.e., if `conda install spyder` reveals conflicts), you can instead use the following workaround:
fr: Si cela ne fonctionne pas (c'est-à-dire si `conda install spyder` révèle des conflits), vous pouvez utiliser la solution suivante :
ta: இது வேலை செய்யவில்லை என்றால், (அதாவது, `கான்டா ச்பைடரை நிறுவினால் மோதல்களை வெளிப்படுத்தினால்), அதற்கு பதிலாக பின்வரும் பணித்தொகுப்பைப் பயன்படுத்தலாம்:
uk: Якщо це не спрацює (тобто, якщо `conda install spyder` виявляє конфлікти), замість цього можна скористатися таким обхідним шляхом:

source: Then, in spyder, set 'gaphor' as your python interpreter
fr: Ensuite, dans Spyder, définissez 'gaphor' comme votre interpréteur python
ta: பின்னர், ச்பைடரில், உங்கள் பைதான் மொழிபெயர்ப்பாளராக 'கஃபர்' அமைக்கவும்
uk: Потім у spyder встановіть 'gaphor' як інтерпретатор Python

source: Install Gaphor
fr: Installer Gaphor
ta: கஃபரை நிறுவவும்
uk: Встановіть Gaphor

source: From a python console running within your new anaconda environment, you may then install Gaphor using pip:
fr: Depuis une console python fonctionnant dans votre nouvel environnement anaconda, vous pouvez alors installer Gaphor à l'aide de pip :
ta: உங்கள் புதிய அனகோண்டா சூழலுக்குள் இயங்கும் பைதான் கன்சோலில் இருந்து, நீங்கள் PIP ஐப் பயன்படுத்தி கஃபரை நிறுவலாம்:
uk: З консолі Python, яка працює у вашому новому середовищі anaconda, ви можете встановити Gaphor за допомогою pip:

source: Under the hood events are handled by the Generics library. For more information about how the Generic library handles events see the [Generic documentation](https://generic.readthedocs.io).
es: Bajo el capó los eventos son manejados por la librería Generic. Para obtener más información sobre cómo la biblioteca Generic gestiona los eventos, consulte la [documentación de Generic](https://generic.readthedocs.io).
uk: Події під капотом обробляються бібліотекою Generics. Щоб дізнатися більше про те, як загальна бібліотека обробляє події, перегляньте [загальну документацію](https://generic.readthedocs.io).

source: ``libgirepository1.0-dev`` is required to build PyGObject.
es: Se requiere ``libgirepository1.0-dev`` para compilar PyGObject.
fr: ``libgirepository1.0-dev`` est nécessaire pour construire PyGObject.
uk: Для створення PyGObject потрібен libgirepository1.0-dev.

source: ``node component``
es: ``componente nodo``
uk: ``компонент вузла``

source: ``node > component``
es: ``nodo > componente``
uk: ``вузол > компонент``

source: ``:empty``
fr: ``:empty`` (vide)
uk: ``:порожній``

source: ``:root``
fr: ``:root`` (racine)
uk: ``:корінь``

source: ``:first-child``
fr: ``:first-child`` (premier enfant)
uk: ``:перша дитина``

source: ``::after``
uk: ``::після``

source: `A Framework for Undoing Actions in Collaborative Systems <http://web.eecs.umich.edu/~aprakash/papers/undo-tochi94.pdf>`_
fr: `Un «Framework» pour l'annulation d'actions dans les Systèmes Collaboratifs <http://web.eecs.umich.edu/~aprakash/papers/undo-tochi94.pdf>`_
uk: `Фреймворк для скасування дій у системах спільної роботи <http://web.eecs.umich.edu/~aprakash/papers/undo-tochi94.pdf>`_

source: `Undoing Actions in Collaborative Work: Framework and Experience <https://www.eecs.umich.edu/techreports/cse/94/CSE-TR-196-94.pdf>`_
fr: `Défaire les actions dans le Travail Collaboratif : «Framework » et Expérience <https://www.eecs.umich.edu/techreports/cse/94/CSE-TR-196-94.pdf>`_
uk: `Відміна дій у спільній роботі: структура та досвід <https://www.eecs.umich.edu/techreports/cse/94/CSE-TR-196-94.pdf>`_

source: `Implementing a Selective Undo Framework in Python <https://legacy.python.org/workshops/1997-10/proceedings/zukowski.html>`_
fr: `Implémentation d'un «Framework » d'Annulation Sélective en Python <https://legacy.python.org/workshops/1997-10/proceedings/zukowski.html>`_
uk: `Реалізація селективної системи скасування в Python <https://legacy.python.org/workshops/1997-10/proceedings/zukowski.html>`_

source: where ``gaphor'' can be any name desired for the environment.
uk: де ``gaphor'' може бути будь-якою назвою, бажаною для середовища.

source: Under the hood events are handled by the Generics library. For more information about how the Generic library handles events see the `Generic documentation` <https://generic.readthedocs.io>`_.
fr: Sous le capot, les événements sont gérés par la bibliothèque Generics. Pour plus d'informations sur la façon dont la bibliothèque Generic gère les événements, voir la `documentation Generic <https://generic.readthedocs.io>`_.

source: undo_manager
es: gestor_deshacer
fr: (undo_manager) Gestionnaire d'annulation

source: file_manager
es: gestor_archivos
fr: file_manager (gestionnaire de fichier)

source: A ``Transaction`` object is created.
fr: Un objet ``Transaction`` est créé.

source: ``TransactionBegin`` event is emitted.
fr: L'événement ``TransactionBegin`` est émis.

source: The ``UndoManager`` instantiates a new ``ActionStack`` which is the transaction object, and adds the undo action to the stack.
fr: Le ``UndoManager`` instancie une nouvelle ``ActionStack`` qui est l'objet de la transaction, et ajoute l'action d'annulation à la pile.

source: A ``TransactionCommit`` event is emitted
fr: Un événement ``TransactionCommit`` (Enregistrement de la transaction) est émis

source: The ``UndoManager`` closes and stores the transaction.
fr: Le ``UndoManager`` (Gestionnaire d'annulation) ferme et enregistre la transaction.

source: A ``TransactionRollback`` event is emitted.
fr: Un ``TransactionRollback`` événement (Annulation de la transaction) est émis.

source: The ``UndoManager`` plays back all the recorded actions, but does not store it.
fr: Le ``UndoManager`` ( Gestionnaire d'annulation) lit toutes les actions enregistrées, mais ne les stocke pas.

source: The Event Manager.
es: El gestor de eventos.

source: Priority handlers are executed directly. They should not raise other events, cause that can cause a problem in the exection order.
es: Los manejadores de prioridad se ejecutan directamente. No deben lanzar otros eventos, porque eso puede causar un problema en el orden de ejecución.

source: It's basically to make sure that all events are recorded by the undo manager.
es: Es básicamente para asegurarse de que todos los eventos son registrados por el gestor de deshacer.

source: Handlers are triggered (executed) when specific events are emitted through the handle() method.
es: Los manejadores se accionan (ejecutan) cuando se emiten eventos específicos a través del método handle().

source: Select an element you want to place, in this case a Class (![new class](../gaphor/ui/icons/hicolor/scalable/actions/gaphor-class-symbolic.svg)) by clicking on the icon in the Toolbox and click on the diagram. This will place a new Class item instance on the diagram and add a new Class to the model -- it shows up in the Model Browser. The selected tool will reset itself to the Pointer tool after the element is placed on the diagram.
es: Seleccione un elemento que desee colocar, en este caso una Clase (![new class](../gaphor/ui/icons/hicolor/scalable/actions/gaphor-class-symbolic.svg)) haciendo clic en el icono en la Caja de herramientas y haga clic en el diagrama. Esto colocará una nueva instancia de elemento Clase en el diagrama y añadirá una Clase nueva al modelo -- se muestra en el Navegador de modelos. La herramienta seleccionada se restablecerá a la herramienta Puntero después de colocar el elemento en el diagrama.

source: newclass
es: clasenueva

source: The Property Editor on the right side will show you details about the newly added class, such as its name (_New Class_), attributes and operations (methods).
es: El Editor de propiedades de la derecha le mostrará detalles sobre la clase recién añadida, como su nombre (_Clase nueva_), atributos y operaciones (métodos).

source: ![image](images/first-model-class.png)
es: ![imagen](images/first-model-class.png)

source: image
es: imagen

source: Select Generalization (![new generalization](../gaphor/ui/icons/hicolor/scalable/actions/gaphor-generalization-symbolic.svg)).
es: Seleccione Generalización (![generalización nueva](../gaphor/ui/icons/hicolor/scalable/actions/gaphor-generalization-symbolic.svg)).

source: newgeneralization
es: generalizaciónnueva

source: ![image](images/first-model-generalization.png)
es: ![imagen](images/first-model-generalization.png)

source: Optionally you can run the auto-layout (![open menu](images/open-menu-symbolic.svg) → Tools → Auto Layout) to align the elements on the diagram.
es: Opcionalmente, puede ejecutar el diseño automático (![abrir menú](images/open-menu-symbolic.svg) → Herramientas → Diseño automático) para alinear los elementos en el diagrama.

source: openmenu
es: abrirmenú

source: To create a new diagram, use the Model Browser. Select the element that should contain the new diagram. For now, select _New Model_. Click the New Diagram menu (![new diagram](images/list-add-symbolic.svg)) in the header bar.
es: Para crear un diagrama nuevo, use el Navegador de modelos. Seleccione el elemento que debe contener el nuevo diagrama. Por ahora, seleccione _Modelo nuevo_. Haga clic en el menú Diagrama nuevo (![diagrama nuevo](images/list-add-symbolic.svg)) en la barra de cabecera.

source: new diagram
es: diagrama nuevo

source: ![image](/images/first-model-new-diagram-popup.png)
es: ![imagen](/images/first-model-new-diagram-popup.png)

source: Parts of Gaphor communicate with each other through events. Whenever something important happens, for example, an attribute of a model element changes, an event is sent. When other parts of the application are interested in a change, they register an event handler for that event type. Events are emitted though a central broker so you do not have to register on every individual element that can send an event they are interested in. For example, a diagram item could register an event rule and then check if the element that sent the event is actually the event the item is representing. For more information see the full description of the [event system](event_system.md).
es: Las partes de Gaphor se comunican entre sí mediante eventos. Cada vez que algo importante sucede, por ejemplo, un atributo de un elemento del modelo cambia, se envía un evento. Cuando otras partes de la aplicación están interesadas en un cambio, registran un controlador de eventos para ese tipo de evento. Los eventos se emiten a través de un intermediario central, por lo que no es necesario registrarse en cada elemento individual que pueda enviar un evento en el que estén interesados. Por ejemplo, un elemento de diagrama podría registrar una regla de evento y luego comprobar si el elemento que envió el evento es realmente el evento que el elemento está representando. Para más información, consulte la descripción completa del [sistema de eventos](event_system.md).

source: Gaphor is [transactional](transaction.md), which means it keeps track of the functions it performs as a series of transactions. The transactions work by sending an event when a transaction starts and sending another when a transaction ends. This allows, for example, the undo manager to keep a running log of the previous transactions so that a transaction can be reversed if the undo button is pressed.
es: Gaphor es [transaccional](transaction.md), lo que significa que mantiene un registro de las funciones que realiza como una serie de transacciones. Las transacciones funcionan enviando un evento cuando una transacción comienza y enviando otro cuando una transacción termina. Esto permite, por ejemplo, que el gestor de deshacer mantenga un registro de las transacciones anteriores para que una transacción pueda ser revertida si se pulsa el botón de deshacer.

source: The [data model](models/core.md) itself is maintained in the element factory (`gaphor.core.modeling.elementfactory`). This service is used to create model elements, as well as to lookup elements or query for a set of elements.
es: El propio [modelo de datos](models/core.md) se mantiene en la fábrica de elementos (`gaphor.core.modeling.elementfactory`). Este servicio se usa para crear elementos del modelo, así como para buscar elementos o consultar un conjunto de elementos.

source: The undo manager is transactional. Actions performed by a user are only stored if a transaction is active. If a transaction is completed (committed) a new undo action is stored. Transactions can also be rolled back, in which case all changes are played back directly. For more information see the full description of the [undo manager](undo.md).
es: El gestor de deshacer es transaccional. Las acciones realizadas por un usuario sólo se almacenan si hay una transacción activa. Si se completa una transacción (confirmada) se almacena una acción nueva de deshacer. Las transacciones también pueden revertirse, en cuyo caso todos los cambios se reproducen directamente. Para más información consulte la descripción completa del [gestor de deshacer](undo.md).

source: In this example we're doing something a little less trivial. In Gaphor, services are defined as entry points. Each service is a class, and takes parameters with names that match other services. This allows services to depend on other services.
es: En este ejemplo estamos haciendo algo un poco menos trivial. En Gaphor, los servicios se definen como puntos de entrada. Cada servicio es una clase, y toma parámetros con nombres que coinciden con otros servicios. Esto permite que los servicios dependan de otros servicios.

source: You can find installers for Gaphor on the [Gaphor Website](https://gaphor.org/download). Gaphor can be installed on Linux (Flatpak, AppImage), Windows, and macOS.
es: Puede encontrar instaladores para Gaphor en el [sitio web de Gaphor](https://gaphor.org/download). Gaphor puede instalarse en Linux (Flatpak, AppImage), Windows y macOS.

source: ![welcome screen](images/getting-started-greeter.png)
es: ![pantalla de bienvenida](images/getting-started-greeter.png)

source: welcome screen
es: pantalla de bienvenida

source: **C4 Model:** A template for *Context, Containers, Components, and Code* which for lean modeling of software architecture
es: **Modelo C4:** Una plantilla para *Contexto, Contenedores, Componentes y Código* que para el modelado lean de la arquitectura de software

source: ![new model](images/getting-started-new-model.png)
es: ![modelo nuevo](images/getting-started-new-model.png)

source: new model
es: modelo nuevo

source: Relations are line-like elements that form relationships between elements in the diagram. Each end of a relation is in one of two states:
es: Las relaciones son elementos en forma de línea que forman relaciones entre los elementos del diagrama. Cada extremo de una relación se encuentra en uno de dos estados:

source: The Property Editor is present on the right side of the diagrams. When no item is selected in the diagram, it shows you some tips and tricks. When an item is selected on the diagram, it contains the item details like name, attributes and stereotypes. It can be opened with <kbd>F9</kbd> and the ![sidebar-show-right-symbolic](images/sidebar-show-right-symbolic.svg) icon in the header bar.
es: El Editor de Propiedades está presente en la parte derecha de los diagramas. Cuando no hay ningún elemento seleccionado en el diagrama, le muestra algunos consejos y trucos. Cuando se selecciona un elemento en el diagrama, contiene los detalles del elemento como nombre, atributos y estereotipos. Puede abrirse con <kbd>F9</kbd> y el icono ![sidebar-show-right-symbolic](images/sidebar-show-right-symbolic.svg) de la barra de cabecera.

source: The Property Editor also contains model preferences: Click the ![document-properties-symbolic](images/document-properties-symbolic.svg) button. Here you can set a few model related settings and edit the [style sheet](style_sheets).
es: El Editor de propiedades también contiene las preferencias del modelo: Haga clic en el botón ![document-properties-symbolic](images/document-properties-symbolic.svg). Aquí puede establecer algunos ajustes relacionados con el modelo y editar la [style sheet](style_sheets).

source: Installation
es: Instalación

source: Gaphor is 100% Open source. The code and issue tracker can be found on `GitHub <https://github.com/gaphor/gaphor>`_.
es: Gaphor es 100% de código abierto. El código y el gestor de incidencias se encuentran en `GitHub <https://github.com/gaphor/gaphor>`_.

source: Gaphor has excellent integration with :doc:`Sphinx <sphinx>` and :doc:`Jupyter notebooks <scripting>`.
es: Gaphor tiene una excelente integración con :doc:`Sphinx <sphinx>` y :doc:`Jupyter notebooks <scripting>`.

source: Gaphor can be installed as Flatpak and AppImage on Linux, some distributions provide packages. Check out the [Gaphor download page](https://gaphor.org/download#linux) for details.
es: Gaphor se puede instalar como Flatpak y AppImage en Linux, algunas distribuciones proporcionan paquetes. Consulte la [página de descarga de Gaphor](https://gaphor.org/download#linux) para más detalles.

source: [Clone the repository](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository).
es: [Clonar el repositorio](https://help.github.com/en/github/creating-cloning-and-archiving-repositories/cloning-a-repository).

source: The main method that Gaphor is packaged for Linux is with a Flatpak package. [Flatpak](https://flatpak.org) is a software utility for software deployment and package management for Linux. It offer a sandbox environment in which users can run application software in isolation from the rest of the system.
es: El principal método de empaquetado de Gaphor para Linux es con un paquete Flatpak. [Flatpak](https://flatpak.org) es una utilidad de software para el despliegue de software y la gestión de paquetes para Linux. Ofrece un entorno de aislamiento en el que los usuarios pueden ejecutar software de aplicación aislado del resto del sistema.

source: Create an AppImage Package
es: Crear un paquete AppImage

source: [AppImage](https://appimage.org/) is a format for distributing portable software on Linux without needing superuser permissions to install the application. The AppImage file is one executable which contains both Gaphor and Python. It allows Gaphor to be run on any AppImage supported platform without installation or root access.
es: [AppImage](https://appimage.org/) es un formato para distribuir software portable en Linux sin necesidad de permisos de superusuario para instalar la aplicación. El archivo AppImage es un ejecutable que contiene tanto Gaphor como Python. Permite ejecutar Gaphor en cualquier plataforma compatible con AppImage sin necesidad de instalación o acceso de root.

source: We build our AppImage by first bundling Gaphor with PyInstaller and then converting it in to an AppImage.
es: Construimos nuestra AppImage primero empaquetando Gaphor con PyInstaller y luego convirtiéndolo en una AppImage.

source: In order for the built AppImage to be compatible with older versions of Linux, we build the release versions using Docker with an older LTS version of Ubuntu.
es: Para que la AppImage construida sea compatible con versiones antiguas de Linux, construimos las versiones de lanzamiento usando Docker con una versión LTS antigua de Ubuntu.

source: To setup a development environment with macOS:
es: Para configurar un entorno de desarrollo con macOS:

source: If PyGObject does not compile and complains about a missing `ffi.h` file, set the following environment variable and run `poetry install` again:
es: Si PyGObject no compila y se queja de que falta el archivo `ffi.h`, establezca la siguiente variable de entorno y ejecute `poetry install` de nuevo:

source: From Gaphor 2.18 onwards Gaphor is also capable of merging models. Once a merge conflict has been detected, Gaphor will offer the option to open the current model, the incoming model or merge changes manually via the Merge Editor.
es: A partir de Gaphor 2.18, Gaphor también es capaz de fusionar modelos. Una vez detectado un conflicto de fusión, Gaphor ofrecerá la opción de abrir el modelo actual, el modelo entrante o fusionar los cambios manualmente a través del Editor de fusión.

source: ![merge dialog](images/merge-dialog.png)
es: ![diálogo de fusión](images/merge-dialog.png)

source: merge dialog
es: diálogo de fusión

source: merge conflict window
es: Ventana de fusionar conflictos

source: A modeling language in Gaphor is defined by a class implementing the `gaphor.abc.ModelingLanguage` abstract base class. The modeling language should be registered as a `gaphor.modelinglanguage` entry point.
es: Un lenguaje de modelado en Gaphor se define por una clase que implementa la clase base abstracta `gaphor.abc.ModelingLanguage`. El lenguaje de modelado debe ser registrado como un punto de entrada `gaphor.modelinglanguage`.

source: The first three by functionalities are exposed by the `ModelingLanguage` class. The other functionalities can be extended by adding handlers to the respective generic functions.
es: Las tres primeras funcionalidades están expuestas por la clase `ModelingLanguage`. Las otras funcionalidades pueden ampliarse añadiendo manejadores a las respectivas funciones genéricas.

source: Modeling languages can also provide new UI components. Those components are not loaded directly when you import a modeling language package. Instead they should be imported via the `gaphor.modules` entrypoint.
es: Los lenguajes de modelado también pueden proporcionar nuevos componentes de interfaz de usuario. Estos componentes no se cargan directamente al importar un paquete de lenguaje de modelado. En su lugar, deben importarse a través del punto de entrada `gaphor.modules`.

source: [Editor pages](#editor-property-pages), shown in the collapsible pane on the right side
es: [Páginas del editor](#editor-property-pages), que se muestran en el panel desplegable de la derecha

source: The following methods are required to make this work:
es: Para que esto funcione se necesitan los siguientes métodos:
