Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: As they worked, the ants encountered numerous challenges. They had to ensure that the machine was safe, efficient, and easy to use, all while meeting the unique needs of their feline client. But with their deep understanding of systems engineering and their commitment to key principles and concepts, they were able to overcome these challenges and design an exceptional espresso machine.
fr: Au cours de leur travail, les fourmis ont dû relever de nombreux défis. Elles devaient s'assurer que la machine était sûre, efficace et facile à utiliser, tout en répondant aux besoins spécifiques de leur clientèle féline. Mais grâce à leur connaissance approfondie de l'ingénierie des systèmes et à leur engagement à respecter les principes et les concepts clés, elles ont pu surmonter ces difficultés et concevoir une machine à espresso d'exception.
ta: அவர்கள் பணிபுரிந்தபோது, எறும்புகள் பல சவால்களை எதிர்கொண்டன. இயந்திரம் தங்கள் பூனை வாடிக்கையாளரின் தனித்துவமான தேவைகளைப் நிறைவு செய்யும் போது, இயந்திரம் பாதுகாப்பானது, திறமையானது மற்றும் பயன்படுத்த எளிதானது என்பதை அவர்கள் உறுதிப்படுத்த வேண்டியிருந்தது. ஆனால் சிச்டம்ச் இன்சினியரிங் பற்றிய அவர்களின் ஆழ்ந்த புரிதலுடனும், முக்கிய கொள்கைகள் மற்றும் கருத்துக்களுக்கான அவர்களின் அர்ப்பணிப்புடனும், அவர்கள் இந்த சவால்களை சமாளித்து விதிவிலக்கான எச்பிரெசோ இயந்திரத்தை வடிவமைக்க முடிந்தது.
uk: Під час роботи мурахи зіткнулися з численними проблемами. Вони повинні були забезпечити безпеку, ефективність і простоту використання кавомашини, і при цьому задовольнити унікальні потреби їхнього котячого клієнта. Але завдяки глибокому розумінню системної інженерії та відданості ключовим принципам і концепціям, вони змогли подолати ці виклики і розробити виняткову еспресо-машину.

source: In the end, Cappuccino was thrilled with the machine, which worked flawlessly and was a big hit with his customers. He was so impressed with the ants' work that he offered them a long-term contract to design all of his café's systems. The ants were proud of their success, knowing that it was all thanks to their expertise and deep understanding of systems engineering principles. They had proven that, with the right tools and approach, anything is possible.
fr: Au final, Cappuccino a été ravi de la machine, qui a parfaitement fonctionné et a remporté un vif succès auprès de ses clients. Il a été tellement impressionné par leur travail qu'il leur a proposé un contrat à long terme pour concevoir l'ensemble des systèmes de son café. Les fourmis étaient fières de leur succès, car elles savent que tout cela est dû à leur expertise et à leur profonde compréhension des principes de l'ingénierie des systèmes. Elles avaient prouvé qu'avec les bons outils et la bonne approche, tout était possible.
ta: முடிவில், கப்புசினோ இயந்திரத்தால் மகிழ்ச்சியடைந்தார், இது குறைபாடற்ற முறையில் வேலை செய்தது மற்றும் அவரது வாடிக்கையாளர்களுடன் ஒரு பெரிய வெற்றியைப் பெற்றது. எறும்புகளின் வேலையில் அவர் மிகவும் ஈர்க்கப்பட்டார், அவர் தனது கபே அமைப்புகள் அனைத்தையும் வடிவமைக்க ஒரு நீண்டகால ஒப்பந்தத்தை அவர்களுக்கு வழங்கினார். எறும்புகள் அவர்களின் வெற்றியைப் பற்றி பெருமிதம் கொண்டன, இது அவர்களின் நிபுணத்துவம் மற்றும் அமைப்புகள் பொறியியல் கொள்கைகளைப் பற்றிய ஆழமான புரிதலுக்கு நன்றி என்பதை அறிந்திருந்தது. சரியான கருவிகள் மற்றும் அணுகுமுறையுடன், எதுவும் சாத்தியமாகும் என்பதை அவர்கள் நிரூபித்தனர்.
uk: Зрештою, Капучіно був у захваті від машини, яка працювала бездоганно і користувалася великим успіхом у його клієнтів. Він був настільки вражений роботою мурах, що запропонував їм довгостроковий контракт на проектування всіх систем свого кафе. Мурахи пишалися своїм успіхом, знаючи, що все це завдяки їхньому досвіду і глибокому розумінню принципів системної інженерії. Вони довели, що з правильними інструментами та підходом можливо все.

source: Connection Protocol
es: Protocolo de conexión
fr: Protocole de connexion
ta: இணைப்பு நெறிமுறை
uk: Протокол підключення

source: In Gaphor, if a connection is made on a diagram between an element and a relationship, the connection is also made at semantic level (the model). From a GUI point of view, a button release event is what kicks of the decision whether the connection is allowed.
es: En Gaphor, si se establece una conexión en un diagrama entre un elemento y una relación, la conexión también se establece a nivel semántico (el modelo). Desde el punto de vista de la interfaz gráfica de usuario, un evento de liberación de un botón es lo que da el pistoletazo de salida a la decisión de si se permite la conexión.
fr: Dans Gaphor, lorsqu'une connexion est établie entre un élément et une relation sur un diagramme, la connexion est également établie au niveau sémantique, c'est-à-dire dans le modèle. C'est l'événement de relâchement d'un bouton qui, du point de vue de l'interface graphique, déclenche la décision d'autoriser ou non la connexion.
ta: கஃபரில், ஒரு உறுப்பு மற்றும் உறவுக்கு இடையில் ஒரு வரைபடத்தில் ஒரு இணைப்பு செய்யப்பட்டால், இணைப்பு சொற்பொருள் மட்டத்திலும் (மாதிரி) செய்யப்படுகிறது. ஒரு GUI பார்வையில், ஒரு பொத்தான் வெளியீட்டு நிகழ்வு என்பது இணைப்பு அனுமதிக்கப்படுகிறதா என்பதை முடிவின் உதைக்கிறது.
uk: У Gaphor, якщо зв'язок встановлюється на діаграмі між елементом і зв'язком, зв'язок також встановлюється на семантичному рівні (модель). З точки зору графічного інтерфейсу, подія відпускання кнопки - це те, що дає старт рішенню про те, чи дозволено з'єднання.

source: The check if a connection is allowed should also check if it is valid to create a relation to/from the same element (like associations, but not generalizations).
es: La comprobación de si se permite una conexión también debería comprobar si es válido crear una relación hacia/desde el mismo elemento (como las asociaciones, pero no las generalizaciones).
fr: La vérification de l'autorisation d'une connexion devrait également porter sur la validité de la création d'une relation vers/à partir du même élément (comme les associations, mais pas les généralisations).
ta: ஒரு இணைப்பு அனுமதிக்கப்பட்டால், அதே உறுப்புடன்/இருந்து ஒரு உறவை உருவாக்குவது செல்லுபடியாகும் என்பதை சரிபார்க்க வேண்டும் (சங்கங்கள் போன்றவை, ஆனால் பொதுமைப்படுத்தல்கள் அல்ல).
uk: Перевірка дозволеного з’єднання також повинна перевіряти, чи можна створити зв’язок до/з того самого елемента (як асоціації, але не узагальнення).

source: Gaphor in a Container
es: Gaphor en un contenedor
fr: Gaphor dans un conteneur
ta: ஒரு கொள்கலனில் கஃபர்
uk: Gaphor в контейнері

source: Instead of setting up a development environment locally, the easiest way to contribute to the project is using GitHub Codespaces.
es: En lugar de crear un entorno de desarrollo local, la forma más sencilla de contribuir al proyecto es usar GitHub Codespaces.
fr: Au lieu de mettre en place un environnement de développement local, la manière la plus simple de contribuer au projet est d'utiliser les Codespaces de GitHub.
ta: உள்நாட்டில் ஒரு மேம்பாட்டு சூழலை அமைப்பதற்கு பதிலாக, திட்டத்திற்கு பங்களிப்பதற்கான எளிதான வழி அறிவிலிமையம் குறியீட்டு இடங்களைப் பயன்படுத்துகிறது.
uk: Замість того, щоб налаштовувати середовище розробки локально, найпростіший спосіб внести свій внесок у проект — використовувати GitHub Codespaces.

source: GitHub Codespaces
fr: Espaces de code GitHub
ta: அறிவிலிமையம் குறியீட்டு இடங்கள்
uk: Кодові простори GitHub

source: Follow these steps to open Gaphor in a Codespace:
es: Siga estos pasos para abrir Gaphor en un Codespace:
fr: Procédez comme suit pour ouvrir Gaphor dans un espace de codage :
ta: கோட்ச்பேசில் கஃபரைத் திறக்க இந்த படிகளைப் பின்பற்றவும்:
uk: Щоб відкрити Gaphor у кодовому просторі, виконайте такі дії:

source: Navigate to https://github.com/gaphor/gaphor
es: Navegar hasta https://github.com/gaphor/gaphor
fr: Naviguez vers https://github.com/gaphor/gaphor
ta: Https://github.com/gaphor/gaphor க்கு செல்லவும்
uk: Перейдіть до https://github.com/gaphor/gaphor

source: Click the Code drop-down menu and select the **Open with Codespaces** option.
es: Haga clic en el menú desplegable Código y seleccione la opción **Abrir con Codespaces**.
fr: Cliquez sur le menu déroulant Code et sélectionnez l'option **Open with Codespaces**.
ta: குறியீடு கீழ்தோன்றும் மெனுவைக் சொடுக்கு செய்து, கோட்ச்பேச் ** விருப்பத்துடன் ** திறந்து என்பதைத் தேர்ந்தெடுக்கவும்.
uk: Натисніть спадне меню «Код» і виберіть параметр **Відкрити за допомогою кодових просторів**.

source: Select **+ New codespace** at the bottom on the pane.
es: Seleccione **+ Codespace nuevo** en la parte inferior del panel.
fr: Sélectionnez **+ New codespace** en bas du volet.
ta: பலகத்தில் கீழே **+ புதிய கோட்ச்பேச் ** ஐத் தேர்ந்தெடுக்கவும்.
uk: Виберіть **+ Новий кодовий простір** у нижній частині панелі.

source: For more info, check out the [GitHub documentation](https://docs.github.com/en/free-pro-team@latest/github/developing-online-with-codespaces/creating-a-codespace#creating-a-codespace).
es: Para más información, consulte la [documentación de GitHub](https://docs.github.com/es/free-pro-team@latest/github/developing-online-with-codespaces/creating-a-codespace#creating-a-codespace).
fr: Pour plus d'informations, consultez la [documentation GitHub] (https://docs.github.com/en/free-pro-team@latest/github/developing-online-with-codespaces/creating-a-codespace#creating-a-codespace).
ta: மேலும் தகவலுக்கு, [அறிவிலிமையம் ஆவணம்](https://docs.github.com/en/free-pro-team@latest/github/developing-online-with-codespaces/creating-a-codespace#creating-a-codespace) ஐப் பாருங்கள்.
uk: Щоб дізнатися більше, перегляньте [документацію GitHub](https://docs.github.com/en/free-pro-team@latest/github/developing-online-with-codespaces/creating-a-codespace#creating-a-codespace).

source: Remote access to Gaphor graphic window with Codespaces
fr: Accès à distance à la fenêtre graphique de Gaphor avec Codespaces
ta: கோட்ச்பேச்களுடன் கஃபர் கிராஃபிக் சாளரத்திற்கான தொலைநிலை அணுகல்
uk: Віддалений доступ до графічного вікна Gaphor за допомогою Codespaces

source: When using Codespaces, chances are that you also want to interact with the graphical window of Gaphor.
fr: Lorsque vous utilisez les Codespaces, il est probable que vous souhaitiez également interagir avec la fenêtre graphique de Gaphor.
ta: கோட்ச்பேச்களைப் பயன்படுத்தும் போது, நீங்கள் கஃபோரின் வரைகலை சாளரத்துடன் தொடர்பு கொள்ள விரும்புவதற்கான வாய்ப்புகள் உள்ளன.
uk: Використовуючи Codespaces, є ймовірність, що ви також захочете взаємодіяти з графічним вікном Gaphor.

source: This is facilitated in Gaphor by use of container feature called [desktop-lite](https://github.com/devcontainers/features/tree/main/src/desktop-lite). This feature is activated by default in the Gaphor's [devcontainer.json](https://github.com/gaphor/gaphor/blob/main/.devcontainer/devcontainer.json) file.
fr: Cette opération est facilitée dans Gaphor par l'utilisation d'un conteneur appelé [desktop-lite] (https://github.com/devcontainers/features/tree/main/src/desktop-lite). Cette fonctionnalité est activée par défaut dans le fichier [devcontainer.json] (https://github.com/gaphor/gaphor/blob/main/.devcontainer/devcontainer.json) de Gaphor.
ta: [டெச்க்டாப்-லைட்](https://github.com/devcontainers/features/tree/main/src/desktop-lite) எனப்படும் கொள்கலன் அம்சத்தைப் பயன்படுத்துவதன் மூலம் இது காஃபரில் எளிதாக்கப்படுகிறது. இந்த நற்பொருத்தம் முன்னிருப்பாக Kaphor இன் [devcontainer.json](https://github.com/gaphor/gaphor/blob/main/.devcontainer/devcontainer.json) கோப்பில் செயல்படுத்தப்படுகிறது.
uk: У Gaphor це полегшено завдяки використанню функції контейнера під назвою [desktop-lite](https://github.com/devcontainers/features/tree/main/src/desktop-lite). За замовчуванням ця можливість активована у файлі [devcontainer.json](https://github.com/gaphor/gaphor/blob/main/.devcontainer/devcontainer.json) Gaphor.

source: Notice the webPort/vncPort and password values. These are used in subsequent steps.
fr: Notez les valeurs webPort/vncPort et mot de passe. Elles seront utilisées dans les étapes suivantes.
ta: வெபோர்ட்/விஎன்க்போர்ட் மற்றும் கடவுச்சொல் மதிப்புகளைக் கவனியுங்கள். இவை அடுத்தடுத்த படிகளில் பயன்படுத்தப்படுகின்றன.
uk: Зверніть увагу на значення webPort/vncPort і пароль. Вони використовуються на наступних етапах.

source: There are two options:
fr: Deux options sont possibles :
ta: இரண்டு விருப்பங்கள் உள்ளன:
uk: Є два варіанти:

source: Using a local VNC viewer
fr: Utilisation d'une visionneuse VNC locale
ta: உள்ளக வி.என்.சி பார்வையாளரைப் பயன்படுத்துதல்
uk: Використання локального засобу перегляду VNC

source: Download and install VNC viewer of your choice (e.g. realvnc)
fr: Téléchargez et installez la visionneuse VNC de votre choix (par exemple, realvnc)
ta: உங்கள் விருப்பப்படி VNC பார்வையாளரைப் பதிவிறக்கி நிறுவவும் (எ.கா. ரியல்.வி.என்.சி)
uk: Завантажте та встановіть програму перегляду VNC на ваш вибір (наприклад, realvnc)

source: Specify remote hostname as *localhost* and port as *5901* and connect VNC. The port number should be same as specified in attribute *vncPort*
fr: Spécifiez le nom de l'hôte distant comme *localhost* et le port comme *5901* et connectez-vous à VNC. Le numéro de port doit être le même que celui spécifié dans l'attribut *vncPort*
ta: தொலை ஓச்ட்பெயரை * உள்ளக புரவலன் * மற்றும் போர்ட்டை * 5901 * எனக் குறிப்பிடவும், VNC ஐ இணைக்கவும். துறைமுகம் எண் பண்புக்கூறு *vncport *இல் குறிப்பிடப்பட்டுள்ளதைப் போலவே இருக்க வேண்டும்
uk: Вкажіть ім’я віддаленого хоста як *localhost* і порт як *5901* і підключіть VNC. Номер порту має бути таким же, як указано в атрибуті *vncPort*

source: Upon [debugging/running](https://github.com/gaphor/gaphor/blob/main/.devcontainer/devcontainer.json) Gaphor the familiar Graphic window should be displayed in VNC view
fr: Lors du [débogage/exécution](https://github.com/gaphor/gaphor/blob/main/.devcontainer/devcontainer.json) Gaphor, la fenêtre graphique familière devrait s'afficher dans la vue VNC
ta: [பிழைத்திருத்தம்/இயங்கும்]
uk: Після [налагодження/запуску](https://github.com/gaphor/gaphor/blob/main/.devcontainer/devcontainer.json) Gaphor має відображатися знайоме графічне вікно у поданні VNC

source: Using noVNC viewer on the Browser
fr: Utilisation de la visionneuse noVNC sur le navigateur
ta: உலாவியில் நவம்பர் பார்வையாளரைப் பயன்படுத்துதல்
uk: Використання програми перегляду noVNC у браузері

source: This is based on [noVNC](https://novnc.com/info.html) application
fr: Ceci est basé sur l'application [noVNC](https://novnc.com/info.html)
ta: இது [novnc](https://novnc.com/info.html) பயன்பாட்டை அடிப்படையாகக் கொண்டது
uk: Це базується на програмі [noVNC](https://novnc.com/info.html)

source: Open the browser on your local machine and give address as *http://127.0.0.1:6080/*. The port number should be same as specified in attribute *webPort*
fr: Ouvrez le navigateur sur votre machine locale et donnez l'adresse *http://127.0.0.1:6080/*. Le numéro de port doit être le même que celui spécifié dans l'attribut *webPort*
ta: உங்கள் உள்ளக கணினியில் உலாவியைத் திறந்து முகவரியை *http: //127.0.0.1: 6080/ *எனக் கொடுங்கள். துறைமுகம் எண் பண்புக்கூறு *வெபோர்ட் *இல் குறிப்பிடப்பட்டுள்ளதைப் போலவே இருக்க வேண்டும்
uk: Відкрийте браузер на локальному комп’ютері та введіть адресу *http://127.0.0.1:6080/*. Номер порту має бути таким же, як указано в атрибуті *webPort*

source: A noVNC window will open, click on Connect and provide password as *vscode*. The password should be same as specified in attribute *password*
fr: Une fenêtre noVNC s'ouvre, cliquez sur Connect et fournissez le mot de passe *vscode*. Le mot de passe doit être le même que celui spécifié dans l'attribut *password*
ta: ஒரு நவம்பர் சாளரம் திறந்து, இணைப்பைக் சொடுக்கு செய்து கடவுச்சொல்லை *vscode *என வழங்கவும். கடவுச்சொல் பண்புக்கூறு *கடவுச்சொல் *இல் குறிப்பிடப்பட்டுள்ளதைப் போலவே இருக்க வேண்டும்
uk: Відкриється вікно noVNC, натисніть «Підключитися» та введіть пароль як *vscode*. Пароль має бути таким же, як указано в атрибуті *password*

source: Upon [debugging/running](https://github.com/gaphor/gaphor/blob/main/.devcontainer/devcontainer.json) Gaphor the familiar Graphic window should be displayed in noVNC view on Browser
fr: Lors du [débogage/exécution] (https://github.com/gaphor/gaphor/blob/main/.devcontainer/devcontainer.json) Gaphor, la fenêtre graphique familière devrait être affichée dans la vue noVNC sur le navigateur
ta: [பிழைத்திருத்ததின்/இயங்கத்தின்](https://github.com/gaphor/gaphor/blob/main/.devcontainer/devcontainer.json)போது காஃபோர் எனப்படும் பழக்கமான கிராஃபிக் சாளரம் உலாவியில் noVNC காட்சியில் காட்டப்பட வேண்டும்
uk: Після [налагодження/запуску](https://github.com/gaphor/gaphor/blob/main/.devcontainer/devcontainer.json) Gaphor знайоме графічне вікно має відображатися у перегляді noVNC у браузері

source: Contribute to Gaphor
fr: Contribuer à Gaphor
ta: கஃபருக்கு பங்களிப்பு செய்யுங்கள்
uk: Зробити внесок у Gaphor

source: Would you like to contribute to the development of Gaphor? If you think this is only something for experienced developers, please reconsider, there are plenty of ways to contribute to Gaphor, no matter your level of experience or skill set.
fr: Vous souhaitez contribuer au développement de Gaphor ? Si vous pensez que cela est réservé aux développeurs expérimentés, n'hésitez pas, il y a de nombreuses façons de contribuer à Gaphor, quel que soit votre niveau d'expérience ou de compétence.
ta: கஃபரின் வளர்ச்சிக்கு பங்களிக்க விரும்புகிறீர்களா? பட்டறிவு வாய்ந்த டெவலப்பர்களுக்கு இது ஒன்று என்று நீங்கள் நினைத்தால், தயவுசெய்து மறுபரிசீலனை செய்யுங்கள், உங்கள் அனுபவத்தின் நிலை அல்லது திறன் தொகுப்பைப் பொருட்படுத்தாமல், காஃபருக்கு பங்களிக்க ஏராளமான வழிகள் உள்ளன.
uk: Бажаєте зробити свій внесок у розвиток Gaphor? Якщо ви думаєте, що це тільки для досвідчених розробників, будь ласка, перегляньте свою думку, є багато способів зробити свій внесок у Gaphor, незалежно від вашого рівня досвіду або набору навичок.

source: You can help to support Gaphor in your language. You can do that on [Weblate](https://hosted.weblate.org/engage/gaphor/), directly from your browser. This service will periodically create [Pull Requests](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/about-pull-requests) for Gaphor with updated translations.
fr: Vous pouvez aider à soutenir Gaphor dans votre langue. Vous pouvez le faire sur [Weblate](https://hosted.weblate.org/engage/gaphor/), directement depuis votre navigateur. Ce service créera périodiquement des [Pull Requests](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/about-pull-requests) pour Gaphor avec des traductions mises à jour.
ta: உங்கள் மொழியில் கஃபரை ஆதரிக்க நீங்கள் உதவலாம். உங்கள் உலாவியில் இருந்து நேரடியாக [வெப்லேட்](https://hosted.weblate.org/engage/gaphor/) இல் இதைச் செய்யலாம். இந்த பணி அவ்வப்போது [புல் கோரிக்கைகளை உருவாக்கும்](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/about-pull-requests) புதுப்பிக்கப்பட்ட மொழிபெயர்ப்புகளுடன் KAPHOR க்கு) பற்றி-புல் கோரிக்கைகள்).
uk: Ви можете допомогти підтримати Gaphor своєю мовою. Ви можете зробити це на [Weblate](https://hosted.weblate.org/engage/gaphor/), безпосередньо з вашого браузера. Цей сервіс періодично створює [Pull Requests](https://docs.github.com/en/pull-requests/collaborating-with-pull-requests/proposing-changes-to-your-work-with-pull-requests/about-pull-requests) для Gaphor з оновленими перекладами.

source: It is also very nice if you create your own content around Gaphor. Think about blog posts, videos, and conference talks. When you created something, please drop us a line, so we can add it to the [Tutorials](https://gaphor.org/tutorials) page on the website.
fr: Il est également très intéressant que vous créiez votre propre contenu autour de Gaphor. Pensez à des articles de blog, des vidéos, et des conférences. Lorsque vous créez quelque chose, merci de nous en faire part, afin que nous puissions l'ajouter à la page [Tutoriels](https://gaphor.org/tutorials) du site web.
ta: கஃபரைச் சுற்றி உங்கள் சொந்த உள்ளடக்கத்தை உருவாக்கினால் அது மிகவும் நன்றாக இருக்கிறது. வலைப்பதிவு இடுகைகள், வீடியோக்கள் மற்றும் மாநாட்டு பேச்சுக்கள் பற்றி சிந்தியுங்கள். நீங்கள் எதையாவது உருவாக்கும்போது, தயவுசெய்து எங்களுக்கு ஒரு வரியை விடுங்கள், எனவே நாங்கள் அதை [டுடோரியல்கள்](https://gaphor.org/tutorials) பக்கத்தில் இணையதளத்தில் சேர்க்கலாம்.
uk: Також дуже добре, якщо ви створюєте власний контент на основі Gaphor. Подумайте про публікації в блогах, відео та доповіді на конференціях. Коли ви щось створили, будь ласка, напишіть нам, щоб ми могли додати це на сторінку [Tutorials] (https://gaphor.org/tutorials) на сайті.

source: If you want to contribute code, a good starting point is this site. It contains a lot of information on how Gaphor is build, especially in the *Concepts* section.
fr: Si vous voulez contribuer au code, un bon point de départ est ce site. Il contient beaucoup d'informations sur la construction de Gaphor, en particulier dans la section *Concepts*.
ta: நீங்கள் குறியீட்டை பங்களிக்க விரும்பினால், ஒரு நல்ல தொடக்க புள்ளி இந்த தளம். காஃபர் எவ்வாறு உருவாக்கப்படுகிறார் என்பது குறித்த நிறைய தகவல்கள் இதில் உள்ளன, குறிப்பாக * கருத்துக்கள் * பிரிவில்.
uk: Якщо ви хочете додати код, гарною відправною точкою є цей сайт. Він містить багато інформації про збірку Gaphor, особливо в розділі *Концепції*.

source: Some issues are labeled with *first-timers-only*. Those issues are a good starting point to make yourself familiar with the code and code style.
fr: Certaines questions sont étiquetées avec *first-timers-only*. Ces questions constituent un bon point de départ pour se familiariser avec le code et le style de code.
ta: சில சிக்கல்கள் *முதல்-நேரத்திற்கு மட்டும் *உடன் பெயரிடப்பட்டுள்ளன. குறியீடு மற்றும் குறியீடு பாணியைப் பற்றி நன்கு தெரிந்திருக்க அந்த சிக்கல்கள் ஒரு நல்ல தொடக்க புள்ளியாகும்.
uk: Деякі проблеми позначені *лише для перших осіб*. Ці проблеми є хорошою відправною точкою для ознайомлення з кодом і стилем коду.

source: It's always a good idea to create an [issue](https://github.com/gaphor/gaphor/issues) or start a [discussion](https://github.com/gaphor/gaphor/discussions) if you want to build something for which there is no issue yet. That way you can assure that your idea is implemented in a way consistent with the application, and it increases the chance your work will be accepted.
fr: C'est toujours une bonne idée de créer un issue ou de commencer une discussion si vous souhaitez développer quelque chose qui n'existe pas encore. De cette façon, vous pouvez vous assurer que votre idée est mise en œuvre de manière cohérente avec l'application, et augmenter les chances que votre travail soit accepté.
ta: ஒரு [சிக்கலை](https://github.com/gaphor/gaphor/issues) ஐ உருவாக்குவது எப்போதும் நல்ல யோசனையாகும் அல்லது ஒரு [கலந்துரையாடல்](https://github.com/gaphor/gaphor/discussions) ஐ நீங்கள் இதுவரை உருவாக்க விரும்பினால். அந்த வகையில் உங்கள் சிந்தனை பயன்பாட்டுடன் ஒத்துப்போகும் வகையில் செயல்படுத்தப்படுகிறது என்பதை நீங்கள் உறுதிப்படுத்த முடியும், மேலும் இது உங்கள் பணி ஏற்றுக்கொள்ளப்படும் வாய்ப்பை அதிகரிக்கிறது.
uk: Завжди корисно створити [проблему] (https://github.com/gaphor/gaphor/issues) або розпочати [обговорення] (https://github.com/gaphor/gaphor/discussions), якщо ви хочете створити щось, для чого ще не існує проблеми. Таким чином ви можете бути впевнені, що ваша ідея буде реалізована відповідно до заявки, і це збільшує шанси на те, що ваша робота буде прийнята.
