Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: The use case diagram shows the relationship between the actor and the use case. It is represented by an oval shape with the use case name inside and an association with the actor. The association represents the interaction from the actor to the use case.
fr: Le diagramme de cas d'utilisation montre la relation entre l'acteur et le cas d'utilisation. Il est représenté par une forme ovale avec le nom du cas d'utilisation à l'intérieur et une association avec l'acteur. L'association représente l'interaction entre l'acteur et le cas d'utilisation.
ta: பயன்பாட்டு வழக்கு வரைபடம் நடிகருக்கும் பயன்பாட்டு வழக்குக்கும் இடையிலான உறவைக் காட்டுகிறது. இது ஒரு ஓவல் வடிவத்தால் பயன்படுத்தப்படுகிறது, இது பயன்பாட்டு வழக்கு பெயர் உள்ளே மற்றும் நடிகருடன் ஒரு தொடர்பு. சங்கம் நடிகரிடமிருந்து பயன்பாட்டு வழக்குக்கான தொடர்புகளை குறிக்கிறது.
uk: Діаграма варіантів використання показує зв’язок між актором і варіантом використання. Він представлений овальною формою з назвою варіанта використання всередині та асоціацією з актором. Асоціація представляє взаємодію від актора до варіанту використання.

source: Domain Diagram
fr: Diagramme de domaine
ta: டொமைன் வரைபடம்
uk: Діаграма домену

source: A domain diagram is a graphical representation of the concepts, terms, and relationships within a specific domain. In the case of a coffee shop, a domain diagram could represent the key elements and relationships within the coffee shop domain.
fr: Un diagramme de domaine est une représentation graphique des concepts, des termes et des relations au sein d'un domaine spécifique. Dans le cas d'un café, un diagramme de domaine pourrait représenter les éléments clés et les relations au sein du domaine du café.
ta: ஒரு டொமைன் வரைபடம் என்பது ஒரு குறிப்பிட்ட களத்தில் உள்ள கருத்துகள், விதிமுறைகள் மற்றும் உறவுகளின் வரைகலை பிரதிநிதித்துவமாகும். ஒரு காபி கடையின் விசயத்தில், ஒரு டொமைன் வரைபடம் காபி கடை களத்தில் உள்ள முக்கிய கூறுகள் மற்றும் உறவுகளைக் குறிக்கலாம்.
uk: Діаграма предметної області — це графічне представлення понять, термінів і зв’язків у певній області. У випадку кав’ярні діаграма домену може представляти ключові елементи та зв’язки в межах домену кав’ярні.

source: The following is a domain diagram that builds upon the context diagram with additional blocks:
fr: Le schéma suivant est un diagramme de domaine qui s'appuie sur le diagramme de contexte en y ajoutant des blocs supplémentaires :
ta: கூடுதல் தொகுதிகள் கொண்ட சூழல் வரைபடத்தை உருவாக்கும் ஒரு டொமைன் வரைபடம் பின்வருமாறு:
uk: Нижче наведено діаграму домену, яка будується на діаграмі контексту з додатковими блоками:

source: Barista
fr: Barman
ta: பாரிச்டா
uk: Бариста

source: Coffee Machine
fr: Espresso Machine (Machine à café)
ta: காபி இயந்திரம்
uk: Кавоварка

source: Roasted Coffee
fr: Roasted Coffee (Café Torréfié)
ta: வறுத்த காபி
uk: Смажена кава

source: Coffee Grinder
fr: Coffee Grinder (Moulin à café)
ta: காபி சாணை
uk: Кавомолка

source: Water Supply
fr: Water Supply (Approvisionnement en eau)
ta: நீர் வழங்கல்
uk: Водопостачання

source: Customer
fr: Customer (Client)
ta: வாடிக்கையாளர்
uk: Замовник

source: Each block in the Block Definition Diagram (bdd) represents a key concept within the coffee shop domain, and the containment relationship is used between the domain and the blocks to show that they are part of the domain.
fr: Chaque bloc du Diagramme de Définition des Blocs (bdd) représente un concept clé du domaine des boutiques de cafés, et la relation de confinement est utilisée entre le domaine et les blocs pour montrer qu'ils font partie du domaine.
ta: தொகுதி வரையறை வரைபடத்தில் (பி.டி.டி) ஒவ்வொரு தொகுதியும் காபி கடை களத்தில் ஒரு முக்கிய கருத்தை குறிக்கிறது, மேலும் அவை களத்தின் ஒரு பகுதி என்பதைக் காட்ட டொமைனுக்கும் தொகுதிகளுக்கும் இடையில் கட்டுப்பாட்டு உறவு பயன்படுத்தப்படுகிறது.
uk: Кожен блок на діаграмі визначення блоку (bdd) представляє ключову концепцію в межах домену кав’ярні, а зв’язок утримання використовується між доменом і блоками, щоб показати, що вони є частиною домену.

source: Block Definition Diagram showing hierarchy of blocks in the Coffee Shop domain
fr: Diagramme de définition des blocs montrant la hiérarchie des blocs dans le domaine 'Coffee Shop'
ta: காபி கடை களத்தில் தொகுதிகளின் வரிசைமுறையைக் காட்டும் பிளாக் வரையறை வரைபடம்
uk: Діаграма визначення блоку, що показує ієрархію блоків у домені Coffee Shop

source: The Barista block is responsible for preparing and serving the coffee to the customers. The Roasted Coffee block contains the types of coffee available for the barista to use. The Coffee Grinder block grinds the roasted coffee beans to the desired consistency before brewing. The Water Supply block contains the water source for the coffee machine, and finally the Customer block represents the person who orders and receives the coffee.
fr: Le bloc Barista (Barman) est chargé de préparer et de servir le café aux clients. Le bloc Roasted Coffe (Café torréfié) contient les types de café disponibles pour le barman. Le bloc Coffee Grinder (Moulin à café) moud les grains de café torréfiés à la consistance souhaitée avant la préparation du café. Le bloc Water Supply (Alimentation en eau) contient la source d'eau pour la machine à café, et enfin le bloc Customer (Client) représente la personne qui commande et reçoit le café.
ta: வாடிக்கையாளர்களுக்கு காபியைத் தயாரிக்கவும் பரிமாறவும் பாரிச்டா பிளாக் பொறுப்பு. வறுத்த காபி தொகுதியில் பாரிச்டா பயன்படுத்த காபி வகைகள் உள்ளன. காபி கிரைண்டர் தொகுதி வறுத்த காபி பீன்ச் காய்ச்சுவதற்கு முன் விரும்பிய நிலைத்தன்மைக்கு அரைக்கிறது. நீர் வழங்கல் தொகுதியில் காபி இயந்திரத்திற்கான நீர் ஆதாரங்கள் உள்ளன, இறுதியாக வாடிக்கையாளர் தொகுதி காபியை ஆர்டர் செய்து பெறும் நபரைக் குறிக்கிறது.
uk: Блок бариста відповідає за приготування та подачу кави клієнтам. Блок «Смажена кава» містить види кави, доступні для використання бариста. Блок кавомолки подрібнює смажені кавові зерна до потрібної консистенції перед приготуванням. Блок водопостачання містить джерело води для кавоварки, і, нарешті, блок клієнта представляє особу, яка замовляє та отримує каву.

source: The ants need more of your help to rename the Feature Domain diagram and update it so that it matches the one above. Make sure that "Profile: SysML" is selected in the top-left corner of the Gaphor user interface. The names of the blocks can be changed directly in the diagram, but the name of the bdd can only be changed in the Model Browser. In the Structure package, right-click on the Blocks with the B symbol and rename them from the context menu. Also remember that you can use [auto-layout](first_model.md#adding-relations) to align and distribute all elements.
fr: Les fourmis ont besoin de votre aide pour renommer le diagramme 'Feature Domain' (Domaine de fonctionnalité) et le mettre à jour afin qu'il corresponde au diagramme ci-dessus. Assurez-vous que l'option « Profile : SysML » est sélectionné dans le coin supérieur gauche de l'interface utilisateur Gaphor. Les noms des blocs peuvent être modifiés directement dans le diagramme, mais le nom de la bdd (base de donnée) ne peut être modifié que dans le navigateur de modèle. Dans le paquet 'Structur', cliquez avec le bouton droit de la souris sur les blocs portant le symbole B et renommez-les à partir du menu contextuel. Rappelez-vous également que vous pouvez utiliser [auto-layout](first_model.md#adding-relations) pour aligner et répartir tous les éléments.
ta: அம்ச டொமைன் வரைபடத்தை மறுபெயரிடவும், அதைப் புதுப்பிக்கவும் எறும்புகளுக்கு உங்கள் உதவி தேவை, இதனால் மேலே உள்ளவற்றுடன் பொருந்துகிறது. காஃபர் பயனர் இடைமுகத்தின் மேல்-இடது மூலையில் "சுயவிவரம்: SysML" தேர்ந்தெடுக்கப்பட்டிருப்பதை உறுதிசெய்க. தொகுதிகளின் பெயர்களை வரைபடத்தில் நேரடியாக மாற்ற முடியும், ஆனால் BDD இன் பெயரை மாதிரி உலாவியில் மட்டுமே மாற்ற முடியும். கட்டமைப்பு தொகுப்பில், பி சின்னத்துடன் தொகுதிகளில் வலது சொடுக்கு செய்து அவற்றை சூழல் மெனுவிலிருந்து மறுபெயரிடுங்கள். அனைத்து கூறுகளையும் சீரமைக்க மற்றும் விநியோகிக்க நீங்கள் [ஆட்டோ-லேஅவுட்](first_model.md#adding-relations) பயன்படுத்தலாம் என்பதையும் நினைவில் கொள்ளுங்கள்.
uk: Мурахам потрібна додаткова ваша допомога, щоб перейменувати діаграму домену ознак і оновити її так, щоб вона відповідала наведеній вище. Переконайтеся, що у верхньому лівому куті інтерфейсу користувача Gaphor вибрано «Профіль: SysML». Назви блоків можна змінити безпосередньо на схемі, але ім’я bdd можна змінити лише в браузері моделей. У пакеті Structure клацніть правою кнопкою миші на блоках із символом B і перейменуйте їх у контекстному меню. Також пам’ятайте, що ви можете використовувати [auto-layout](first_model.md#adding-relations) для вирівнювання та розподілу всіх елементів.

source: The domain diagram provides a high-level view of the coffee shop domain and the key concepts and relationships involved in it. It can be a useful tool for understanding the relationships between different elements of the domain and for communicating these relationships to others.
fr: Le diagramme de domaine fournit une vue de haut niveau du domaine des cafés et des concepts et relations clés qu'il implique. Il peut s'avérer utile pour comprendre les relations entre les différents éléments du domaine et pour communiquer ces relations aux autres.
ta: டொமைன் வரைபடம் காபி கடை களத்தின் உயர் மட்ட பார்வையையும் அதில் உள்ள முக்கிய கருத்துகள் மற்றும் உறவுகளையும் வழங்குகிறது. களத்தின் வெவ்வேறு கூறுகளுக்கு இடையிலான உறவுகளைப் புரிந்துகொள்வதற்கும் இந்த உறவுகளை மற்றவர்களுடன் தொடர்புகொள்வதற்கும் இது ஒரு பயனுள்ள கருவியாக இருக்கலாம்.
uk: Діаграма домену надає уявлення високого рівня про домен кав’ярні та ключові концепції та зв’язки, які в ньому беруть участь. Це може бути корисним інструментом для розуміння зв’язків між різними елементами домену та для передачі цих зв’язків іншим.

source: Context Diagram
fr: Diagramme de Contexte
ta: சூழல் வரைபடம்
uk: Контекстна Діаграма

source: The context diagram is a high-level view of the system, and it shows its interaction with external entities. In the case of a coffee machine, a context diagram provides a clear and concise representation of the system and its interactions with the external environment.
fr: Le diagramme de contexte est une vue de haut niveau du système et montre son interaction avec les entités externes. Dans le cas d'une machine à café, un diagramme de contexte fournit une représentation claire et concise du système et de ses interactions avec l'environnement externe.
ta: சூழல் வரைபடம் என்பது அமைப்பின் உயர் மட்ட பார்வையாகும், மேலும் இது வெளிப்புற நிறுவனங்களுடனான அதன் தொடர்பைக் காட்டுகிறது. ஒரு காபி இயந்திரத்தைப் பொறுத்தவரை, ஒரு சூழல் வரைபடம் அமைப்பின் தெளிவான மற்றும் சுருக்கமான பிரதிநிதித்துவத்தையும் வெளிப்புற சூழலுடனான அதன் தொடர்புகளையும் வழங்குகிறது.
uk: Контекстна діаграма — це високорівневе уявлення про систему, яке показує її взаємодію із зовнішніми об’єктами. У випадку кавомашини контекстна діаграма забезпечує чітке та стисле уявлення про систему та її взаємодію із зовнішнім середовищем.

source: The context diagram for a coffee machine shows the coffee machine as the system at the center, with all its external entities surrounding it. The external entities include the barista, the power source, the coffee grinder, and the water source.
fr: Le diagramme de contexte d'une machine à café montre la machine à café comme le système au centre, avec toutes les entités externes qui l'entourent. Les entités externes comprennent le barman, la source d'énergie, le moulin à café et la source d'eau.
ta: ஒரு காபி இயந்திரத்திற்கான சூழல் வரைபடம் காபி இயந்திரத்தை மையத்தில் உள்ள அமைப்பாகக் காட்டுகிறது, அதன் அனைத்து வெளிப்புற நிறுவனங்களும் அதைச் சுற்றியுள்ளன. வெளிப்புற நிறுவனங்களில் பாரிச்டா, பவர் சோர்ச், காபி சாணை மற்றும் நீர் சான்று ஆகியவை அடங்கும்.
uk: Контекстна діаграма для кавомашини показує кавоварку як систему в центрі з усіма зовнішніми об’єктами, які її оточують. Зовнішні об’єкти включають бариста, джерело живлення, кавомолку та джерело води.

source: Block definition diagram showing context of the coffee shop with external entities
fr: Diagramme de définition des blocs montrant le contexte du café avec les entités externes
ta: வெளிப்புற நிறுவனங்களுடன் காபி கடையின் சூழலைக் காட்டும் வரையறை வரைபடம்
uk: Блок-схема визначення контексту кав’ярні з зовнішніми об’єктами

source: The ants need more of your help to rename the Feature Context diagram and update it so that it matches the one above. To create the specific arrows shown, use an Association entity, then toggle Enable Item Flow to on for that association and fill in the Item Property field.
fr: Les fourmis ont besoin de votre aide pour renommer le diagramme Feature Context (Contexte Fonctionnel) le mettre à jour afin qu'il corresponde au diagramme ci-dessus. Pour créer les flèches spécifiques illustrées, utilisez une entité Association, puis activez l'option Activer le flux d'éléments pour cette association et remplissez le champ Propriété de l'élément.
ta: அம்ச சூழல் வரைபடத்தை மறுபெயரிடவும், அதைப் புதுப்பிக்கவும் எறும்புகளுக்கு உங்கள் உதவி தேவை, இதனால் அது மேலே உள்ளவற்றுடன் பொருந்துகிறது. காட்டப்பட்ட குறிப்பிட்ட அம்புகளை உருவாக்க, ஒரு அசோசியேசன் நிறுவனத்தைப் பயன்படுத்தவும், பின்னர் அந்த சங்கத்திற்கான உருப்படி ஓட்டத்தை இயக்கவும் மற்றும் உருப்படி சொத்து புலத்தை நிரப்பவும்.
uk: Мурахам потрібна додаткова ваша допомога, щоб перейменувати діаграму контексту ознак і оновити її так, щоб вона відповідала наведеній вище. Щоб створити показані конкретні стрілки, скористайтеся сутністю асоціації, потім увімкніть параметр «Увімкнути потік елементів» для цієї асоціації та заповніть поле «Властивості елемента».

source: Overall, the context diagram for a coffee machine provides a high-level view of the system and its interactions with external entities. It is a useful tool for understanding the system and its role in the broader environment.
fr: Dans l'ensemble, le diagramme de contexte d'une machine à café fournit une vue de haut niveau du système et de ses interactions avec des entités externes. Il s'agit d'un outil utile pour comprendre le système et son rôle dans un environnement plus large.
ta: ஒட்டுமொத்தமாக, ஒரு காபி இயந்திரத்திற்கான சூழல் வரைபடம் அமைப்பின் உயர் மட்ட பார்வையையும் வெளிப்புற நிறுவனங்களுடனான அதன் தொடர்புகளையும் வழங்குகிறது. இது கணினி மற்றும் பரந்த சூழலில் அதன் பங்கைப் புரிந்துகொள்ள ஒரு பயனுள்ள கருவியாகும்.
uk: Загалом, діаграма контексту для кавоварки забезпечує високорівневе уявлення про систему та її взаємодію із зовнішніми об’єктами. Це корисний інструмент для розуміння системи та її ролі в ширшому середовищі.

source: Concept Requirements
fr: Exigences conceptuelles
ta: கருத்துருத் தேவைகள்
uk: Вимоги до концепції

source: Concept requirements are typically collected by analyzing the needs of the stakeholders involved in the development of the coffee machine. This involves identifying and gathering input from various stakeholders, such as the barista, the other engineers working on the product, manufacturing, and service.
fr: Les exigences conceptuelles sont généralement recueillies en analysant les besoins des parties prenantes impliquées dans le développement de la machine à café. Il s'agit d'identifier et de recueillir les commentaires des différentes parties prenantes, telles que le barman, les autres ingénieurs travaillant sur le produit, la fabrication et le service.
ta: காபி இயந்திரத்தின் வளர்ச்சியில் ஈடுபட்டுள்ள பங்குதாரர்களின் தேவைகளை பகுப்பாய்வு செய்வதன் மூலம் கருத்து தேவைகள் பொதுவாக சேகரிக்கப்படுகின்றன. பாரிச்டா, தயாரிப்பு, விளைவாக்கம் மற்றும் சேவையில் பணிபுரியும் பிற பொறியியலாளர்கள் போன்ற பல்வேறு பங்குதாரர்களிடமிருந்து உள்ளீட்டை அடையாளம் கண்டு சேகரிப்பது இதில் அடங்கும்.
uk: Концептуальні вимоги зазвичай збираються шляхом аналізу потреб зацікавлених сторін, залучених до розробки кавоварки. Це передбачає визначення та збір інформації від різних зацікавлених сторін, таких як бариста, інші інженери, які працюють над продуктом, виробництвом і обслуговуванням.

source: To collect concept requirements, stakeholders may be asked questions about what they want the coffee machine to do, what features it should have, and what problems it should solve. They may also be asked to provide feedback on existing coffee machines to identify areas where improvements could be made.
fr: Pour recueillir les exigences conceptuelles, les parties prenantes peuvent être interrogées sur ce qu'elles attendent de la machine à café, sur les caractéristiques qu'elle doit avoir et sur les problèmes qu'elle doit résoudre. Elles peuvent également être invitées à donner leur avis sur les machines à café existantes afin d'identifier les domaines dans lesquels des améliorations pourraient être apportées.
ta: கருத்துத் தேவைகளைச் சேகரிக்க, பங்குதாரர்கள் காபி இயந்திரம் என்ன செய்ய வேண்டும், அதில் என்ன நற்பொருத்தங்கள் இருக்க வேண்டும், அது என்ன சிக்கல்களைத் தீர்க்க வேண்டும் என்ற கேள்விகளைக் கேட்கலாம். மேம்பாடுகள் செய்யக்கூடிய பகுதிகளை அடையாளம் காண தற்போதுள்ள காபி இயந்திரங்கள் குறித்த கருத்துக்களை வழங்கவும் அவர்களிடம் கேட்கப்படலாம்.
uk: Щоб зібрати вимоги до концепції, зацікавленим сторонам можуть поставити запитання про те, що вони хочуть робити від кавоварки, які функції вона повинна мати та які проблеми вона повинна вирішувати. Їх також можуть попросити надати відгук про існуючі кавоварки, щоб визначити області, де можна було б зробити покращення.

source: Once the needs of the stakeholders have been gathered, they can be analyzed to identify common themes and requirements. This information can then be used to develop the concept requirements for the coffee machine, which serve as a starting point for the design process.
fr: Une fois que les besoins des parties prenantes ont été recueillis, ils peuvent être analysés afin d'identifier les thèmes et les exigences communs. Ces informations peuvent ensuite être utilisées pour élaborer les exigences conceptuelles de la machine à café, qui serviront de point de départ au processus de conception.
ta: பங்குதாரர்களின் தேவைகள் சேகரிக்கப்பட்டவுடன், பொதுவான கருப்பொருள்கள் மற்றும் தேவைகளை அடையாளம் காண அவற்றை பகுப்பாய்வு செய்யலாம். வடிவமைப்பு செயல்முறைக்கான தொடக்க புள்ளியாக செயல்படும் காபி இயந்திரத்திற்கான கருத்துத் தேவைகளை உருவாக்க இந்த தகவலைப் பயன்படுத்தலாம்.
uk: Після того як потреби зацікавлених сторін зібрано, їх можна проаналізувати для визначення спільних тем і вимог. Потім ця інформація може бути використана для розробки вимог до концепції кавоварки, які служать відправною точкою для процесу проектування.

source: The following are some concept requirements for a coffee machine that addresses a water tank, heat-up time, and HMI button:
fr: Voici quelques exigences conceptuelles pour une machine à café : réservoir d'eau, temps de chauffe et bouton de l'interface homme-machine (IHM) :
ta: நீர் தொட்டி, வெப்ப நேரம் மற்றும் எச்எம்ஐ பொத்தானைக் குறிக்கும் ஒரு காபி இயந்திரத்திற்கான சில கருத்துத் தேவைகள் பின்வருமாறு:
uk: Нижче наведено деякі концептуальні вимоги до кавоварки, яка стосується резервуара для води, часу нагрівання та кнопки HMI:

source: Water Tank: The coffee machine shall have a water tank of sufficient size to make multiple cups of coffee before needing a refill. The water tank should be easy to access and fill.
fr: Water Tank (Réservoir d'eau) : La machine à café doit être dotée d'un réservoir d'eau suffisamment grand pour permettre la préparation de plusieurs tasses de café avant qu'il ne soit nécessaire de le remplir à nouveau. Le réservoir d'eau doit être facile d'accès et de remplissage.
ta: நீர் தொட்டி: காபி இயந்திரத்தில் ஒரு மறு நிரப்பல் தேவைப்படுவதற்கு முன்பு பல கப் காபி தயாரிக்க போதுமான அளவு நீர் தொட்டி இருக்கும். நீர் தொட்டியை அணுகவும் நிரப்பவும் எளிதாக இருக்க வேண்டும்.
uk: Резервуар для води: кавова машина має мати резервуар для води достатнього розміру, щоб приготувати кілька чашок кави, перш ніж потребуватиме доповнення. Резервуар для води має бути легким для доступу та наповнення.

source: Heat-up Time: The coffee machine shall have a heat-up time of no more than 10 minutes from the time the user turns on the machine until it's ready to brew coffee.
fr: Heat-up Time (Temps de chauffe) : La machine à café doit avoir un temps de chauffe ne dépassant pas 10 minutes entre le moment où l'utilisateur allume la machine et le moment où elle est prête à préparer le café.
ta: வெப்ப நேரம்: காபி இயந்திரத்தில் காபி காய்ச்சத் தயாராகும் வரை பயனர் இயந்திரத்தில் திரும்பும் நேரத்திலிருந்து 10 நிமிடங்களுக்கு மேல் இல்லாத வெப்ப நேரம் இருக்கும்.
uk: Час нагріву: час нагрівання кавомашини не повинен перевищувати 10 хвилин з моменту, коли користувач увімкнув машину, до моменту, коли вона буде готова до приготування кави.

source: 1 Cup Button: The coffee machine shall have an HMI with a 1 cup brew button to make it easy for the user to select the amount of coffee they want to brew.
fr: 1 Cup Button (Bouton 1 tasse) : La machine à café doit être dotée d'une 'Interface Homme Machine' avec un bouton préparer une tasse pour permettre à l'utilisateur de sélectionner facilement la quantité de café qu'il souhaite. L'IHM doit être intuitive et facile à utiliser.
ta: 1 கப் பொத்தான்: காபி இயந்திரத்தில் 1 கப் மருந்துநீர் பொத்தானைக் கொண்ட ஒரு எச்.எம்.ஐ இருக்கும், பயனருக்கு அவர்கள் காய்ச்ச விரும்பும் காபியின் அளவைத் தேர்ந்தெடுப்பதை எளிதாக்குகிறது.
uk: Кнопка «1 чашка»: кавова машина повинна мати HMI з кнопкою заварювання 1 чашки, щоб користувачеві було легко вибрати кількість кави, яку він хоче зварити.

source: Concept requirements for water tank, heat-up time, and HMI button
fr: Exigences conceptuelles pour le réservoir d'eau, le temps de chauffe et le bouton de l'IHM
ta: நீர் தொட்டி, வெப்ப நேரம் மற்றும் எச்எம்ஐ பொத்தானுக்கான கருத்து தேவைகள்
uk: Концептуальні вимоги до резервуара для води, часу нагріву та кнопки HMI

source: Help the ants update the Concept Requirements diagram with these requirements.
fr: Aidez les fourmis à mettre à jour le diagramme des exigences du concept avec ces exigences.
ta: இந்த தேவைகளுடன் கருத்து தேவைகள் வரைபடத்தைப் புதுப்பிக்க எறும்புகளுக்கு உதவுங்கள்.
uk: Допоможіть мурахам оновити діаграму концептуальних вимог до цих вимог.

source: Throughout the design process, the concept requirements will be refined and expanded upon as more information becomes available and the needs of the stakeholders become clearer. This iterative process ensures that the final design of the coffee machine meets the needs of all stakeholders and delivers a high-quality product.
fr: Tout au long du processus de conception, les exigences du concept seront affinées et développées au fur et à mesure que de nouvelles informations seront disponibles et que les besoins des parties prenantes deviendront plus clairs. Ce processus itératif garantit que la conception finale de la machine à café répond aux besoins de toutes les parties prenantes et fournit un produit de haute qualité.
ta: வடிவமைப்பு செயல்முறை முழுவதும், மேலும் தகவல்கள் கிடைக்கும்போது கருத்துத் தேவைகள் சுத்திகரிக்கப்பட்டு விரிவாக்கப்படும், மேலும் பங்குதாரர்களின் தேவைகள் தெளிவாகின்றன. இந்த செயல்பாட்டு செயல்முறை காபி இயந்திரத்தின் இறுதி வடிவமைப்பு அனைத்து பங்குதாரர்களின் தேவைகளையும் நிறைவு செய்வதையும், உயர்தர உற்பத்தியை வழங்குகிறது என்பதையும் உறுதி செய்கிறது.
uk: Протягом усього процесу проектування вимоги до концепції будуть уточнюватися та розширюватися в міру того, як стане доступною більше інформації та з’ясуються потреби зацікавлених сторін. Цей ітеративний процес гарантує, що остаточний дизайн кавоварки відповідає потребам усіх зацікавлених сторін і забезпечує високоякісний продукт.

source: Coffee Machine: Logical Level
fr: Coffee Machine (Machine à café) : Niveau logique
ta: காபி இயந்திரம்: தருக்க நிலை
uk: Кавоварка: логічний рівень
