Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: Group head: The group head is a part of the espresso machine where the portafilter attaches. It provides a secure connection between the portafilter and the machine, allowing the brewed espresso to flow out of the portafilter and into the cup. The group head also helps to maintain proper temperature and pressure during the brewing process.
fr: Group head : La tête de groupe est une partie de la machine à espresso où se fixe le porte-filtre. Elle assure une liaison sûre entre le portafiltre et la machine, ce qui permet à l'espresso de s'écouler du portafiltre et de se déverser dans la tasse. La tête de groupe permet également de maintenir une température et une pression adéquates pendant le processus d'infusion.
ta: குழு தலை: குழு தலை என்பது போர்டாஃபில்டர் இணைக்கும் எச்பிரெசோ இயந்திரத்தின் ஒரு பகுதியாகும். இது போர்டாஃபில்டருக்கும் இயந்திரத்திற்கும் இடையில் ஒரு பாதுகாப்பான இணைப்பை வழங்குகிறது, இது காய்ச்சும் எச்பிரெசோவை போர்டாஃபில்டரிலிருந்து வெளியேறி கோப்பைக்குள் அனுமதிக்கிறது. காய்ச்சும் செயல்பாட்டின் போது சரியான வெப்பநிலை மற்றும் அழுத்தத்தை பராமரிக்க குழு தலை உதவுகிறது.
uk: Групова головка: групова головка є частиною еспресо-машини, до якої кріпиться портафільтр. Він забезпечує надійне з’єднання між портафільтром і машиною, дозволяючи звареному еспресо витікати з портафільтра в чашку. Голова групи також допомагає підтримувати належну температуру та тиск під час процесу пивоваріння.

source: HMI (Human-Machine Interface): The HMI is the user interface of the espresso machine. It provides a means for the user to interact with the machine, usually through buttons, switches, or a touchscreen. The HMI allows the user to select different brewing options, adjust settings, and monitor the status of the machine. It provides feedback and displays information related to the brewing process, such as brewing time, temperature, and cup size selection.
fr: HMI : L'Interface Homme-Machine (IHM) est interface utilisateur de la machine à espresso. Elle permet à l'utilisateur d'interagir avec la machine, généralement au moyen de boutons, d'interrupteurs ou d'un écran tactile. L'IHM permet à l'utilisateur de sélectionner différentes options d'infusion, d'ajuster les réglages et de contrôler l'état de la machine. Elle fournit des informations en retour et affiche des informations relatives au processus de préparation, telles que le temps de préparation, la température et la sélection de la taille de la tasse.
ta: HMI (மனித-இயந்திர இடைமுகம்): HMI என்பது எச்பிரெசோ இயந்திரத்தின் பயனர் இடைமுகமாகும். இது பயனருக்கு இயந்திரத்துடன் தொடர்புகொள்வதற்கான வழிமுறையை வழங்குகிறது, பொதுவாக பொத்தான்கள், சுவிட்சுகள் அல்லது தொடுதிரை மூலம். வெவ்வேறு காய்ச்சும் விருப்பங்களைத் தேர்ந்தெடுக்கவும், அமைப்புகளை சரிசெய்யவும், கணினியின் நிலையை கண்காணிக்கவும் HMI பயனரை அனுமதிக்கிறது. இது கருத்துக்களை வழங்குகிறது மற்றும் காய்ச்சும் நேரம், வெப்பநிலை மற்றும் கப் அளவு தேர்வு போன்ற காய்ச்சும் செயல்முறை தொடர்பான தகவல்களைக் காட்டுகிறது.
uk: HMI (людина-машинний інтерфейс): HMI — це інтерфейс користувача кавоварки для приготування еспресо. Він надає користувачеві засоби для взаємодії з машиною, зазвичай за допомогою кнопок, перемикачів або сенсорного екрана. HMI дозволяє користувачеві вибирати різні параметри заварювання, регулювати параметри та контролювати стан машини. Він забезпечує зворотній зв’язок і відображає інформацію, пов’язану з процесом заварювання, наприклад час заварювання, температуру та вибір розміру чашки.

source: We didn't make any technical choices at this time, for example we didn't specify which type of controller, the pump capacity, or the model of the group head. These details will be defined once we get to the Technology level.
fr: Nous n'avons pas fait de choix techniques à ce stade, par exemple nous n'avons pas spécifié le type de contrôleur (controller), la capacité de la pompe (Water pump)ou le modèle de la tête de groupe (Group Head). Ces détails seront définis une fois que nous aurons atteint le niveau technologique.
ta: இந்த நேரத்தில் நாங்கள் எந்த தொழில்நுட்ப தேர்வுகளையும் செய்யவில்லை, எடுத்துக்காட்டாக, எந்த வகை கட்டுப்படுத்தி, பம்ப் திறன் அல்லது குழு தலையின் மாதிரியை நாங்கள் குறிப்பிடவில்லை. தொழில்நுட்ப நிலைக்கு வந்தவுடன் இந்த விவரங்கள் வரையறுக்கப்படும்.
uk: Наразі ми не робили жодного технічного вибору, наприклад, ми не вказали тип контролера, потужність насоса чи модель головки групи. Ці деталі будуть визначені, коли ми перейдемо до рівня технологій.

source: The ants need more of your help to update the Logical Structure diagram so that it matches the one above.
fr: Les fourmis ont besoin de votre aide pour mettre à jour le diagramme de la Structure Logique afin qu'il corresponde au diagramme ci-dessus.
ta: தருக்க கட்டமைப்பு வரைபடத்தைப் புதுப்பிக்க எறும்புகளுக்கு உங்கள் உதவி அதிகம் தேவைப்படுகிறது, இதனால் அது மேலே உள்ளவற்றுடன் பொருந்துகிறது.
uk: Мурахам потрібна більше вашої допомоги, щоб оновити схему логічної структури, щоб вона відповідала наведеній вище.

source: Logical Boundary
fr: Frontière logique
ta: தருக்க எல்லை
uk: Логічна межа

source: The Logical Boundary is a type of Internal Block Diagram that represents the internal structure of a system, illustrating the relationships between its internal components or blocks. It helps to visualize how these blocks interact and exchange information within the system. The term boundary used here means a clear box view inside the espresso machine at the logical boundary. It uses part properties of the blocks that were in the Logical Structure diagram above.
fr: La frontière logique est un type de Diagramme de Bloc Interne qui représente la structure interne d'un système, illustrant les relations entre ses composants ou blocs internes. Il aide à visualiser la manière dont ces blocs interagissent et échangent des informations au sein du système. Le terme frontière utilisé ici signifie une vue claire de la boîte à l'intérieur de la machine à espresso au niveau de la frontière logique. Elle utilise les propriétés partielles des blocs qui figuraient dans le Diagramme de Structure Logique ci-dessus.
ta: தருக்க எல்லை என்பது ஒரு வகை உள் தொகுதி வரைபடமாகும், இது ஒரு அமைப்பின் உள் கட்டமைப்பைக் குறிக்கிறது, அதன் உள் கூறுகள் அல்லது தொகுதிகளுக்கு இடையிலான உறவுகளை விளக்குகிறது. இந்த தொகுதிகள் கணினியில் எவ்வாறு தொடர்பு கொண்டு தகவல்களை பரிமாறிக்கொள்கின்றன என்பதைக் காட்சிப்படுத்த இது உதவுகிறது. இங்கே பயன்படுத்தப்படும் எல்லை என்ற சொல் தருக்க எல்லையில் எச்பிரெசோ இயந்திரத்திற்குள் ஒரு தெளிவான பெட்டி காட்சியைக் குறிக்கிறது. இது மேலே உள்ள தருக்க கட்டமைப்பு வரைபடத்தில் இருந்த தொகுதிகளின் பகுதி பண்புகளைப் பயன்படுத்துகிறது.
uk: Логічна границя — це тип внутрішньої блок-схеми, яка представляє внутрішню структуру системи, ілюструючи зв’язки між її внутрішніми компонентами або блоками. Це допомагає візуалізувати, як ці блоки взаємодіють і обмінюються інформацією в системі. Термін «межа», який використовується тут, означає чіткий вигляд коробки всередині еспресо-машини на логічній межі. Він використовує властивості частин блоків, які були на схемі логічної структури вище.

source: Internal block diagram showing the clear box view of the espresso machine
fr: Le diagramme de bloc fonctionnel représente une vue claire de la boîte de la machine à espresso
ta: எச்பிரெசோ இயந்திரத்தின் தெளிவான பெட்டி காட்சியைக் காட்டும் உள் தொகுதி வரைபடம்
uk: Внутрішня блок-схема, що демонструє зовнішній вигляд еспресо-машини

source: The interactions between the part properties inside the espresso machine are shown as ItemFlows on the Connectors.
fr: Les interactions entre les propriétés des composant à l'intérieur de la machine à expresso sont représentées sous forme de flux d'éléments (ItemFlows) sur les connecteurs 'Connectors).
ta: எச்பிரெசோ இயந்திரத்திற்குள் உள்ள பகுதி பண்புகளுக்கு இடையிலான தொடர்புகள் இணைப்பிகளில் உருப்படி பாய்ச்சல்களாக காட்டப்பட்டுள்ளன.
uk: Взаємодія між властивостями частин всередині еспресо-машини показано як ItemFlows на конекторах.

source: Water: Represents the flow of water from the water tank to the water pump.
fr: Water : Représente le flux d'eau depuis le réservoir d'eau jusqu'à la pompe à eau.
ta: நீர்: நீர் தொட்டியில் இருந்து நீர் பம்ப் வரை நீர் ஓட்டத்தை குறிக்கிறது.
uk: Вода: відображає потік води з резервуара для води до водяного насоса.

source: On/Off: Represents the command or signal to turn the espresso machine on or off.
fr: On/Off : Représente la commande ou le signal de mise en marche ou d'arrêt de la machine à espresso.
ta: ஆன்/ஆஃப்: எச்பிரெசோ இயந்திரத்தை ஆன் அல்லது ஆஃப் செய்ய கட்டளை அல்லது சமிக்ஞையை குறிக்கிறது.
uk: Увімк./Вимк.: представляє команду або сигнал для ввімкнення або вимкнення еспресо-машини.

source: Volume Adjustment: Represents the user-selected volume adjustment for the coffee output.
fr: Volume Adjustment : (Ajustement du volume) Représente le réglage du volume sélectionné par l'utilisateur pour la sortie du café.
ta: தொகுதி சரிசெய்தல்: காபி வெளியீட்டிற்கான பயனர் தேர்ந்தெடுக்கப்பட்ட தொகுதி சரிசெய்தலைக் குறிக்கிறது.
uk: Volume Adjustment (Регулювання гучності): являє собою вибране користувачем регулювання гучності для випуску кави.

source: Pressurized Water: Represents the water flow under pressure for extracting coffee.
fr: Pressurized Water : (Eau sous pression) Représente le débit d'eau sous pression pour l'extraction du café.
ta: அழுத்தப்பட்ட நீர்: காபியைப் பிரித்தெடுப்பதற்கான அழுத்தத்தின் கீழ் நீர் ஓட்டத்தை குறிக்கிறது.
uk: Вода під тиском: являє собою потік води під тиском для видобутку кави.

source: Heat Command: Represents the command or signal to activate the water heater and initiate the heating process.
fr: Heat Command :(Commande de chauffage) Représente la commande ou le signal permettant d'activer le chauffe-eau et de lancer le processus de chauffage.
ta: வெப்ப கட்டளை: வாட்டர் ஈட்டரை செயல்படுத்தவும், வெப்பமாக்கல் செயல்முறையைத் தொடங்கவும் கட்டளை அல்லது சமிக்ஞையை குறிக்கிறது.
uk: Команда нагріву: представляє команду або сигнал для активації водонагрівача та початку процесу нагрівання.

source: Temperature: Represents the feedback signal indicating the current temperature of the water.
fr: Temperature : (Température) Représente le signal de retour indiquant la température actuelle de l'eau.
ta: வெப்பநிலை: நீரின் தற்போதைய வெப்பநிலையைக் குறிக்கும் பின்னூட்ட சமிக்ஞையைக் குறிக்கிறது.
uk: Температура: являє собою сигнал зворотного зв'язку, що вказує на поточну температуру води.

source: Hot Pressurized Water: Represents the pressurized hot water for brewing coffee.
fr: Hot Pressurized Water : (Eau chaude sous pression) Représente l'eau chaude sous pression pour la préparation du café.
ta: சூடான அழுத்தப்பட்ட நீர்: காபியை காய்ச்சுவதற்கான அழுத்தப்பட்ட சூடான நீரைக் குறிக்கிறது.
uk: Гаряча вода під тиском: гаряча вода під тиском для заварювання кави.

source: Coffee Water Mixture: Represents the mixture of hot water and coffee grounds during the brewing process.
fr: Coffee Water Mixture : (Mélange d'eau et de café) Représente le mélange d'eau chaude et de marc de café pendant le processus d'infusion.
ta: காபி நீர் கலவை: காய்ச்சும் செயல்பாட்டின் போது சூடான நீர் மற்றும் காபி மைதானங்களின் கலவையை குறிக்கிறது.
uk: Суміш кави з водою: являє собою суміш гарячої води та кавової гущі під час процесу заварювання.

source: Notice that we aren't actually showing anything entering or leaving the boundary of the espresso machine, like the input from the barista or the resulting coffee. Gaphor doesn't current support adding ports to the boundary of an internal block diagram, but hopefully we'll be able to add support soon!
fr: Remarquez que nous ne montrons rien qui entre ou qui sort du périmètre de la machine à expresso, comme les entrées du barman ou le café qui en résulte. Gaphor ne permet pas actuellement d'ajouter des ports à la frontière d'un schéma fonctionnel interne, mais nous espérons pouvoir le faire bientôt !
ta: பாரிச்டாவிலிருந்து உள்ளீடு அல்லது அதன் விளைவாக வரும் காபி போன்ற எச்பிரெசோ இயந்திரத்தின் எல்லைக்குள் நுழைய அல்லது வெளியேறும் எதையும் நாங்கள் உண்மையில் காட்டவில்லை என்பதைக் கவனியுங்கள். ஒரு உள் தொகுதி வரைபடத்தின் எல்லையில் துறைமுகங்களைச் சேர்ப்பதை கஃபர் தற்போதைய ஆதரவல்ல, ஆனால் விரைவில் ஆதரவைச் சேர்க்க முடியும் என்று நம்புகிறோம்!
uk: Зверніть увагу, що ми не показуємо нічого, що входить або виходить за межі еспресо-машини, наприклад, вхідні дані від бариста або отриману каву. Наразі Gaphor не підтримує додавання портів до межі внутрішньої блок-схеми, але ми сподіваємося, що скоро зможемо додати підтримку!

source: These item flows capture the essential interactions and exchanges within the espresso machine. They represent the flow of water, control signals, temperature feedback, and the resulting coffee water mixture. The item flows illustrate the sequence and connections between the various components, allowing for a better understanding of how the machine functions as a whole.
fr: Ces flux reflètent les interactions et les échanges essentiels au sein de la machine à espresso. Ils représentent le flux d'eau, les signaux de commande, le retour de température et le mélange d'eau et de café qui en résulte. Les flux d'éléments illustrent la séquence et les connexions entre les différents composants, ce qui permet de mieux comprendre le fonctionnement de la machine dans son ensemble.
ta: இந்த உருப்படி பாய்ச்சல்கள் எச்பிரெசோ கணினியில் உள்ள அத்தியாவசிய தொடர்புகளையும் பரிமாற்றங்களையும் கைப்பற்றுகின்றன. அவை நீரின் ஓட்டம், கட்டுப்பாட்டு சமிக்ஞைகள், வெப்பநிலை பின்னூட்டங்கள் மற்றும் அதன் விளைவாக வரும் காபி நீர் கலவையை குறிக்கின்றன. உருப்படி பாய்கிறது பல்வேறு கூறுகளுக்கு இடையிலான வரிசை மற்றும் இணைப்புகளை விளக்குகிறது, இது இயந்திரம் ஒட்டுமொத்தமாக எவ்வாறு செயல்படுகிறது என்பதைப் பற்றி நன்கு புரிந்துகொள்ள அனுமதிக்கிறது.
uk: Ці потоки елементів відображають основні взаємодії та обміни всередині еспресо-машини. Вони представляють потік води, сигнали керування, зворотний зв'язок по температурі та отриману кавово-водяну суміш. Потоки елементів ілюструють послідовність і зв'язки між різними компонентами, що дає змогу краще зрозуміти, як функціонує кавомашина в цілому.

source: Once again, help the ants by updating the Logical Boundary diagram so that it matches the one above.
fr: Une fois de plus, aidez les fourmis en mettant à jour le diagramme des Frontières Logiques afin qu'il corresponde au diagramme ci-dessus.
ta: மீண்டும், தருக்க எல்லை வரைபடத்தை புதுப்பிப்பதன் மூலம் எறும்புகளுக்கு உதவுங்கள், இதனால் மேலே உள்ளவற்றுடன் பொருந்துகிறது.
uk: Знову допоможіть мурахам, оновивши схему логічної межі так, щоб вона відповідала наведеній вище.

source: Logical Requirements
fr: Exigences logiques
ta: தர்க்கரீதியான தேவைகள்
uk: Логічні вимоги

source: Logical requirements refer to the high-level specifications and functionalities that describe what a system or product should accomplish without specifying how it will be implemented. These requirements focus on the desired outcomes and behavior of the system rather than the specific technical details.
fr: Les exigences logiques font référence aux spécifications et fonctionnalités de haut niveau qui décrivent ce qu'un système ou un produit doit accomplir sans spécifier comment il sera mis en œuvre. Ces exigences se concentrent sur les résultats et le comportement souhaités du système plutôt que sur les détails techniques spécifiques.
ta: தர்க்கரீதியான தேவைகள் ஒரு அமைப்பு அல்லது தயாரிப்பு எவ்வாறு செயல்படுத்தப்படும் என்பதைக் குறிப்பிடாமல் எதைச் சாதிக்க வேண்டும் என்பதை விவரிக்கும் உயர் மட்ட விவரக்குறிப்புகள் மற்றும் செயல்பாடுகளைக் குறிக்கின்றன. இந்த தேவைகள் குறிப்பிட்ட தொழில்நுட்ப விவரங்களை விட கணினியின் விரும்பிய முடிவுகள் மற்றும் நடத்தைகளில் கவனம் செலுத்துகின்றன.
uk: Логічні вимоги - це високорівневі специфікації та функціональні можливості, які описують, що повинна виконувати система або продукт, не вказуючи, як це буде реалізовано. Ці вимоги зосереджені на бажаних результатах і поведінці системи, а не на конкретних технічних деталях.

source: We have also already defined the behavior and the structure of the espresso machine at the logical level, so the main task now is to translate that information in to words as requirement statements.
fr: Nous avons également déjà défini le comportement et la structure de la machine à espresso au niveau logique, et la tâche principale consiste maintenant à traduire ces informations en termes d'exigences.
ta: எச்பிரெசோ இயந்திரத்தின் நடத்தை மற்றும் கட்டமைப்பை தர்க்கரீதியான மட்டத்தில் நாங்கள் ஏற்கனவே வரையறுத்துள்ளோம், எனவே இப்போது முக்கிய பணி அந்த தகவல்களை சொற்களுக்கு தேவை அறிக்கைகளாக மொழிபெயர்ப்பதாகும்.
uk: Ми також уже визначили поведінку та структуру еспресо-машини на логічному рівні, тому зараз головним завданням є переклад цієї інформації словами у вигляді вимог.

source: If you need help writing good requirements, the [INCOSE Guide to Needs and Requirements](https://portal.incose.org/commerce/store?productId=INCOSE-GUIDENEEDSREQ) and the [Easy Approach to Requirements Syntax](https://alistairmavin.com/ears/) are recommended resources.
fr: Si vous avez besoin d'aide pour rédiger de bonnes exigences, le [INCOSE Guide to Needs and Requirements] (https://portal.incose.org/commerce/store?productId=INCOSE-GUIDENEEDSREQ) et le [Easy Approach to Requirements Syntax] (https://alistairmavin.com/ears/) sont des ressources recommandées.
ta: நல்ல தேவைகளை எழுத உங்களுக்கு உதவி தேவைப்பட்டால், [தேவைகள் மற்றும் தேவைகளுக்கான வழிகாட்டி](https://portal.incose.org/commerce/store?productid=incose-guideneedsreq) மற்றும் [தேவைகள் தொடரியல்](https://alistairmavin.com/ears/) ஆகியோர் பரிந்துரைக்கப்பட்ட வளங்கள்.
uk: Якщо вам потрібна допомога у написанні хороших вимог, рекомендуємо скористатися [INCOSE Guide to Needs and Requirements] (https://portal.incose.org/commerce/store?productId=INCOSE-GUIDENEEDSREQ) та [Easy Approach to Requirements Syntax] (https://alistairmavin.com/ears/).

source: We use the Derive Requirement relation from the Logical Requirement to the Concept Requirements that we previously created. The direction of this relationship is in the derived from direction, which might be opposite to what you are used to where the higher level requirement points to the lower level requirement.
fr: Nous utilisons la relation 'Exigence dérivée' de "l'Exigence logique" vers les 'Exigences conceptuelles' que nous avons créées précédemment. La direction de cette relation est celle de la dépendance, ce qui peut être contraire à ce que vous avez l'habitude de faire, à savoir que l'exigence de niveau supérieur pointe vers l'exigence de niveau inférieur.
ta: தர்க்கரீதியான தேவையிலிருந்து நாம் முன்னர் உருவாக்கிய கருத்துத் தேவைகள் வரை பெறப்பட்ட தேவை உறவைப் பயன்படுத்துகிறோம். இந்த உறவின் திசை திசையிலிருந்து பெறப்பட்டதாக உள்ளது, இது உயர் மட்டத் தேவை கீழ் மட்டத் தேவையை சுட்டிக்காட்டுவதற்கு நீங்கள் பழகியதற்கு நேர்மாறாக இருக்கலாம்.
uk: Ми використовуємо зв'язок "Похідна вимога" від Логічної вимоги до Концептуальної вимоги, який ми створили раніше. Напрямок цього зв'язку є похідним від напрямку, який може бути протилежним тому, до якого ви звикли, коли вимога вищого рівня вказує на вимогу нижчого рівня.

source: Here we derive two requirements:
fr: Nous en déduisons deux exigences :
ta: இங்கே நாங்கள் இரண்டு தேவைகளைப் பெறுகிறோம்:
uk: Тут ми виводимо дві вимоги:

source: Controller commands heat up
fr: Le contrôleur commande la mise en température
ta: கட்டுப்படுத்தி கட்டளைகள் வெப்பம்
uk: Команди контролера нагріваються

source: 900kPa of water pressure
fr: pression de l'eau 900kPa
ta: 900KPA நீர் அழுத்தம்
uk: Тиск води 900 кПа

source: Logical requirements for the controller command and the water pressure derived from concept requirements
fr: Exigences logiques pour la commande du contrôleur et la pression de l'eau, dérivées des exigences du concept
ta: கட்டுப்பாட்டு கட்டளை மற்றும் கருத்து தேவைகளிலிருந்து பெறப்பட்ட நீர் அழுத்தம் ஆகியவற்றிற்கான தர்க்கரீதியான தேவைகள்
uk: Логічні вимоги до команд контролера та тиску води випливають із вимог концепції

source: Update the Logical Requirements diagram with these requirements. If you want, you can also develop additional requirements for all the logical behavior and structure that we specified in the other diagrams.
fr: Mettez à jour le diagramme des Exigences Logiques (Logical Requirements) en y ajoutant ces exigences. Si vous le souhaitez, vous pouvez également développer des exigences supplémentaires pour tous les comportements et structures logiques que nous avons spécifiés dans les autres diagrammes.
ta: இந்த தேவைகளுடன் தருக்க தேவைகள் வரைபடத்தைப் புதுப்பிக்கவும். நீங்கள் விரும்பினால், மற்ற வரைபடங்களில் நாங்கள் குறிப்பிட்ட அனைத்து தர்க்கரீதியான நடத்தை மற்றும் கட்டமைப்பிற்கும் கூடுதல் தேவைகளையும் உருவாக்கலாம்.
uk: Оновіть діаграму "Логічні вимоги" цими вимогами. Якщо ви хочете, ви також можете розробити додаткові вимоги для всієї логічної поведінки та структури, які ми визначили на інших діаграмах.

source: Coffee Machine: Summary
fr: Machine à café : résumé
ta: காபி இயந்திரம்: சுருக்கம்
uk: Кавоварка: Резюме

source: The Technology Level design uses a very similar approach as the Logical Level. Work on the behavior, structure, and then the requirements. At this level, you will now specify all the design details for how this specific espresso machine will work. We'll leave this exercise up to you to do, and we would be glad to have contributions of this design back in to this tutorial if you are interested in getting involved in Gaphor.
fr: La conception au Niveau Technologique (Technology Level) utilise une approche très similaire à celle du Niveau Logique (Locical Level). Travaillez sur le comportement, la structure, puis les exigences. À ce niveau, vous allez maintenant spécifier tous les détails de la conception du fonctionnement de cette machine à espresso spécifique. Nous vous laissons le soin de faire cet exercice, et nous serions heureux de recevoir des contributions de cette conception dans ce tutoriel si vous souhaitez vous impliquer dans Gaphor.
ta: தொழில்நுட்ப நிலை வடிவமைப்பு தர்க்கரீதியான மட்டமாக மிகவும் ஒத்த அணுகுமுறையைப் பயன்படுத்துகிறது. நடத்தை, கட்டமைப்பு மற்றும் பின்னர் தேவைகள் குறித்து வேலை செய்யுங்கள். இந்த மட்டத்தில், இந்த குறிப்பிட்ட எச்பிரெசோ இயந்திரம் எவ்வாறு செயல்படும் என்பதற்கான அனைத்து வடிவமைப்பு விவரங்களையும் இப்போது குறிப்பிடுவீர்கள். இந்த பயிற்சியை நாங்கள் உங்களிடம் விட்டுவிடுவோம், மேலும் இந்த வடிவமைப்பின் பங்களிப்புகளை இந்த டுடோரியலில் மீண்டும் பெறுவதில் நாங்கள் மகிழ்ச்சியடைவோம்.
uk: На технологічному рівні проектування використовується дуже схожий підхід, як і на логічному рівні. Попрацюйте над поведінкою, структурою, а потім над вимогами. На цьому рівні ви визначаєте всі деталі проектування того, як буде працювати ця конкретна еспресо-кавоварка. Ми залишаємо цю вправу на ваше розсуд, і ми будемо раді, якщо ви повернетеся до цього підручника, якщо ви зацікавлені в участі в Gaphor.
