Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: Paste a copy of the Presentation element to the diagram, but try to link the underlying model element. A shallow copy.
fr: Collez une copie de l'élément Présentation dans le diagramme, mais essayez de lier l'élément de modèle sous-jacent. Une copie succinte.
ta: விளக்கக்காட்சி உறுப்பின் நகலை வரைபடத்திற்கு ஒட்டவும், ஆனால் அடிப்படை மாதிரி உறுப்பை இணைக்க முயற்சிக்கவும். ஒரு ஆழமற்ற நகல்.
uk: Вставте копію елемента Presentation на діаграму, але спробуйте зв’язати базовий елемент моделі. Неглибока копія.

source: Paste a copy of both Presentation and model element. A deep copy.
fr: Coller une copie de la présentation et de l'élément de modèle. Une copie approfondie.
ta: விளக்கக்காட்சி மற்றும் மாதிரி உறுப்பு இரண்டின் நகலை ஒட்டவும். ஒரு ஆழமான நகல்.
uk: Вставте копію презентації та елемента моделі. Глибока копія.

source: Grouping
es: Agrupación
fr: Regroupement
ta: தொகுத்தல்
uk: Групування

source: Grouping is done by dragging one item on top of another, in a diagram or in the tree view.
es: La agrupación se realiza arrastrando un elemento sobre otro, en un diagrama o en la vista en árbol.
fr: Le regroupement s'effectue en faisant glisser un élément sur un autre, dans un diagramme ou dans l'arborescence.
ta: ஒரு உருப்படியை மற்றொன்றின் மேல், ஒரு வரைபடத்தில் அல்லது மரத்தின் பார்வையில் இழுப்பதன் மூலம் குழுமம் செய்யப்படுகிறது.
uk: Групування здійснюється шляхом перетягування одного елемента поверх іншого, на діаграмі чи в ієрархічній панелі.

source: Return the owner for `element`. The owner may be `Root`, denoting the element should be placed in the root of the ownership hierarchy. If `None` is returned, there is no owner.
fr: Retourne le propriétaire de l'élément. Il peut s'agir de `Root`, indiquant que l'élément doit être placé à la racine de la hiérarchie de propriété. Si None est retourné, il n'y a pas de propriétaire.
ta: `உறுப்பு` உரிமையாளரைத் திருப்பித் தரவும். உரிமையாளர் `ரூட்` ஆக இருக்கலாம், உறுப்பைக் குறிக்கும் உரிமையாளர் வரிசைக்கு வேரில் வைக்கப்பட வேண்டும். `எதுவுமில்லை 'திரும்பப் பெறவில்லை என்றால், உரிமையாளர் இல்லை.
uk: Повернути власника для `element`. Власником може бути `Root`, що означає, що елемент має бути розміщено в корені ієрархії власності. Якщо повернено `None`, власника немає.

source: Returns all elements owned by `element
fr: Retourne tous les éléments appartenant à `element
ta: `உறுப்புக்கு சொந்தமான அனைத்து கூறுகளையும் வழங்குகிறது
uk: Повертає всі елементи, що належать `element

source: Group an element in a parent element. The grouping can be based on ownership, but other types of grouping are also possible.
es: Agrupa un elemento en un elemento padre. La agrupación puede basarse en la propiedad, pero también son posibles otros tipos de agrupación.
fr: Un élément peut être regroupé dans un élément parent. Ce regroupement peut être basé sur la propriété, mais d'autres types de regroupement sont également possibles.
ta: பெற்றோர் உறுப்பில் ஒரு உறுப்பு குழு. தொகுத்தல் உரிமையை அடிப்படையாகக் கொண்டது, ஆனால் பிற வகை குழுக்களும் சாத்தியமாகும்.
uk: Згрупуйте елемент у батьківському елементі. Групування може базуватися на власності, але можливі й інші типи групування.

source: Remove the grouping from an element. The function needs to check if the provided `parent` node is the right one.
es: Elimina la agrupación de un elemento. La función necesita comprobar si el nodo `parent` proporcionado es el correcto.
fr: Supprime le regroupement d'un élément. La fonction doit vérifier si le nœud `parent` fourni est le bon.
ta: ஒரு உறுப்பிலிருந்து குழுவை அகற்றவும். வழங்கப்பட்ட `பெற்றோர்` முனை சரியானதா என்பதை செயல்பாடு சரிபார்க்க வேண்டும்.
uk: Видалити групування з елемента. Функція повинна перевірити, чи наданий `батьківський` вузол є правильним.

source: This function tries to determine if grouping is possible, without actually performing a group operation. This is not 100% accurate.
es: Esta función intenta determinar si la agrupación es posible, sin realizar realmente una operación de agrupación. Esto no es 100% preciso.
fr: Cette fonction tente de déterminer si le regroupement est possible sans pour autant effectuer l'opération en question. Elle n'est pas précise à 100 %.
ta: இந்த செயல்பாடு உண்மையில் ஒரு குழு செயல்பாட்டைச் செய்யாமல், குழுமம் சாத்தியமா என்பதை தீர்மானிக்க முயற்சிக்கிறது. இது 100% துல்லியமாக இல்லை.
uk: Ця функція намагається визначити, чи можливе групування, фактично не виконуючи групову операцію. Це не 100% точне.

source: Dropping
es: Soltando
fr: Dépose
ta: கைவிடுதல்
uk: Падіння

source: Dropping is performed by dragging an element from the tree view and drop it on a diagram. This is an easy way to extend a diagram with already existing model elements.
es: El soltado se realiza arrastrando un elemento desde la vista de árbol y soltándolo en un diagrama. Se trata de una forma sencilla de ampliar un diagrama con elementos de modelo ya existentes.
fr: Le dépôt s'effectue en faisant glisser un élément de l'arborescence et en le déposant sur un diagramme. Il s'agit d'un moyen facile d'ajouter des éléments de modèle déjà existants à un diagramme.
ta: மரக் காட்சியில் இருந்து ஒரு உறுப்பை இழுத்து ஒரு வரைபடத்தில் கைவிடுவதன் மூலம் கைவிடப்படுகிறது. ஏற்கனவே இருக்கும் மாதிரி கூறுகளுடன் வரைபடத்தை நீட்டிக்க இது ஒரு எளிதான வழியாகும்.
uk: Відкидання виконується шляхом перетягування елемента з перегляду дерева та перетягування його на діаграму. Це простий спосіб розширити діаграму за допомогою вже існуючих елементів моделі.

source: Alternatively, a presentation item can be dropped on top of another element.
fr: Il est également possible de déposer un élément de présentation au-dessus d'un autre élément.
ta: மாற்றாக, விளக்கக்காட்சி உருப்படியை மற்றொரு உறுப்புக்கு மேல் கைவிடலாம்.
uk: Крім того, елемент презентації можна опустити поверх іншого елемента.

source: The drop function creates a new presentation for an element on the diagram, if the element is not a presentation yet. For relationships, a drop only works if both connected elements are present in the same diagram.
fr: La fonction « drop » crée une nouvelle présentation pour un élément du diagramme qui n'en est pas encore une. Pour les relations, un dépôt ne fonctionne que si les deux éléments connectés sont présents dans le même diagramme.
ta: உறுப்பு இன்னும் விளக்கக்காட்சியாக இல்லாவிட்டால், வரைபடத்தில் ஒரு உறுப்புக்கான புதிய விளக்கக்காட்சியை துளி செயல்பாடு உருவாக்குகிறது. உறவுகளுக்கு, இணைக்கப்பட்ட இரண்டு கூறுகளும் ஒரே வரைபடத்தில் இருந்தால் மட்டுமே ஒரு துளி செயல்படும்.
uk: Функція drop створює нове представлення для елемента на діаграмі, якщо він ще не є представленням. Для зв'язків drop спрацьовує лише тоді, коли обидва зв'язані елементи присутні на одній діаграмі.

source: While grouping deals with connecting model elements, dropping deals with creating and placing presentation elements on the right item in a diagram.
fr: Alors que le regroupement permet d'articuler les éléments du modèle, le dépôt permet de créer et de placer les éléments de présentation au bon endroit dans un diagramme.
ta: மாதிரி கூறுகளை இணைப்பதைக் கையாளும் போது, விளக்கக்காட்சி கூறுகளை ஒரு வரைபடத்தில் சரியான உருப்படியில் உருவாக்குதல் மற்றும் வைப்பது ஆகியவற்றுடன் ஒப்பந்தங்களை கைவிடுதல்.
uk: У той час як групування стосується з’єднання елементів моделі, видалення має справу зі створенням і розміщенням елементів презентації на правому елементі діаграми.

source: Automated model cleanup
es: Limpieza automática de modelos
fr: Nettoyage automatisé des modèles
ta: தானியங்கு மாதிரி தூய்மைப்படுத்துதல்
uk: Автоматизоване очищення моделі

source: Gaphor wants to keep the model in sync with the diagrams.
es: Gaphor quiere mantener el modelo sincronizado con los diagramas.
fr: Gaphor souhaite maintenir le modèle synchronisé avec les diagrammes.
ta: வரைபடங்களுடன் ஒத்திசைவாக மாதிரியை வைத்திருக்க காஃபர் விரும்புகிறார்.
uk: Gaphor хоче, щоб модель була синхронізована з діаграмами.

source: A little dispatch function is used to determine if a model element can be removed.
es: Se usa una pequeña función de envío para determinar si se puede eliminar un elemento del modelo.
fr: Une petite fonction d'envoi permet de déterminer si un élément du modèle peut être retiré.
ta: ஒரு மாதிரி உறுப்பை அகற்ற முடியுமா என்பதை தீர்மானிக்க ஒரு சிறிய அனுப்புதல் செயல்பாடு பயன்படுத்தப்படுகிறது.
uk: Невелика функція диспетчеризації використовується, щоб визначити, чи можна видалити елемент моделі.

source: Determine if a model element can safely be removed.
es: Determina si un elemento del modelo puede eliminarse con seguridad.
fr: Détermine si un élément du modèle peut être retiré en toute sécurité.
ta: ஒரு மாதிரி உறுப்பை பாதுகாப்பாக அகற்ற முடியுமா என்பதை தீர்மானிக்கவும்.
uk: Визначте, чи можна безпечно видалити елемент моделі.

source: Property Editor pages
fr: Pages de l'éditeur de propriétés
ta: சொத்து எடிட்டர் பக்கங்கள்
uk: Сторінки редактора властивостей

source: The editor page is constructed from snippets. For example: almost each element has a name, so there is a UI snippet that allows you to edit a name.
es: La página del editor se construye a partir de fragmentos. Por ejemplo: casi todos los elementos tienen un nombre, por lo que hay un fragmento de IU que permite editar un nombre.
fr: La page de l'éditeur est composée d'extraits. Par exemple, presque chaque élément a un nom, et un élément d'interface utilisateur vous permet donc d'éditer un nom.
ta: ஆசிரியர் பக்கம் துணுக்குகளிலிருந்து கட்டப்பட்டுள்ளது. எடுத்துக்காட்டாக: கிட்டத்தட்ட ஒவ்வொரு உறுப்புக்கும் ஒரு பெயர் உள்ளது, எனவே ஒரு பெயரைத் திருத்த அனுமதிக்கும் இடைமுகம் துணுக்கை உள்ளது.
uk: Сторінка редактора складається з фрагментів. Наприклад: майже кожен елемент має назву, тому є фрагмент інтерфейсу користувача, який дозволяє редагувати назву.

source: Each property page (snippet) should inherit from `PropertyPageBase`.
es: Cada página de propiedades (fragmento) debe heredar de `PropertyPageBase`.
fr: Chaque page de propriété (snippet) doit hériter de `PropertyPageBase`.
ta: ஒவ்வொரு சொத்து பக்கமும் (துணுக்கை) `propertyPageBase` இலிருந்து பெற வேண்டும்.
uk: Кожна сторінка властивостей (фрагмент) має успадкувати від `PropertyPageBase`.

source: A property page which can display itself in a notebook.
es: Una página de propiedades que puede mostrarse en un cuaderno.
fr: Une page de propriété qui peut s'afficher dans un bloc-notes.
ta: ஒரு நோட்புக்கில் தன்னைக் காண்பிக்கக்கூடிய ஒரு சொத்து பக்கம்.
uk: Сторінка властивостей, яка може відображатися в блокноті.

source: Create the page (Gtk.Widget) that belongs to the Property page.
es: Crea la página (Gtk.Widget) que pertenece a la página propiedad.
fr: Créer la page (Gtk.Widget) qui appartient à la page de propriété.
ta: சொத்து பக்கத்திற்கு சொந்தமான பக்கத்தை (gtk.widget) உருவாக்கவும்.
uk: Створіть сторінку (Gtk.Widget), яка належить до сторінки властивостей.

source: Returns the page's toplevel widget (Gtk.Widget).
es: Devuelve el widget de nivel superior de la página (Gtk.Widget).
fr: Renvoie le widget de premier niveau de la page (Gtk.Widget).
ta: பக்கத்தின் டோப்ல்வெல் விட்செட்டை (gtk.widget) வழங்குகிறது.
uk: Повертає віджет верхнього рівня сторінки (Gtk.Widget).

source: Instant (diagram) editor popups
es: Ventanas emergentes instantáneas del editor (de diagramas)
fr: Fenêtres contextuelles instantanées de l'éditeur (de diagrammes)
ta: உடனடி (வரைபடம்) எடிட்டர் பாப்அப்கள்
uk: Спливаючі вікна редактора миттєвих (схем)

source: When you double-click on an item in a diagram, a popup can show up, so you can easily change the name.
fr: Lorsque vous double-cliquez sur un élément d'un diagramme, une fenêtre contextuelle peut s'afficher, ce qui vous permet de modifier facilement le nom.
ta: ஒரு வரைபடத்தில் உள்ள ஒரு உருப்படியை நீங்கள் இருமுறை சொடுக்கு செய்யும்போது, ஒரு பாப்அப் காண்பிக்க முடியும், எனவே நீங்கள் பெயரை எளிதாக மாற்றலாம்.
uk: Коли ви двічі клацаєте елемент на діаграмі, може з’явитися спливаюче вікно, тож ви можете легко змінити назву.

source: By default, this works for any named element. You can register your own inline editor function if you need to.
fr: Par défaut, cela fonctionne pour tout élément nommé. Vous pouvez enregistrer votre propre fonction d'édition en ligne si nécessaire.
ta: இயல்பாக, இது பெயரிடப்பட்ட எந்த உறுப்புக்கும் வேலை செய்கிறது. உங்களுக்குத் தேவைப்பட்டால் உங்கள் சொந்த இன்லைன் எடிட்டர் செயல்பாட்டை பதிவு செய்யலாம்.
uk: За замовчуванням це працює для будь-якого іменованого елемента. За потреби ви можете зареєструвати власну функцію вбудованого редактора.

source: Show a small editor popup in the diagram. Makes for easy editing without resorting to the Element editor.
es: Muestra una pequeña ventana emergente del editor en el diagrama. Facilita la edición sin recurrir al editor de elementos.
fr: Affiche une petite fenêtre d'édition dans le diagramme. Permet de faciliter l'édition sans avoir recours à l'éditeur d'éléments.
ta: வரைபடத்தில் ஒரு சிறிய எடிட்டர் பாப்அப்பைக் காட்டு. உறுப்பு எடிட்டரை நாடாமல் எளிதாக திருத்துதல் செய்ய உதவுகிறது.
uk: Показати невелике спливаюче вікно редактора на схемі. Спрощує редагування, не вдаючись до редактора елементів.

source: In case of a mouse press event, the mouse position (relative to the element) are also provided.
es: En el caso de un evento de pulsación del ratón, también se proporciona la posición del ratón (relativa al elemento).
fr: Dans le cas d'un clic de la souris, la position de la souris (par rapport à l'élément) est également fournie.
ta: சுட்டி செய்தித் தாள் நிகழ்வின் போது, சுட்டி நிலையும் (உறுப்புடன் தொடர்புடையது) வழங்கப்படுகிறது.
uk: У разі події натискання миші також надається положення миші (відносно елемента).

source: The C4 Model
fr: Le Modèle C4
ta: அந்த சி4 மாதிரி
uk: Модель C4

source: The [C4 model](https://c4model.com/) is a simple visual language to describe the static structure of a software system.
es: El [modelo C4](https://c4model.com/) es un lenguaje visual sencillo para describir la estructura estática de un sistema de software.
fr: Le [modèle C4] (https://c4model.com/) est un langage visuel simple permettant de décrire la structure statique d'un système logiciel.
ta: [C4 மாதிரி](https://c4model.com/) என்பது ஒரு மென்பொருள் அமைப்பின் நிலையான கட்டமைப்பை விவரிக்க எளிய காட்சி மொழியாகும்.
uk: [Модель C4](https://c4model.com/) — це проста візуальна мова для опису статичної структури програмної системи.

source: It’s based on the [UML](uml.md) language.
es: Se basa en el lenguaje [UML](uml.md).
fr: Il est basé sur le langage [UML](uml.md).
ta: இது [யுஎம்எல்](uml.md) மொழியை அடிப்படையாகக் கொண்டது.
uk: Він заснований на мові [UML](uml.md).

source: Modeling Language Core
es: Lenguaje de modelado básico
fr: Noyau du langage de modélisation
ta: மாடலிங் மொழி கோர்
uk: Ядро мови моделювання

source: The Core modeling language is the the basis for any other language.
es: El lenguaje de modelado Core es la base de cualquier otro lenguaje.
fr: Le noyau du langage de modélisation est la base de tout autre langage.
ta: முக்கிய மாடலிங் மொழி வேறு எந்த மொழிக்கும் அடிப்படையாகும்.
uk: Мова моделювання Core є основою для будь-якої іншої мови.

source: The :obj:`~gaphor.core.modeling.Base` class acts as the root for all gaphor domain classes. :obj:`~gaphor.core.modeling.Diagram` and :obj:`~gaphor.core.modeling.Presentation` form the basis for everything you see in a diagram.
fr: La classe :obj:`~gaphor.core.modeling.Base` est la racine de toutes les classes du domaine gaphor. :obj:`~gaphor.core.modeling.Diagram` et :obj:`~gaphor.core.modeling.Presentation` forment la base de tout ce que vous voyez dans un diagramme.
ta: :obj:`~gaphor.core.modeling.Base` வகுப்பு அனைத்து gaphor டொமைன் வகுப்புகளுக்கும் மூலக்கூறாகச் செயல்படுகிறது. :obj:`~gaphor.core.modeling.Diagram` மற்றும் :obj:`~gaphor.core.modeling.Presentation` ஆகியவை ஒரு வரைபடத்தில் நீங்கள் காணும் அனைத்திற்கும் அடிப்படையாக அமைகின்றன.
uk: Клас :obj:`~gaphor.core.modeling.Base` діє як корінь для всіх класів домену gaphor. :obj:`~gaphor.core.modeling.Diagram` та :obj:`~gaphor.core.modeling.Presentation` формують основу для всього, що ви бачите на діаграмі.

source: All data models in Gaphor are generated from actual Gaphor model files. This allows us to provide you nice diagrams of Gaphor’s internal model.
es: Todos los modelos de datos en Gaphor se generan a partir de archivos de modelo reales de Gaphor. Esto nos permite ofrecerle bonitos diagramas del modelo interno de Gaphor.
fr: Tous les modèles de données de Gaphor sont générés à partir des fichiers de modèles réels de ce dernier. Cela nous permet de vous fournir de beaux diagrammes du modèle interne de Gaphor.
ta: GAPHOR இல் உள்ள அனைத்து தரவு மாதிரிகள் உண்மையான GAPHOR மாதிரி கோப்புகளிலிருந்து உருவாக்கப்படுகின்றன. கஃபரின் உள் மாதிரியின் நல்ல வரைபடங்களை உங்களுக்கு வழங்க இது எங்களை அனுமதிக்கிறது.
uk: Усі моделі даних у Gaphor генеруються з фактичних файлів моделей Gaphor. Це дозволяє нам надати вам гарні діаграми внутрішньої моделі Gaphor.

source: The core model with presentation classes
fr: Le modèle de base avec les classes de présentation
ta: விளக்கக்காட்சி வகுப்புகளுடன் முக்கிய மாதிரி
uk: Основна модель із презентаційними класами

source: The ``Base`` Class
fr: La classe ``Base``
ta: ``Base`` வகுப்பு
uk: Клас ``Базовий``

source: The :obj:`~gaphor.core.modeling.Base` class provides event notification and integrates with the model repository (internally known as :obj:`~gaphor.core.modeling.ElementFactory`). All classes in a model should derive from this class. If a model does not show a base class for an element, it will derive from :obj:`~gaphor.core.modeling.Base`. Bi-directional relationships are also possible, as well as derived relations.
fr: La classe :obj:`~gaphor.core.modeling.Base` fournit des notifications d'événements et s'intègre au référentiel de modèles (connu en interne sous le nom de :obj:`~gaphor.core.modeling.ElementFactory`). Toutes les classes d'un modèle doivent dériver de cette classe. Si un modèle n'indique pas de classe de base pour un élément, il dérivera de :obj:`~gaphor.core.modeling.Base`. Les relations bidirectionnelles sont également possibles, de même que les relations dérivées.
ta: :obj:`~gaphor.core.modeling.Base` வகுப்பு நிகழ்வு அறிவிப்பை வழங்குகிறது மற்றும் மாதிரி களஞ்சியத்துடன் ஒருங்கிணைக்கிறது (உள்நாட்டில் :obj:`~gaphor.core.modeling.ElementFactory` என அழைக்கப்படுகிறது). ஒரு மாதிரியில் உள்ள அனைத்து வகுப்புகளும் இந்த வகுப்பிலிருந்து பெறப்பட வேண்டும். ஒரு மாதிரி ஒரு உறுப்புக்கான அடிப்படை வகுப்பைக் காட்டவில்லை என்றால், அது :obj:`~gaphor.core.modeling.Base` இலிருந்து பெறப்படும். இரு திசை உறவுகளும் சாத்தியமாகும், அதே போல் பெறப்பட்ட உறவுகளும் சாத்தியமாகும்.
uk: Клас :obj:`~gaphor.core.modeling.Base` забезпечує сповіщення про події та інтегрується з репозиторієм моделі (внутрішньо відомий як :obj:`~gaphor.core.modeling.ElementFactory`). Всі класи в моделі повинні бути похідними від цього класу. Якщо модель не показує базовий клас для елемента, він буде похідним від :obj:`~gaphor.core.modeling.Base`. Можливі також двонаправлені зв'язки, а також похідні зв'язки.

source: The :obj:`~gaphor.core.modeling.base.RepositoryProtocol`, and :obj:`~gaphor.core.modeling.base.EventWatcherProtocol` protocols are important to connect the model to the repository and event handling mechanisms.
fr: Les protocoles :obj:`~gaphor.core.modeling.base.RepositoryProtocol`, et :obj:`~gaphor.core.modeling.base.EventWatcherProtocol` sont importants pour connecter le modèle au référentiel et aux mécanismes de gestion des événements.
ta: மாதிரியை களஞ்சியத்துடனும் நிகழ்வு கையாளும் வழிமுறைகளுடனும் இணைக்க :obj:`~gaphor.core.modeling.base.RepositoryProtocol`, மற்றும் :obj:`~gaphor.core.modeling.base.EventWatcherProtocol` நெறிமுறைகள் முக்கியமானவை.
uk: Протоколи :obj:`~gaphor.core.modeling.base.RepositoryProtocol` та :obj:`~gaphor.core.modeling.base.EventWatcherProtocol` важливі для підключення моделі до сховища та механізмів обробки подій.

source: The class ``Base`` is the core of Gaphor’s data model.
fr: La classe ``Base`` est le cœur du modèle de données de Gaphor.
ta: வகுப்பு ``Base`` என்பது காஃபரின் தரவு மாதிரியின் மையமாகும்.
uk: Клас ``Base`` є ядром моделі даних Gaphor.

source: Base class for all model data classes.
fr: Classe de base pour toutes les classes de données de modèle.
ta: அனைத்து மாதிரி தரவு வகுப்புகளுக்கான அடிப்படை வகுப்பு.
uk: Базовий клас для всіх класів даних моделі.

source: An id (read-only), unique within the model.
fr: Un identifiant (en lecture seule), unique dans le modèle.
ta: ஒரு ஐடி (படிக்க மட்டும்), மாதிரியில் தனித்துவமானது.
uk: Ідентифікатор (тільки для читання), унікальний у моделі.

source: The owning model, raises :class:`TypeError` when model is not set.
fr: Le modèle propriétaire, génère :class:`TypeError` si le modèle n'est pas défini.
ta: மாடல் அமைக்கப்படாதபோது, சொந்த மாதிரி :class:`TypeError` ஐ எழுப்புகிறது.
uk: Модель власника викликає :class:`TypeError`, коли модель не встановлено.

source: Unlink the element.
fr: Dissocier l'élément.
ta: உறுப்பை இணைக்கவும்.
uk: Від’єднайте елемент.

source: All the elements references are destroyed. For composite associations, the associated elements are also unlinked.
fr: Toutes les références des éléments sont alors supprimées. Les éléments associés des associations composites sont également dissociés.
ta: அனைத்து கூறுகளின் குறிப்புகளும் அழிக்கப்படுகின்றன. கலப்பு சங்கங்களுக்கு, தொடர்புடைய கூறுகளும் இணைக்கப்படவில்லை.
uk: Усі посилання на елементи знищуються. Для складених асоціацій асоційовані елементи також не пов’язані.

source: The unlink lock is acquired while unlinking this element's properties to avoid recursion problems.
fr: Le verrou de déconnexion est activé lors de la séparation des propriétés de l'élément afin d'éviter les problèmes de récursivité.
ta: மறுநிகழ்வு சிக்கல்களைத் தவிர்ப்பதற்காக இந்த உறுப்பின் பண்புகளை அவிழ்த்துவிடும்போது அன்லிங்க் பூட்டு பெறப்படுகிறது.
uk: Блокування від’єднання отримується під час від’єднання властивостей цього елемента, щоб уникнути проблем із рекурсією.

source: Event handling
fr: Gestion des événements
ta: நிகழ்வு கையாளுதல்
uk: Обробка подій

source: Propagate incoming events.
fr: Propager les événements entrants.
ta: உள்வரும் நிகழ்வுகளை பிரச்சாரம் செய்யுங்கள்.
uk: Поширювати вхідні події.

source: This only works if the element has been created by an :class:`~gaphor.core.modeling.ElementFactory`
fr: Cela ne fonctionne que si l'élément a été créé par une :class:`~gaphor.core.modeling.ElementFactory`
ta: உறுப்பு உருவாக்கப்பட்டிருந்தால் மட்டுமே இது செயல்படும் :class:`~gaphor.core.modeling.ElementFactory`
uk: Це працює, лише якщо елемент було створено :class:`~gaphor.core.modeling.ElementFactory`

source: Create a new watcher for this element.
fr: Créer un nouvel observateur pour cet élément.
ta: இந்த உறுப்புக்கு புதிய கண்காணிப்பாளரை உருவாக்கவும்.
uk: Створіть новий спостерігач для цього елемента.

source: Watchers provide a convenient way to get signalled when a property relative to ``self`` has been changed.
fr: Les observateurs fournissent un moyen pratique de recevoir un signal lorsqu'une propriété relative à ``self`` a été modifiée.
ta: ``self`` உடன் தொடர்புடைய ஒரு சொத்து மாற்றப்பட்டால் சமிக்ஞை செய்ய பார்வையாளர்கள் வசதியான வழியை வழங்குகிறார்கள்.
uk: Спостерігачі забезпечують зручний спосіб отримати сигнал, коли властивість відносно ``self`` була змінена.

source: To use a watcher, the element should be created by a properly wired up :class:`~gaphor.core.modeling.ElementFactory``.
fr: Pour utiliser un observateur, l'élément doit être créé par une :class:`~gaphor.core.modeling.ElementFactory`` correctement câblée.
ta: ஒரு பார்வையாளரைப் பயன்படுத்த, உறுப்பு ஒழுங்காக கம்பி மூலம் உருவாக்கப்பட வேண்டும் :class:`~gaphor.core.modeling.ElementFactory``.
uk: Щоб використовувати спостерігач, елемент має бути створений належним чином підключеним :class:`~gaphor.core.modeling.ElementFactory``.

source: This example is purely illustrative:
fr: Cet exemple est purement illustratif :
ta: இந்த எடுத்துக்காட்டு முற்றிலும் விளக்கமானது:
uk: Цей приклад є суто ілюстративним:
