Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: This is only applicable for the diagram
es: Esto solo es aplicable para el diagrama
fr: Ceci ne s'applique qu'au diagramme
ta: இது வரைபடத்திற்கு மட்டுமே பொருந்தும்
uk: Це стосується лише діаграми

source: A node is the first element among a group of sibling.
fr: Un nœud est le premier élément d'un groupe de frères et sœurs.
ta: உடன்பிறப்பு ஒரு குழுவில் ஒரு முனை முதல் உறுப்பு.
uk: Вузол є першим елементом у групі однорідних елементів.

source: The item contains any of the provided selectors.
es: El elemento contiene cualquiera de los selectores proporcionados.
fr: L'élément contient l'un des sélecteurs fournis.
ta: உருப்படியில் வழங்கப்பட்ட தேர்வாளர்கள் எவரும் உள்ளனர்.
uk: Елемент містить будь-який із наданих селекторів.

source: E.g. ``node:has(component)``: a node containing a component item.
es: P. ej., ``node:has(component)``: un nodo que contiene un elemento componente.
fr: Par exemple, ``node:has(component)`` : un noeud contenant un élément de composant.
ta: எ.கா. ``node:has(component)``: ஒரு கூறு உருப்படியைக் கொண்ட ஒரு முனை.
uk: наприклад ``node:has(component)``: вузол, що містить елемент компонента.

source: Match any of the provided selectors.
es: Coincide con cualquiera de los selectores proporcionados.
fr: Correspond à l'un des sélecteurs fournis.
ta: வழங்கப்பட்ட தேர்வாளர்களில் எவரையும் பொருத்தவும்.
uk: Зіставте будь-який із запропонованих селекторів.

source: E.g. ``:is(node, subsystem) > component``: a node or subsystem.
es: P. ej., ``:is(node, subsystem) > component``: un nodo o subsistema.
fr: Par exemple, ``:is(node, subsystem) > component`` : un nœud ou un sous-système.
ta: எ.கா. ``:is(node, subsystem) > component``: ஒரு முனை அல்லது துணை அமைப்பு.
uk: наприклад ``:is(node, subsystem) > component``: вузол або підсистема.

source: Negate the selector.
es: Negar el selector.
fr: Négation du sélecteur.
ta: தேர்வாளரை மறுக்கவும்.
uk: Відмінити селектор.

source: E.g. ``:not([subject])``: Any item that has no "subject".
es: P. ej., ``:not([subject])``: Cualquier elemento que no tenga "tema".
fr: Par exemple, ``:not([subject])`` : Tout élément qui n'a pas de "sujet ".
ta: எ.கா. ``:not([subject])``: "பொருள்" இல்லாத எந்தவொரு பொருளும்.
uk: наприклад ``:not([тема])``: будь-який елемент, який не має «теми».

source: Provide extra content after a text. Only the ``content`` property is supported.
fr: Fournit un contenu supplémentaire après un texte. Seule la propriété ``content`` est supportée.
ta: உரைக்குப் பிறகு கூடுதல் உள்ளடக்கத்தை வழங்கவும். ``content`` சொத்து மட்டுமே ஆதரிக்கப்படுகிறது.
uk: Додайте додатковий вміст після тексту. Підтримується лише властивість ``content``.

source: The official specification of [CSS3 attribute selectors](https://www.w3.org/TR/2018/REC-selectors-3-20181106/#attribute-selectors).
es: La especificación oficial de [CSS3 attribute selectors](https://www.w3.org/TR/2018/REC-selectors-3-20181106/#attribute-selectors).
fr: La spécification officielle des [sélecteurs d'attributs CSS3] (https://www.w3.org/TR/2018/REC-selectors-3-20181106/#attribute-selectors).
ta: The official specification of [CSS3 பண்புக்கூறு selectors](https://www.w3.org/TR/2018/REC-selectors-3-20181106/#attribute-selectors).
uk: Офіційна специфікація [селекторів атрибутів CSS3](https://www.w3.org/TR/2018/REC-selectors-3-20181106/#attribute-selectors).

source: Gaphor provides the `|=` attribute selector for the sake of completeness. It's probably not very useful in this context, though.
es: Gaphor proporciona el selector de atributos `|=` en aras de la exhaustividad. Sin embargo, probablemente no sea muy útil en este contexto.
fr: Gaphor fournit le sélecteur d'attribut `|=` par souci d'exhaustivité. Il n'est probablement pas très utile dans ce contexte.
ta: கஃபர் முழுமையின் பொருட்டு `| =` பண்புக்கூறு தேர்வாளரை வழங்குகிறது. இந்த சூழலில் இது மிகவும் பயனுள்ளதாக இல்லை.
uk: Gaphor надає селектор атрибутів `|=` для повноти. Хоча це, ймовірно, не дуже корисно в цьому контексті.

source: Please note that Gaphor CSS does not support IDs for diagram items, so the CSS syntax for IDs (`#some-id`) is not used. Also, class syntax (`.some-class`) is not supported currently.
es: Tenga en cuenta que Gaphor CSS no admite ID para elementos de diagrama, por lo que no se usa la sintaxis CSS para ID (`#some-id`). Además, la sintaxis de clase (`.some-class`) no está soportada actualmente.
fr: Veuillez noter que Gaphor CSS ne prend pas en charge les identifiants pour les éléments de diagramme, de sorte que la syntaxe CSS pour les identifiants (`#some-id`) n'est pas utilisée. De même, la syntaxe de classe (`.some-class`) n'est actuellement pas prise en charge.
ta: வரைபட உருப்படிகளுக்கான ஐடிகளை கஃபர் சிஎச்எச் ஆதரிக்காது என்பதை நினைவில் கொள்க, எனவே ஐடிகளுக்கான சிஎச்எச் தொடரியல் (`#சில-ஐடி`) பயன்படுத்தப்படவில்லை. மேலும், வகுப்பு தொடரியல் (`. சில வகுப்பு`) தற்போது ஆதரிக்கப்படவில்லை.
uk: Зауважте, що Gaphor CSS не підтримує ідентифікатори для елементів діаграми, тому синтаксис CSS для ідентифікаторів (`#some-id`) не використовується. Також наразі не підтримується синтаксис класу (`.some-class`).

source: Style properties
es: Propiedades de estilo
fr: Propriétés de style
ta: பாணி பண்புகள்
uk: Властивості стилю

source: Gaphor supports a subset of CSS properties and some Gaphor specific properties. The style sheet interpreter is relatively straight forward. All widths, heights, and sizes are measured in pixels. You can’t use complex style declarations, like the `font` property in HTML/CSS which can contain font family, size, weight.
es: Gaphor soporta un subconjunto de propiedades CSS y algunas propiedades específicas de Gaphor. El intérprete de hojas de estilo es relativamente sencillo. Todas las anchuras, alturas y tamaños se miden en píxeles. No se pueden usar declaraciones de estilo complejas, como la propiedad `font` en HTML/CSS que puede contener familia de fuentes, tamaño, peso.
fr: Gaphor prend en charge un sous-ensemble de propriétés CSS ainsi que quelques propriétés spécifiques à l'outil. L'interpréteur de feuilles de style est relativement simple. Toutes les largeurs, hauteurs et tailles sont exprimées en pixels. Il n'est pas possible d'utiliser des déclarations de style complexes, comme la propriété `font` en HTML/CSS qui peut contenir la famille, la taille et le poids de la police.
ta: சிஎச்எச் பண்புகள் மற்றும் சில காஃபர் குறிப்பிட்ட பண்புகளின் துணைக்குழுவை GAPHOR ஆதரிக்கிறது. பாணி சீட் மொழிபெயர்ப்பாளர் ஒப்பீட்டளவில் நேராக முன்னோக்கி உள்ளது. அனைத்து அகலங்களும், உயரங்களும் அளவுகளும் பிக்சல்களில் அளவிடப்படுகின்றன. எழுத்துரு குடும்பம், அளவு, எடை ஆகியவற்றைக் கொண்டிருக்கக்கூடிய HTML/CSS இல் உள்ள `எழுத்துரு` சொத்து போன்ற சிக்கலான பாணி அறிவிப்புகளை நீங்கள் பயன்படுத்த முடியாது.
uk: Gaphor підтримує підмножину властивостей CSS та деякі специфічні властивості Gaphor. Інтерпретатор таблиць стилів відносно простий. Всі ширини, висоти та розміри вимірюються у пікселях. Ви не можете використовувати складні оголошення стилів, такі як властивість `font` в HTML/CSS, яка може містити сімейство шрифтів, розмір, вагу.

source: Some properties are inherited from the parent style. The parent often is a diagram. When you set a `color`` or a `font-family` on `diagram`, it will propagate down to the items contained in the diagram.
fr: Certaines propriétés sont héritées du style parent. Le parent est souvent un diagramme. Lorsque vous définissez une `color`` ou une ``font-family` sur `diagram`, cela se propagera aux éléments contenus dans le diagramme.
ta: சில பண்புகள் பெற்றோர் பாணியிலிருந்து பெறப்பட்டவை. பெற்றோர் பெரும்பாலும் ஒரு வரைபடம். `வரைபடம்` இல்` வண்ணம்` அல்லது `எழுத்துரு-குடும்பம்` அமைக்கும் போது, அது வரைபடத்தில் உள்ள உருப்படிகளுக்கு பரவுகிறது.
uk: Деякі властивості успадковуються від батьківського стилю. Батько часто є діаграмою. Коли ви встановлюєте `color`` або `font-family` на `diagram`, вони поширюватимуться на елементи, які містяться на схемі.

source: Colors
es: Colores
fr: Couleurs
ta: நிறங்கள்
uk: Кольори

source: Examples:
es: Ejemplos:
fr: Exemples :
ta: எடுத்துக்காட்டுகள்:
uk: Приклади:

source: Color used for lines. *(inherited)*
fr: Couleur utilisée pour les lignes. *(hérité)*
ta: கோடுகளுக்குப் பயன்படுத்தப்படும் நிறம். *(மரபுரிமை)*
uk: Колір, який використовується для ліній. *(успадковано)*

source: Color for text. *(inherited)*
fr: Couleur du texte. *(hérité)*
ta: உரைக்கான நிறம். *(மரபுரிமை)*
uk: Колір для тексту. *(успадковано)*

source: Use color if possible.
fr: Utilisez la couleur si possible.
ta: முடிந்தால் வண்ணத்தைப் பயன்படுத்துங்கள்.
uk: Використовуйте колір, якщо це можливо.

source: Color opacity factor (``0.0`` - ``1.0``), applied to all colors.
es: Factor de opacidad del color (``0.0`` - ``1.0``), aplicado a todos los colores.
fr: Facteur d'opacité de la couleur (``0.0`` - ``1.0``), appliqué à toutes les couleurs.
ta: வண்ண ஒளிபுகா காரணி (``0.0`` - ``1.0``), எல்லா வண்ணங்களுக்கும் பயன்படுத்தப்படுகிறது.
uk: Коефіцієнт непрозорості кольору (``0,0`` - ``1,0``), застосований до всіх кольорів.

source: A color can be any [CSS3 color code](https://www.w3.org/TR/2018/REC-css-color-3-20180619/), as described in the CSS documentation. Gaphor supports all color notations: `rgb()`, `rgba()`, `hsl()`, `hsla()`, Hex code (`#ffffff`) and color names.
es: Un color puede ser cualquier [código de color CSS3](https://www.w3.org/TR/2018/REC-css-color-3-20180619/), como se describe en la documentación CSS. Gaphor soporta todas las notaciones de color: `rgb()`, `rgba()`, `hsl()`, `hsla()`, código hexadecimal (`#ffffff`) y nombres de color.
fr: Une couleur peut être n'importe quel [code couleur CSS3] (https://www.w3.org/TR/2018/REC-css-color-3-20180619/), comme décrit dans la documentation CSS. Gaphor supporte toutes les notations de couleur : `rgb()`, `rgba()`, `hsl()`, `hsla()`, le code hexagonal (`#ffffff`) et les noms de couleurs.
ta: சிஎச்எச் ஆவணத்தில் விவரிக்கப்பட்டுள்ளபடி, ஒரு வண்ணம் [CSS3 வண்ணக் குறியீடு](https://www.w3.org/tr/2018/REC-css-color-3-20180619/) இருக்கலாம். Kaphor அனைத்து வண்ணக் குறிப்புகளையும் ஆதரிக்கிறது: `rgb ()`, `rgba ()`, `hsl ()`, `hsla ()`, ஃச் குறியீடு (`#ffffff`) மற்றும் வண்ண பெயர்கள்.
uk: Колір може бути будь-яким [CSS3 колірним кодом](https://www.w3.org/TR/2018/REC-css-color-3-20180619/), як описано в документації CSS. Gaphor підтримує всі позначення кольорів: `rgb()`, `rgba()`, `hsl()`, `hsla()`, Hex-код (`#ffffff`) та назви кольорів.

source: Text and fonts
es: Texto y tipografías
fr: Texte et polices
ta: உரை மற்றும் எழுத்துருக்கள்
uk: Текст і шрифти

source: A single font name (e.g. ``sans``, ``serif``, ``courier``). *(inherited)*
fr: Un nom de police unique (par exemple ``sans``, ``serif``, ``courier``). *(inherited)*
ta: ஒரு எழுத்துரு பெயர் (எ.கா. ``sans``, ``serif``, ``courier``). *(மரபுரிமை)*
uk: Одна назва шрифту (наприклад, ``sans``, ``serif``, ``courier``). *(успадковано)*

source: An absolute size (e.g. ``14``) or a size value (e.g. ``small``). *(inherited)*
fr: Une taille absolue (par exemple ``14``) ou une valeur de taille (par exemple ``small``). *(inherited)*
ta: ஒரு முழுமையான அளவு (எ.கா. ``14``) அல்லது அளவு மதிப்பு (எ.கா. ``small``). *(மரபுரிமை)*
uk: Абсолютний розмір (наприклад, ``14``) або значення розміру (наприклад, ``small``). *(успадковано)*

source: Either ``normal`` or ``italic``. *(inherited)*
fr: Soit ``normal`` ou ``italic``. *(inherited)*
ta: ஒன்று ``normal`` அல்லது ``italic``. *(மரபுரிமை)*
uk: Або ``нормальний`` або ``курсив``. *(успадковано)*

source: Either ``normal`` or ``bold``. *(inherited)*
fr: Soit ``normal`` ou ``bold``. *(inherited)*
ta: normal`` இயல்பானது` அல்லது ``bold``. *(மரபுரிமை)*
uk: Або ``нормальний`` або ``жирний``. *(успадковано)*

source: Either ``left``, ``center``, ``right``. *(inherited)*
fr: Soit ``left``, ``center``, ``right``. *(inherited)*
ta: ஒன்று ``left``, ``center``, ``right``. *(மரபுரிமை)*
uk: Або ``ліворуч``, ``центр``, ``право``. *(успадковано)*

source: Either ``none`` or ``underline``.
es: Ya sea ``none`` o ``underline``.
fr: Soit ``none`` ou ``underline``.
ta: ஒன்று ``none` அல்லது ``underline``.
uk: Або ``немає`` або ``підкреслення``.

source: Vertical alignment for text.
es: Alineación vertical del texto.
fr: Alignement vertical du texte.
ta: உரைக்கான செங்குத்து சீரமைப்பு.
uk: Вертикальне вирівнювання тексту.

source: Either ``top``, ``middle`` or ``bottom``.
es: Ya sea ``top``, ``middle`` o ``bottom``.
fr: Soit ``top``, ``middle`` ou ``bottom``.
ta: ஒன்று ``top``, ``middle`` அல்லது ``bottom``.
uk: Або ``верх``, ``середина`` або ``низ``.

source: Set vertical spacing for icon-like items (actors, start state).
es: Establece el espaciado vertical para los elementos tipo icono (actores, estado inicial).
fr: Définir l'espacement vertical pour les éléments de type icône (acteurs, état de départ).
ta: படவுரு போன்ற உருப்படிகளுக்கு செங்குத்து இடைவெளியை அமைக்கவும் (நடிகர்கள், ச்டேட் ச்டேட்).
uk: Установіть вертикальний інтервал для піктограм (акторів, початкового стану).

source: Example: ``vertical-spacing: 4``.
es: Ejemplo: ``vertical-spacing: 4``.
fr: Exemple : ``vertical-spacing : 4``.
ta: எடுத்துக்காட்டு: ``vertical-spacing: 4``.
uk: Приклад: ``vertical-spacing: 4``.

source: Change the line wrapping behavior for text. *(inherited)*
fr: Modifie le comportement de retour à la ligne du texte. *(hérité)*
ta: உரைக்கான வரி மடக்குதல் நடத்தை மாற்றவும். *(மரபுரிமை)*
uk: Змініть поведінку переносу рядка для тексту. *(успадковано)*

source: `font-family` can be only one font name, not a list of (fallback) names, as is used for HTML.
es: `font-family` puede ser solo un nombre de tipografía, no una lista de nombres (fallback), como se usa para HTML.
fr: `font-family` ne peut être qu'un seul nom de police, et non une liste de noms (de repli), comme c'est le cas pour HTML.
ta: `எழுத்துரு-குடும்பம்` உஉகுமொ க்குப் பயன்படுத்தப்படுவது போல (குறைவடையும்) பெயர்களின் பட்டியல் அல்ல, ஒரே ஒரு எழுத்துரு பெயராக இருக்க முடியும்.
uk: `font-family` може бути лише однією назвою шрифту, а не списком (резервних) імен, як це використовується для HTML.

source: `font-size` can be a number or [CSS absolute-size values](https://drafts.csswg.org/css-fonts-3/#font-size-prop). Only the values `x-small`, `small`, `medium`, `large` and `x-large` are supported.
es: `font-size` puede ser un número o [valores CSS de tamaño absoluto](https://drafts.csswg.org/css-fonts-3/#font-size-prop). Solo se admiten los valores `x-small`, `small`, `medium`, `large` y `x-large`.
fr: `font-size` peut être un nombre ou [CSS absolute-size values] (https://drafts.csswg.org/css-fonts-3/#font-size-prop). Seules les valeurs `x-small`, `small`, `medium`, `large` et `x-large` sont supportées.
ta: `எழுத்துரு அளவு` ஒரு எண் அல்லது [CSS முழுமையான-அளவு மதிப்புகள்] (https://drafts.csswg.org/css-fonts-3/#font-size-prop) இருக்கலாம். `எக்ச்-ச்மால்`,` சிறிய`, `நடுத்தர`,` பெரிய` மற்றும் `எக்ச்-லார்ச்` மதிப்புகள் மட்டுமே ஆதரிக்கப்படுகின்றன.
uk: `font-size` може бути числом або [абсолютними значеннями розміру CSS](https://drafts.csswg.org/css-fonts-3/#font-size-prop). Підтримуються лише значення "x-small", "small", "medium", "large" і "x-large".

source: Drawing and spacing
es: Trazado y espaciado
fr: Dessin et espacement
ta: வரைதல் மற்றும் இடைவெளி
uk: Креслення та інтервали

source: Radius for rectangles: ``border-radius: 4``.
es: Radio para rectángulos: ``border-radius: 4``.
fr: Rayon pour les rectangles : ``border-radius : 4``.
ta: செவ்வகங்களுக்கான ஆரம்: ``border-radius: 4``.
uk: Радіус для прямокутників: ``border-radius: 4``.

source: Style for dashed lines: ``dash-style: 7 5``.
es: Estilo para líneas discontinuas: ``dash-style: 7 5``.
fr: Style pour les lignes en pointillés : ``dash-style : 7 5``.
ta: கோடு கோடுகளுக்கான நடை: ``dash-style: 7 5``.
uk: Стиль для пунктирних ліній: ``dash-style: 7 5``.

source: Content alignment for boxes.
es: Alineación del contenido de las cajas.
fr: Alignement du contenu des boîtes.
ta: பெட்டிகளுக்கான உள்ளடக்க சீரமைப்பு.
uk: Вирівнювання вмісту для коробок.

source: Either ``start``, ``end``, ``center`` or ``stretch``.
es: Ya sea ``start``, ``end``, ``center`` o ``stretch``.
fr: Soit ``start``, ``end``, ``center`` ou ``stretch``.
ta: ஒன்று ``start``, ``and``, ``center`` அல்லது ``stretch``.
uk: Або ``початок``, ``кінець``, ``центр`` або ``розтягнути``.

source: Either ``normal`` or ``sloppy [factor]``.
es: Ya sea ``normal`` o ``sloppy [factor]``.
fr: Soit ``normal``, soit ``sloppy [factor]``.
ta: ஒன்று ``normal`` or ``sloppy [factor]``.
uk: Або ``нормальний``, або ``недбалий [фактор]``.

source: Set the width for lines: ``line-width: 2``. *(inherited)*
fr: Définir la largeur des lignes : ``line-width : 2``. *(inherited)*
ta: வரிகளுக்கு அகலத்தை அமைக்கவும்: ``line-width: 2``. *(மரபுரிமை)*
uk: Встановіть ширину ліній: ``line-width: 2``. *(успадковано)*

source: Set minimal height for an item: ``min-height: 50``.
es: Establece la altura mínima de un elemento: ``min-height: 50``.
fr: Fixe la hauteur minimale d'un élément : ``min-height : 50``.
ta: ஒரு உருப்படிக்கு குறைந்தபட்ச உயரத்தை அமைக்கவும்: ``min-height: 50``.
uk: Установіть мінімальну висоту для елемента: ``min-height: 50``.

source: Set minimal width for an item: ``min-width: 100``.
es: Establece el ancho mínimo de un elemento: ``min-width: 100``.
fr: Fixe la largeur minimale d'un élément : ``min-width : 100``.
ta: ஒரு பொருளுக்கு குறைந்தபட்ச அகலத்தை அமைக்கவும்: ``min-width: 100``.
uk: Установіть мінімальну ширину для елемента: ``min-width: 100``.

source: Set maximum width (text fields only): ``max-width: 100``.
fr: Définir la largeur maximale (champs de texte uniquement) : ``max-width : 100``.
ta: அதிகபட்ச அகலத்தை அமைக்கவும் (உரை புலங்கள் மட்டும்): ``max-width: 100``.
uk: Встановіть максимальну ширину (тільки для текстових полів): ``max-width: 100``.

source: CSS style padding (top, right, bottom, left).
es: Estilo CSS de relleno (arriba, derecha, abajo, izquierda).
fr: Style CSS d'espacement de chaque coté (top, right, bottom, left).
ta: சிஎச்எச் பாணி திணிப்பு (மேல், வலது, கீழ், இடது).
uk: Відступ у стилі CSS (верхній, правий, нижній, лівий).

source: Example: ``padding: 3 4``.
es: Ejemplo: ``padding: 3 4``.
fr: Exemple: ``padding: 3 4``.
ta: எடுத்துக்காட்டு: ``padding: 3 4``.
uk: Приклад: ``padding: 3 4``.

source: `padding` is defined by integers in the range of 1 to 4. No unit (px, pt, em) needs to be used. All values are in pixel distance.
es: `padding` está definido por enteros en el rango de 1 a 4. No es necesario usar ninguna unidad (px, pt, em). Todos los valores están en distancia de píxel.
fr: Le 'padding' (espacement de chaque coté) est défini par des nombres entiers compris entre 1 et 4. Aucune unité (px, pt, em) n'a besoin d'être utilisée. Toutes les valeurs sont exprimées en distance en pixels.
ta: `திணிப்பு` 1 முதல் 4 வரம்பில் உள்ள முழு எண்களால் வரையறுக்கப்படுகிறது. எந்த அலகு (px, pt, em) பயன்படுத்த வேண்டியதில்லை. அனைத்து மதிப்புகளும் படப்புள்ளி தூரத்தில் உள்ளன.
uk: `padding` визначається цілими числами в діапазоні від 1 до 4. Одиниці (px, pt, em) використовувати не потрібно. Усі значення вказані у піксельних відстанях.

source: `dash-style` is a list of numbers (line, gap, line, gap, …)
es: `dash-style` es una lista de números (línea, hueco, línea, hueco, …)
fr: `dash-style` est une liste de nombres (ligne, espace, ligne, espace, ...)
ta: `டாச்-ச்டைல்` என்பது எண்களின் பட்டியல் (வரி, இடைவெளி, வரி, இடைவெளி,…)
uk: `dash-style` — це список чисел (рядок, проміжок, лінія, прогалина, …)

source: `line-style` only has an effect when defined on a `diagram`. A sloppiness factor can be provided in the range of -2 to 2.
es: `line-style` solo tiene efecto cuando se define en un `diagram`. Se puede proporcionar un factor de omisión en el rango de -2 a 2.
fr: `line-style` n'a d'effet que lorsqu'il est défini sur un `diagramme`. Un facteur de négligence peut être fourni entre -2 et 2.
ta: `வரி-பாணி` ஒரு` வரைபடம்` இல் வரையறுக்கப்படும்போது மட்டுமே ஒரு விளைவைக் கொண்டிருக்கும். -2 முதல் 2 வரையிலான வரம்பில் ஒரு மந்தமான காரணி வழங்கப்படலாம்.
uk: `line-style` має ефект лише тоді, коли визначено на `diagram`. Коефіцієнт неохайності може бути встановлений в діапазоні від -2 до 2.

source: Pseudo elements
fr: Pseudo-éléments
ta: போலி கூறுகள்
uk: Псевдо елементи

source: Currently, only the `::after` pseudo element is supported.
fr: Actuellement, seul le pseudo-élément `::after` est pris en charge.
ta: தற்போது, `:: பிறகு` போலி உறுப்பு மட்டுமே ஆதரிக்கப்படுகிறது.
uk: Наразі підтримується лише псевдоелемент `::after`.

source: Extra content to be shown after a text.
fr: Contenu supplémentaire à afficher après un texte.
ta: உரைக்குப் பிறகு காண்பிக்கப்பட வேண்டிய கூடுதல் உள்ளடக்கம்.
uk: Додатковий вміст, який буде показано після тексту.

source: Variables
ta: மாறிகள்
uk: Змінні

source: Since Gaphor 2.16.0 you can use [CSS variables](https://developer.mozilla.org/en-US/docs/Web/CSS/Using_CSS_custom_properties) in your style sheets.
es: Desde Gaphor 2.16.0 puede usar [variables CSS](https://developer.mozilla.org/en-US/docs/Web/CSS/Using_CSS_custom_properties) en sus hojas de estilo.
fr: Depuis Gaphor 2.16.0, vous pouvez utiliser des [variables CSS] (https://developer.mozilla.org/en-US/docs/Web/CSS/Using_CSS_custom_properties) dans vos feuilles de style.
ta: காஃபோர் 2.16.0 முதல் உங்கள் பாணியிலான தாள்களில் நீங்கள் [CSS மாறிகள்](https://developer.mozilla.org/en-us/docs/docs/Web/CSS/Using_CSS_custom_properties) ஐப் பயன்படுத்தலாம்.
uk: Починаючи з Gaphor 2.16.0, ви можете використовувати [змінні CSS](https://developer.mozilla.org/en-US/docs/Web/CSS/Using_CSS_custom_properties) у своїх таблицях стилів.

source: This allows you to define often used values in a more generic way. Think of things like line dash style and colors.
es: Esto le permite definir valores de uso frecuente de forma más genérica. Piense en cosas como el estilo de guiones de línea y los colores.
fr: Cela vous permet de définir des valeurs souvent utilisées de manière plus générique. Pensez à des choses comme le style des tirets et les couleurs.
ta: இது பெரும்பாலும் பயன்படுத்தப்பட்ட மதிப்புகளை மிகவும் பொதுவான முறையில் வரையறுக்க உங்களை அனுமதிக்கிறது. வரி கோடு பாணி மற்றும் வண்ணங்கள் போன்ற விசயங்களைப் பற்றி சிந்தியுங்கள்.
uk: Це дозволяє визначати часто використовувані значення більш загальним способом. Подумайте про такі речі, як стиль штрихів і кольори.

source: The `var()` function has some limitations:
es: La función `var()` tiene algunas limitaciones:
fr: La fonction `var()` a quelques limitations :
ta: `Var ()` செயல்பாடு சில வரம்புகளைக் கொண்டுள்ளது:
uk: Функція var() має деякі обмеження:

source: Values can’t have a default value.
es: Los valores no pueden tener un valor predeterminado.
fr: Les valeurs ne peuvent pas avoir de valeur par défaut.
ta: மதிப்புகள் இயல்புநிலை மதிப்பைக் கொண்டிருக்க முடியாது.
uk: Значення не можуть мати значення за умовчанням.

source: Variables can’t have a variable as their value.
es: Las variables no pueden tener una variable como valor.
fr: Les variables ne peuvent pas avoir une variable comme valeur.
ta: மாறிகள் அவற்றின் மதிப்பாக ஒரு மாறியைக் கொண்டிருக்க முடியாது.
uk: Змінні не можуть мати значення змінної.

source: Example:
es: Ejemplo:
fr: Exemples :
ta: எடுத்துக்காட்டு:
uk: Приклад:

source: All diagrams have a white background. Sequence diagrams get a blue-ish background.
es: Todos los diagramas tienen un fondo blanco. Los diagramas de secuencia tienen un fondo azulado.
fr: Tous les diagrammes ont un fond blanc. Les diagrammes de séquence ont un fond bleu.
ta: அனைத்து வரைபடங்களும் வெள்ளை பின்னணியைக் கொண்டுள்ளன. வரிசை வரைபடங்கள் நீல-இச் பின்னணியைப் பெறுகின்றன.
uk: Усі схеми мають білий фон. Діаграми послідовностей отримують блакитний фон.

source: Media queries
fr: Questions sur les médias
ta: ஊடக வினவல்கள்
uk: Медіа запити
