Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: Create and display the UI components (windows).
es: Crear y mostrar los componentes de la interfaz de usuario (ventanas).
fr: Créer et afficher les composants de l'interface utilisateur (fenêtres).
ta: இடைமுகம் கூறுகளை (விண்டோச்) உருவாக்கி காண்பி.
uk: Створення та відображення компонентів інтерфейсу користувача (вікна).

source: Shut down this component.
es: Apague este componente.
fr: Arrêter ce composant.
ta: இந்த கூறுகளை மூடு.
uk: Вимкніть цей компонент.

source: It's not supposed to be opened again.
es: No se supone que se vuelva a abrir.
fr: Il n'est pas censé être rouvert.
ta: இது மீண்டும் திறக்கப்படக்கூடாது.
uk: Його не можна знову відкривати.

source: Typically, a service and UI component would like to present some actions to the user, by means of menu entries. Every service and UI component can advertise actions by implementing the `gaphor.abc.ActionProvider` interface:
fr: Typiquement, un service et un composant d'interface utilisateur (UI) souhaitent proposer certaines actions à l'utilisateur à l'aide d'entrées de menu. Chaque service et composant peut annoncer des actions en implémentant l'interface `gaphor.abc.ActionProvider` :
ta: பொதுவாக, ஒரு பணி மற்றும் இடைமுகம் கூறு பட்டியல் உள்ளீடுகள் மூலம் பயனருக்கு சில செயல்களை வழங்க விரும்புகிறது. ஒவ்வொரு சேவையும் இடைமுகம் கூறுகளும் `gaphor.abc.actionProvider` இடைமுகத்தை செயல்படுத்துவதன் மூலம் செயல்களை விளம்பரப்படுத்தலாம்:
uk: Зазвичай, сервіс та компонент інтерфейсу хочуть представити користувачеві деякі дії за допомогою пунктів меню. Кожен сервіс та компонент інтерфейсу може рекламувати дії, реалізувавши інтерфейс `gaphor.abc.ActionProvider`:

source: An action provider is a special service that provides actions via ``@action`` decorators on its methods (see gaphor/action.py).
es: Un proveedor de acciones es un servicio especial que proporciona acciones a través de decoradores de @action en sus métodos (ver gaphor/action.py).
fr: Un fournisseur d'actions est un service spécial qui fournit des actions via des décorateurs ``@action`` sur ses méthodes (voir gaphor/action.py).
ta: ஒரு செயல் வழங்குநர் என்பது ஒரு சிறப்பு சேவையாகும், இது அதன் முறைகள் குறித்து ``@action`` அலங்காரக்காரர்கள் வழியாக செயல்களை வழங்கும் (gaphor/action.py ஐப் பார்க்கவும்).
uk: Постачальник дій — це спеціальна служба, яка забезпечує дії за допомогою декораторів ``@action`` для своїх методів (див. gaphor/action.py).

source: Sphinx Extension
es: Extensión Sphinx
fr: Extension Sphinx
ta: சூரரிமாச்சிலை நீட்டிப்பு
uk: Розширення Сфінкса

source: What's more awesome than to use Gaphor diagrams directly in your `Sphinx`_ documentation. Whether you write your docs in `reStructured Text`_ or `Markdown`_, we've got you covered.
es: Qué es más impresionante que usar diagramas Gaphor directamente en su documentación `Sphinx`_. Si usted escribe sus documentos en `reStructured Text`_ o `Markdown`_, le tenemos cubierto.
fr: Quoi de plus génial que d'utiliser les diagrammes Gaphor directement dans votre documentation `Sphinx`_. Que vous écriviez vos documents en `reStructured Text`_ ou en `Markdown`_, nous avons tout prévu.
ta: உங்கள் `Sphinx`_ ஆவணங்களில் நேரடியாக கஃபர் வரைபடங்களைப் பயன்படுத்துவதை விட அற்புதமானது. உங்கள் டாக்சை `reStructured Text`_ அல்லது `Markdown`_ இல் எழுதினாலும், நாங்கள் உங்களை மூடிமறைத்துள்ளோம்.
uk: Що є чудовішим, ніж використовувати діаграми Gaphor безпосередньо у вашій документації `Sphinx`_. Незалежно від того, чи пишете ви свої документи у `reStructured Text`_ або `Markdown`_, ми допоможемо вам.

source: Here we cover the reStructured Text syntax. If you prefer markdown, we suggest you have a look at the `MyST-parser <https://myst-parser.readthedocs.io/>`_, as it `supports Sphinx directives <https://myst-parser.readthedocs.io/en/latest/syntax/roles-and-directives.html>`_.
fr: Nous couvrons ici la syntaxe du texte «reStructured Text». Si vous préférez le markdown, nous vous suggérons de jeter un coup d'œil à `MyST-parser <https://myst-parser.readthedocs.io/>`, car il prend en `charge les directives Sphinx <https://myst-parser.readthedocs.io/en/latest/syntax/roles-and-directives.html>`.
ta: மறுசீரமைக்கப்பட்ட உரை தொடரியல் இங்கே நாங்கள் உள்ளடக்குகிறோம். நீங்கள் மார்க் டவுனை விரும்பினால், `MyST-parser <https://myst-parser.readthedocs.io/>`_, இது `ச்பின்க்ச் வழிமுறைகளை ஆதரிப்பதால் <https://myst-parser.readthedocs.io/en/latest/syntax/roles-and-directives.html>`_.
uk: Тут ми розглянемо синтаксис reStructured Text. Якщо ви віддаєте перевагу розмітці, радимо вам поглянути на `MyST-парсер <https://myst-parser.readthedocs.io/>`_, оскільки він підтримує директиви Sphinx <https://myst-parser.readthedocs.io/en/latest/syntax/roles-and-directives.html>`_.

source: It requires `minimal effort to set up <#configuration>`_. Adding a diagram is as simple as:
es: Requiere un `esfuerzo mínimo para configurar <#configuration>`_. Añadir un diagrama es tan simple como:
fr: Il nécessite `un effort minimal pour mettre en place <#configuration>`_. L'ajout d'un diagramme est aussi simple que :
ta: `ஐ அமைக்க குறைந்தபட்ச முயற்சி தேவை <#configuration>`_ . வரைபடத்தைச் சேர்ப்பது மிகவும் எளிது:
uk: Це вимагає `мінімальних зусиль, щоб налаштувати <#configuration>`_. Додати діаграму так само просто:

source: In case you use multiple Gaphor source files, you need to define a ``:model:`` attribute and add the model names to the Sphinx configuration file (``conf.py``).
es: En caso de usar múltiples archivos fuente Gaphor, es necesario definir un atributo ``:model:`` y añadir los nombres de los modelos al archivo de configuración de Sphinx (``conf.py``).
fr: Dans le cas où vous utilisez plusieurs fichiers sources Gaphor, vous devez définir un attribut ``:model:`` et ajouter les noms des modèles au fichier de configuration de Sphinx (``conf.py``).
ta: நீங்கள் பல காஃபர் மூல கோப்புகளைப் பயன்படுத்தினால், நீங்கள் ஒரு ``:model:`` பண்புக்கூறு மற்றும் மாதிரி பெயர்களை ச்பின்க்ச் உள்ளமைவு கோப்பில் (``conf.py``) சேர்க்க வேண்டும்.
uk: Якщо ви використовуєте кілька вихідних файлів Gaphor, вам потрібно визначити атрибут ``:model:`` і додати назви моделей до файлу конфігурації Sphinx (``conf.py``).

source: Diagrams can be referenced by their name, or by their fully qualified name.
es: Se puede hacer referencia a los diagramas por su nombre o por su nombre completo.
fr: Les diagrammes peuvent être référencés par leur nom ou par leur nom complet.
ta: வரைபடங்களை அவற்றின் பெயரால் அல்லது அவற்றின் முழு தகுதி வாய்ந்த பெயரால் குறிப்பிடலாம்.
uk: На діаграми можна посилатися за їхнім іменем або за їхнім повним іменем.

source: `Figure`_, and `Image properties`_ can also be applied:
fr: `Figure`_, et `Image properties`_ (propriétés de l'image) peuvent également être appliquées :
ta: `Figure`_, மற்றும் `Image properties`_ ஐப் பயன்படுத்தலாம்:
uk: Також можна застосувати `Рисунок`_ і `Властивості зображення`_:

source: A description suitable for an example
es: Una descripción adecuada para un ejemplo
fr: Une description adaptée à un exemple
ta: ஒரு எடுத்துக்காட்டுக்கு ஏற்ற விளக்கம்
uk: Опис підходить для прикладу

source: You can also add a caption, if you want.
fr: Vous pouvez également ajouter une légende, si vous le souhaitez.
ta: நீங்கள் விரும்பினால் ஒரு தலைப்பையும் சேர்க்கலாம்.
uk: Ви також можете додати підпис, якщо хочете.

source: Configuration
es: Configuración
ta: உள்ளமைவு
uk: Конфігурація

source: To add Gaphor diagram support to Sphinx, make sure Gaphor is listed as a dependency.
es: Para añadir soporte de diagramas Gaphor a Sphinx, asegúrese de que Gaphor aparece como dependencia.
fr: Pour ajouter le support des diagrammes Gaphor à Sphinx, assurez-vous que Gaphor est listé comme une dépendance.
ta: சூரரிமாச்சிலை இல் கஃபர் வரைபட ஆதரவைச் சேர்க்க, காஃபர் ஒரு சார்புநிலையாக பட்டியலிடப்பட்டுள்ளதா என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
uk: Щоб додати підтримку діаграм Gaphor до Sphinx, переконайтеся, що Gaphor зазначено як залежність.

source: Gaphor requires at least Python 3.9.
es: Gaphor requiere al menos Python 3.9.
fr: Gaphor nécessite au moins Python 3.9.
ta: கஃபருக்கு குறைந்தபட்சம் பைதான் 3.9 தேவைப்படுகிறது.
uk: Gaphor вимагає принаймні Python 3.9.

source: Secondly, add the following to your ``conf.py`` file:
es: En segundo lugar, añada lo siguiente a su archivo ``conf.py``:
fr: Deuxièmement, ajoutez ce qui suit à votre fichier ``conf.py`` :
ta: இரண்டாவதாக, உங்கள் ``conf.py`` கோப்பில் பின்வருவனவற்றைச் சேர்க்கவும்:
uk: По-друге, додайте наступне до свого файлу ``conf.py``:

source: Step 1: Add gaphor as extension.
es: Paso 1: Añadir gaphor como extensión.
fr: Étape 1 : Ajouter gaphor comme extension.
ta: படி 1: கஃபரை நீட்டிப்பாக சேர்க்கவும்.
uk: Крок 1: Додайте gaphor як розширення.

source: Step 2: Add references to models
es: Paso 2: Añadir referencias a los modelos
fr: Étape 2 : Ajouter des références aux modèles
ta: படி 2: மாதிரிகள் பற்றிய குறிப்புகளைச் சேர்க்கவும்
uk: Крок 2: Додайте посилання на моделі

source: Now include ``diagram`` directives in your documents.
es: Ahora incluye las directivas ``diagram`` en tus documentos.
fr: Incluez maintenant les directives ``diagram`` dans vos documents.
ta: இப்போது உங்கள் ஆவணங்களில் ``diagram`` வழிமுறைகளைச் சேர்க்கவும்.
uk: Тепер додайте директиви ``diagram`` у ваші документи.

source: Read the Docs
es: Leer la documentación
fr: Lire les documents
ta: ஆவணத்தைப் படியுங்கள்
uk: Прочитайте документи

source: The diagram directive plays nice with `Read the docs`_. To make diagrams render, it's best to use a `.readthedocs.yaml`_ file in your project. Make sure to include the extra ``apt_packages`` as shown below.
es: La directiva de diagramas funciona bien con `Read the docs`_. Para hacer que los diagramas se muestren, es mejor usar un archivo `.readthedocs.yaml`_ en tu proyecto. Asegúrate de incluir el extra ``apt_packages`` como se muestra a continuación.
fr: La directive diagramme est compatible avec le module `Read the docs`_. Pour rendre les diagrammes, il est préférable d'utiliser un fichier `.readthedocs.yaml`_ dans votre projet. Assurez-vous d'inclure l'élément supplémentaire ``apt_packages``, comme indiqué ci-dessous.
ta: வரைபட கட்டளை `Read the docs`_ உடன் நன்றாக விளையாடுகிறது. வரைபடங்களை வழங்குவதற்கு, உங்கள் திட்டத்தில் `.readthedocs.yaml`_ கோப்பைப் பயன்படுத்துவது நல்லது. கீழே காட்டப்பட்டுள்ளபடி கூடுதல் ``apt_packages`` ஐச் சேர்ப்பதை உறுதிசெய்க.
uk: Директива diagram добре поєднується з `Read the docs`_. Для відображення діаграм найкраще використовувати файл `.readthedocs.yaml`_ у вашому проекті. Переконайтеся, що ви включили додаткові ``apt_packages``, як показано нижче.

source: This is the ``.readthedocs.yaml`` file we use for Gaphor:
es: Este es el archivo ``.readthedocs.yaml`` que utilizamos para Gaphor:
fr: C'est le fichier ``.readthedocs.yaml`` que nous utilisons pour Gaphor :
ta: இது ``.readthedocs.yaml`` கோப்பு, இதை காஃபோர்க்கு பயன்படுத்துகிறோம்:
uk: Це файл ``.readthedocs.yaml``, який ми використовуємо для Gaphor:

source: ``libgirepository-2.0-dev`` is required to build PyGObject.
ta: பிகோப்செக்டை உருவாக்க ``libgirepositary2.0-dev`` தேவை.

source: ``gir1.2-pango-1.0`` is required for text rendering.
es: Se requiere ``gir1.2-pango-1.0`` para la representación de texto.
fr: ``gir1.2-pango-1.0`` est nécessaire pour le rendu du texte.
ta: உரை ரெண்டரிங்கிற்கு ``gir1.2-pango-1.0`` தேவை.
uk: ``gir1.2-pango-1.0`` потрібен для відтворення тексту.

source: For Gaphor 2.7.0, ``gir1.2-gtk-3.0`` and ``gir1.2-gtksource-4`` are required ``apt_packages``, although we do not use the GUI. From Gaphor 2.7.1 onwards all you need is GI-repository and Pango.
es: Para Gaphor 2.7.0, ``gir1.2-gtk-3.0`` y ``gir1.2-gtksource-4`` son necesarios ``apt_packages``, aunque no usamos la GUI. Desde Gaphor 2.7.1 en adelante, todo lo que necesita es un repositorio GI y Pango.
fr: Pour Gaphor 2.7.0, ``gir1.2-gtk-3.0`` et ``gir1.2-gtksource-4`` sont nécessaires ``apt_packages``, bien que nous n'utilisions pas l'interface graphique. À partir de Gaphor 2.7.1, tout ce dont vous avez besoin est GI-repository et Pango.
ta: Kaphor 2.7.0, ``gir1.2-gtk-3.0`` மற்றும் ``gir1.2-gtksource-4`` தேவை ``apt_packages``, நாங்கள் GUI ஐப் பயன்படுத்தவில்லை என்றாலும். கஃபர் 2.7.1 இலிருந்து உங்களுக்கு தேவையானது சி-ரெபோசிட்டரி மற்றும் பாங்கோ.
uk: Для Gaphor 2.7.0 ``gir1.2-gtk-3.0`` і ``gir1.2-gtksource-4`` є обов’язковими ``apt_packages``, хоча ми не використовуємо GUI. Починаючи з Gaphor 2.7.1 і далі все, що вам потрібно, це GI-repository та Pango.

source: Errors
es: Errores
ta: பிழைகள்
uk: Помилки

source: Errors are shown on the console when the documentation is built and in the document.
es: Los errores se muestran en la consola cuando se construye la documentación y en el documento.
fr: Les erreurs sont affichées sur la console lors de la création de la documentation et dans le document.
ta: ஆவணங்கள் கட்டமைக்கப்படும்போது மற்றும் ஆவணத்தில் கன்சோலில் பிழைகள் காட்டப்படுகின்றன.
uk: Помилки відображаються на консолі під час створення документації та в документі.

source: An error will appear in the documentation. Something like this:
es: Aparecerá un error en la documentación. Algo como esto:
fr: Une erreur apparaîtra dans la documentation. Quelque chose comme ceci :
ta: ஆவணத்தில் பிழை தோன்றும். இது போன்ற ஒன்று:
uk: У документації з'явиться помилка. Щось на зразок цього:

source: No diagram ‘Wrong name’ in model ‘example’ (../examples/sequence-diagram.gaphor).
es: No hay diagrama 'Nombre incorrecto' en el modelo 'ejemplo' (../examples/sequence-diagram.gaphor).
fr: Pas de diagramme 'Mauvais nom' dans le modèle 'exemple' (../examples/sequence-diagram.gaphor).
ta: மாதிரியில் ‘தவறான பெயர்’ எந்த வரைபடமும் இல்லை ‘எடுத்துக்காட்டு’ (../examples/ வரிசைமுறை-diagram.gaphor).
uk: Немає діаграми «Неправильна назва» в моделі «приклад» (../examples/sequence-diagram.gaphor).

source: Stereotypes
es: Estereotipos
fr: Stéréotypes
ta: ஒரேமாதிரிகள்
uk: Стереотипи

source: In UML, stereotypes are way to extend the application of the UML language to new domains. For example: SysML started as a profile for UML.
es: En UML, los estereotipos son una forma de extender la aplicación del lenguaje UML a nuevos dominios. Por ejemplo: SysML comenzó como un perfil para UML.
fr: En UML, les stéréotypes sont un moyen d'étendre l'application du langage UML à de nouveaux domaines. Par exemple : SysML a commencé comme un profil pour UML.
ta: யுஎம்எல்லில், யுஎம்எல் மொழியின் பயன்பாட்டை புதிய களங்களுக்கு நீட்டிப்பதற்கான வழி ச்டீரியோடைப்கள். எடுத்துக்காட்டாக: SysML UML க்கான சுயவிவரமாகத் தொடங்கியது.
uk: В UML стереотипи є способом розширення застосування мови UML до нових областей. Наприклад: SysML розпочато як профіль для UML.

source: Gaphor supports stereotypes too. They're *the* way for you to adapt your models to your specific needs.
es: Gaphor también admite estereotipos. Son *la* forma de adaptar sus modelos a sus necesidades específicas.
fr: Gaphor prend également en charge les stéréotypes. Ils vous permettent d'adapter vos modèles à vos besoins spécifiques.
ta: கஃபர் ச்டீரியோடைப்களையும் ஆதரிக்கிறது. உங்கள் குறிப்பிட்ட தேவைகளுக்கு ஏற்ப உங்கள் மாதிரிகளை மாற்றியமைப்பதற்கான வழி அவை *.
uk: Gaphor теж підтримує стереотипи. Вони *це* спосіб адаптувати моделі до ваших конкретних потреб.

source: The UML, SysML, RAAML and other models used in Gaphor – the code is generated from Gaphor model files – make use of stereotypes to provide specific information used when generating the data model code.
es: Los modelos UML, SysML, RAAML y otros utilizados en Gaphor - el código se genera a partir de archivos de modelo Gaphor - hacen uso de estereotipos para proporcionar información específica utilizada al generar el código del modelo de datos.
fr: Les modèles UML, SysML, RAAML et autres utilisés dans Gaphor (le code est généré à partir des fichiers de modèle Gaphor) utilisent des stéréotypes pour fournir des informations spécifiques utilisées lors de la génération du code du modèle de données.
ta: Gaphor இல் பயன்படுத்தப்படும் UML, SysML, RAAML மற்றும் பிற மாதிரிகள் - குறியீடு Gaphor மாதிரி கோப்புகளிலிருந்து உருவாக்கப்படுகிறது - தரவு மாதிரி குறியீட்டை உருவாக்கும் போது பயன்படுத்தப்படும் குறிப்பிட்ட தகவல்களை வழங்க ஒரே மாதிரியானவற்றைப் பயன்படுத்துங்கள்.
uk: UML, SysML, RAAML та інші моделі, що використовуються в Gaphor – код генерується з файлів моделей Gaphor – використовують стереотипи для надання конкретної інформації, яка використовується під час генерації коду моделі даних.

source: To create a stereotype, ensure the UML Profile is active and open the *Profile* section of the toolbox. First add a *Metaclass* to your diagram. Next add a *Stereotype*, and connect both with a *Extension*. The `«metaclass»` stereotype will only show once the *Extension* is connected both class and stereotype.
es: Para crear un estereotipo, asegúrese de que el Perfil UML está activo y abra la sección *Perfil* de la caja de herramientas. Primero añada una *Metaclase* a su diagrama. Después añada un *Estereotipo*, y conecte ambos con una *Extensión*. El estereotipo `"metaclass"` solo se mostrará una vez que la *Extensión* esté conectada tanto a la clase como al estereotipo.
fr: Pour créer un stéréotype, assurez-vous que le profil UML est actif, puis ouvrez la section *Profil* de la boîte à outils. Ajoutez d'abord une *Métaclass* à votre diagramme. Ensuite, ajoutez un *Stéréotype* et reliez les deux avec une *Extension*. Le stéréotype `«metaclass»` n'apparaîtra que lorsque l'extension sera connectée à la fois à la classe et au stéréotype.
ta: ஒரு ச்டீரியோடைப்பை உருவாக்க, யுஎம்எல் சுயவிவரம் செயலில் இருப்பதை உறுதிசெய்து கருவிப்பெட்டியின் * சுயவிவரம் * பகுதியைத் திறக்கவும். முதலில் உங்கள் வரைபடத்தில் * மெட்டாக்ளாச் * ஐச் சேர்க்கவும். அடுத்து ஒரு *ச்டீரியோடைப் *ஐச் சேர்த்து, இரண்டையும் *நீட்டிப்பு *உடன் இணைக்கவும். `« மெட்டாக்ளாச் »` ச்டீரியோடைப் * நீட்டிப்பு * வகுப்பு மற்றும் ச்டீரியோடைப் இரண்டையும் இணைக்கப்பட்டவுடன் மட்டுமே காண்பிக்கும்.
uk: Щоб створити стереотип, переконайтеся, що профіль UML активний, і відкрийте розділ *Profile* на панелі інструментів. Спочатку додайте *Метаклас* до вашої діаграми. Потім додайте *стереотип* і з'єднайте їх за допомогою *розширення*. Стереотип `"метаклас" буде показано лише тоді, коли *Розширення* з'єднає клас і стереотип.

source: The class names in the metaclass should be a class name from the UML model, such as `Class`, `Interface`, `Property`, `Association`. Or even `Element` if you want to use the stereotype on all elements.
es: Los nombres de clase en la metaclase deben ser un nombre de clase del modelo UML, como `Class`, `Interface`, `Property`, `Association`. O incluso "Elemento" si desea utilizar el estereotipo en todos los elementos.
fr: Les noms de classe dans la métaclasse doivent être des noms de classe du modèle UML, tels que `Classe`, `Interface`, `Property`, `Association`. Ou même `Element` si vous voulez utiliser le stéréotype sur tous les éléments.
ta: மெட்டாக்ளாசில் உள்ள வர்க்கப் பெயர்கள் `வகுப்பு`,` இடைமுகம்`, `சொத்து`,` சங்கம்` போன்ற யுஎம்எல் மாதிரியின் வர்க்கப் பெயராக இருக்க வேண்டும். அல்லது எல்லா உறுப்புகளிலும் ச்டீரியோடைப்பைப் பயன்படுத்த விரும்பினால் `உறுப்பு` கூட.
uk: Імена класів у метакласі мають бути іменами класів із моделі UML, наприклад `Клас`, `Інтерфейс`, `Властивість`, `Асоціація`. Або навіть «Елемент», якщо ви хочете використовувати стереотип для всіх елементів.

source: Your stereotype declaration may look something like this:
es: Su declaración de estereotipo puede parecer algo así:
fr: Votre déclaration de stéréotype peut ressembler à ceci :
ta: உங்கள் ச்டீரியோடைப் அறிவிப்பு இதுபோன்றதாகத் தோன்றலாம்:
uk: Ваша стереотипна декларація може виглядати приблизно так:

source: The `Asynchronous` stereotype has a property `priority`. This property can be proved a value once the stereotype is applied to a *Property*, such as an association end.
es: El estereotipo `Asynchronous` tiene una propiedad `priority`. A esta propiedad se le puede asignar un valor una vez que el estereotipo se aplica a una *Propiedad*, como un extremo de asociación.
fr: Le stéréotype `Asynchronous`(Asynchrone) possède une propriété `priority` (priorité). Cette propriété peut se voir attribuer une valeur une fois que le stéréotype est appliqué à une *propriété* (Property), telle qu'une fin d'association.
ta: `ஒத்திசைவற்ற` ச்டீரியோடைப்பில் ஒரு சொத்து` முன்னுரிமை` உள்ளது. அசோசியேசன் எண்ட் போன்ற *சொத்து *க்கு ச்டீரியோடைப் பயன்படுத்தப்பட்டவுடன் இந்த சொத்து ஒரு மதிப்பை நிரூபிக்க முடியும்.
uk: Стереотип «Асинхронний» має властивість «пріоритет». Цю властивість можна підтвердити значенням, коли стереотип застосовано до *Властивості*, наприклад кінця асоціації.

source: When a stereotype can be applied to a model element, a *Stereotype* section will appear in the editor.
es: Cuando se puede aplicar un estereotipo a un elemento del modelo, aparecerá una sección *Estereotipo* en el editor.
fr: Lorsqu'un stéréotype peut être appliqué à un élément de modèle, une section *Stereotype* (Stéréotype) apparaît dans l'éditeur.
ta: ஒரு மாதிரி உறுப்புக்கு ஒரு ச்டீரியோடைப் பயன்படுத்தும்போது, ஒரு * ச்டீரியோடைப் * பிரிவு எடிட்டரில் தோன்றும்.
uk: Якщо стереотип можна застосувати до елемента моделі, у редакторі з’явиться розділ *Стереотип*.

source: ![The Gaphor main window showing a stereotype usage example.](images/stereotype-usage.png)
fr: ![La fenêtre principale de Gaphor illustre l'utilisation d'un stéréotype] (images/stereotype-usage.png)
ta: ![ஒரு ச்டீரியோடைப் பயன்பாட்டு உதாரணத்தைக் காட்டும் காஃபர் முதன்மையான சாளரம்.](images/stereotype-usage.png)
uk: ![Головне вікно Gaphor із прикладом використання стереотипу.](images/stereotype-usage.png)

source: The Gaphor main window showing a stereotype usage example.
fr: La fenêtre principale de Gaphor montre un exemple d'utilisation d'un stéréotype.
ta: ஒரு ச்டீரியோடைப் பயன்பாட்டு உதாரணத்தைக் காட்டும் கஃபர் முதன்மையான சாளரம்.
uk: Головне вікно Gaphor із прикладом використання стереотипу.

source: Creating a profile
fr: Création d'un profil
ta: சுயவிவரத்தை உருவாக்குதல்
uk: Створення профілю

source: In SysML extending the profile using stereotypes is often required to tailor the model to your needs. For example, creating Customer vs System requirements.
fr: En SysML, il est souvent nécessaire d'étendre le profil à l'aide de stéréotypes pour adapter le modèle à vos besoins. Cela peut par exemple permettre de représenter les exigences du client par rapport à celles du système.
ta: SysML இல், உங்கள் தேவைகளுக்கு ஏற்ப மாதிரியை வடிவமைக்க ச்டீரியோடைப்களைப் பயன்படுத்தி சுயவிவரத்தை நீட்டிப்பது பெரும்பாலும் தேவைப்படுகிறது. எடுத்துக்காட்டாக, வாடிக்கையாளர் Vs கணினி தேவைகளை உருவாக்குதல்.
uk: У SysML часто потрібне розширення профілю за допомогою стереотипів, щоб адаптувати модель до ваших потреб. Наприклад, створення вимог клієнта проти системи.

source: To add a profile to your model:
fr: Pour ajouter un profil à votre modèle :
ta: உங்கள் மாதிரியில் சுயவிவரத்தைச் சேர்க்க:
uk: Щоб додати профіль до моделі:

source: Create a package called `profile` this can be done by right clicking in the left hand column.
fr: Créez un paquet appelé `profile` en faisant un clic droit dans la colonne de gauche.
ta: `சுயவிவரம்` என்ற தொகுப்பை உருவாக்கவும், இடது கை நெடுவரிசையில் வலது சொடுக்கு செய்வதன் மூலம் இதைச் செய்யலாம்.
uk: Створіть пакет під назвою `profile`, це можна зробити, клацнувши правою кнопкою миші в лівій колонці.

source: Switch modelling language to the UML profile (top of left hand menu drop down)
fr: Changer le langage de modélisation pour le profil UML (en haut du menu déroulant de gauche)
ta: மாடலிங் மொழியை யுஎம்எல் சுயவிவரத்திற்கு மாற்றவும் (இடது கை மெனுவின் மேல் கீழே)
uk: Перемкніть мову моделювання на профіль UML (випадаюче меню вгорі ліворуч)

source: Within the package create a profile diagram (prf)
fr: Dans le paquet, créer un diagramme de profil (prf)
ta: தொகுப்புக்குள் சுயவிவர வரைபடத்தை (பிஆர்எஃப்) உருவாக்கவும்
uk: У пакеті створіть діаграму профілю (prf)
