Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: There is a fourth abstraction level called the Implementation Level that isn't modeled, which is the concrete built system.
fr: Il existe un quatrième niveau d'abstraction, appelé niveau de mise en œuvre, qui n'est pas modélisé et qui correspond au système concret construit.
ta: செயல்படுத்தல் நிலை என்று அழைக்கப்படும் நான்காவது சுருக்க நிலை உள்ளது, இது கான்கிரீட் கட்டப்பட்ட அமைப்பாகும்.
uk: Існує четвертий рівень абстракції, який називається рівнем реалізації, який не моделюється, тобто конкретно побудована система.

source: In the upper left hand corner of Gaphor, the Model Browser shows the three top level packages, dividing up the model in to these three abstraction levels.
fr: Dans le coin supérieur gauche de Gaphor, le navigateur de modèle affiche les trois paquets de niveau supérieur, divisant le modèle en trois niveaux d'abstraction.
ta: கஃபரின் மேல் இடது மூலையில், மாதிரி உலாவி மூன்று உயர் மட்ட தொகுப்புகளைக் காட்டுகிறது, இந்த மூன்று சுருக்க நிலைகளுக்கு மாதிரியை பிரிக்கிறது.
uk: У верхньому лівому куті Gaphor браузер моделей показує три пакети верхнього рівня, які поділяють модель на ці три рівні абстракції.

source: ![Top level packages of the SysML template.](images/coffee-machine-top-level-packages.png)
fr: ![Paquets de premier niveau du modèle SysML.](images/coffee-machine-top-level-packages.png)
ta: ![SysML வார்ப்புருவின் உயர் நிலை தொகுப்புகள்.](images/coffee-machine-top-level-packages.png)
uk: ![Пакети верхнього рівня шаблону SysML.](images/coffee-machine-top-level-packages.png)

source: Top level packages of the SysMLtemplate.
fr: Paquets de premier niveau du modèle SysML.
ta: SysMLtemplate இன் உயர் நிலை தொகுப்புகள்.
uk: Пакунки верхнього рівня шаблону SysML.

source: Pillars
fr: Piliers
ta: தூண்கள்
uk: Стовпи

source: There are four pillars of SysML which help classify the types of diagrams based on what they represent:
fr: Le SysML repose sur quatre piliers qui permettent de classer les types de diagrammes en fonction de ce qu'ils représentent :
ta: SysML இன் நான்கு தூண்கள் உள்ளன, அவை வரைபடங்களின் வகைகளை அவை பிரதிநிதித்துவப்படுத்துகின்றன:
uk: Існує чотири стовпи SysML, які допомагають класифікувати типи діаграм на основі того, що вони представляють:

source: Behavior: The functionality of a system
fr: Comportement : La fonctionnalité d'un système
ta: நடத்தை: ஒரு அமைப்பின் செயல்பாடு
uk: Поведінка: функціональність системи

source: Structure: How a system is formed using parts and connections
fr: La structure : La façon dont un système est formé à l'aide de composants et de connexions
ta: கட்டமைப்பு: பாகங்கள் மற்றும் இணைப்புகளைப் பயன்படுத்தி ஒரு அமைப்பு எவ்வாறு உருவாகிறது
uk: Структура: як система формується за допомогою частин і зв’язків

source: Requirements: Written statements that constrain the system
fr: Exigences : Déclarations écrites qui contraignent le système
ta: தேவைகள்: கணினியைக் கட்டுப்படுத்தும் எழுதப்பட்ட அறிக்கைகள்
uk: Вимоги: Письмові заяви, що обмежують систему

source: Parametric: Enforces mathematical rules across values in the system
fr: Paramétrage : Appliquer les règles mathématiques aux valeurs du système
ta: அளவுரு: கணினியில் மதிப்புகள் முழுவதும் கணித விதிகளை செயல்படுத்துகிறது
uk: Параметричний: забезпечує дотримання математичних правил для значень у системі

source: If you want to learn more about these four pillars, there is a 30-minute video by Rick Steiner called [The Four Pillars of SysML](https://youtu.be/998UznK9ogY).
fr: Si vous souhaitez en savoir plus sur ces quatre piliers, Rick Steiner a réalisé une vidéo de 30 minutes intitulée [The Four Pillars of SysML] (https://youtu.be/998UznK9ogY).
ta: இந்த நான்கு தூண்களைப் பற்றி மேலும் அறிய நீங்கள் விரும்பினால், ரிக் ச்டெய்னர் எழுதிய 30 நிமிட வீடியோ [SysML இன் நான்கு தூண்கள்](https://youtu.be/998uznk9ogy) என்று அழைக்கப்படுகிறது.
uk: Якщо ви хочете дізнатися більше про ці чотири стовпи, перегляньте 30-хвилинне відео Ріка Штайнера під назвою [Чотири стовпи SysML] (https://youtu.be/998UznK9ogY).

source: Since Parametric Diagrams are one of the least used diagram types in SysML, we are going to only focus on the first three. The power of SysML comes in being able to make relationships between these three pillars. For example, by allocating behavior like an activity to an element of the structure like a block.
fr: Les Diagrammes Paramétriques étant l'un des types de diagrammes les moins utilisés en SysML, nous allons nous concentrer uniquement sur les trois premiers. La puissance de SysML réside dans la possibilité d'établir des relations entre ces trois piliers. Par exemple, en attribuant un comportement tel qu'une activité à un élément de la structure tel qu'un bloc.
ta: அளவுரு வரைபடங்கள் SysML இல் பயன்படுத்தப்பட்ட வரைபட வகைகளில் ஒன்றாகும் என்பதால், நாம் முதல் மூன்றில் மட்டுமே கவனம் செலுத்தப் போகிறோம். SysML இன் ஆற்றல் இந்த மூன்று தூண்களுக்கு இடையில் உறவுகளை ஏற்படுத்த முடியும். எடுத்துக்காட்டாக, ஒரு தொகுதி போன்ற கட்டமைப்பின் ஒரு உறுப்புக்கு ஒரு செயல்பாடு போன்ற நடத்தை ஒதுக்குவதன் மூலம்.
uk: Оскільки параметричні діаграми є одними з найменш використовуваних типів діаграм у SysML, ми зосередимося лише на перших трьох. Потужність SysML полягає в тому, що він здатний встановлювати зв’язки між цими трьома стовпами. Наприклад, шляхом призначення поведінки, як діяльності, елементу структури, наприклад блоку.

source: If you expand the top-level Abstraction Level packages in the Model Browser, each one contains three more packages, one for each pillar. It is in these packages that we will start to build up the design for the espresso machine.
fr: Si vous développez les paquets de niveau d'abstraction supérieur dans le navigateur de modèles, chacun d'eux contient trois autres paquets, un pour chaque pilier. C'est dans ces paquets que nous commencerons à construire la conception de la machine à expresso.
ta: மாதிரி உலாவியில் உயர்மட்ட சுருக்க நிலை தொகுப்புகளை நீங்கள் விரிவுபடுத்தினால், ஒவ்வொன்றும் மேலும் மூன்று தொகுப்புகளைக் கொண்டுள்ளன, ஒவ்வொரு தூணிற்கும் ஒன்று. இந்த தொகுப்புகளில்தான் எச்பிரெசோ இயந்திரத்திற்கான வடிவமைப்பை உருவாக்கத் தொடங்குவோம்.
uk: Якщо розгорнути пакунки рівня абстракції верхнього рівня в браузері моделей, кожен з них міститиме ще три пакунки, по одному для кожного стовпа. Саме з цих упаковок ми і почнемо будувати дизайн для еспресо-машини.

source: ![Three pillar packages nested under each abstraction level package.](images/coffee-machine-pillars.png)
fr: ![Trois paquets piliers imbriqués sous chaque paquet de niveau d'abstraction](images/coffee-machine-pillars.png)
ta: ![ஒவ்வொரு சுருக்க நிலை தொகுப்பின் கீழும் மூன்று தூண் தொகுப்புகள் உள்ளமைக்கப்பட்டுள்ளன.](images/coffee-machine-pillars.png)
uk: ![Три стовпчасті пакети, вкладені під кожен пакет рівня абстракції.](images/coffee-machine-pillars.png)

source: Three pillar packages nested under each abstraction levelpackage.
fr: Des paquets de trois pilliers composent les paquets sous chaque niveau d'abstraction.
ta: மூன்று தூண் தொகுப்புகள் ஒவ்வொரு சுருக்க நிலை நிலையின் கீழும் கூடு கட்டப்பட்டுள்ளன.
uk: Три стовпчасті пакети, вкладені під кожен пакет рівня абстракції.

source: Table of Contents
fr: Table des matières
ta: உள்ளடக்க அட்டவணை
uk: Зміст

source: Coffee Machine: Concept Level
fr: Machine à café : Niveau conceptuel
ta: காபி இயந்திரம்: கருத்து நிலை
uk: Кавоварка: рівень концепції

source: The concept level defines the problem we are trying to solve. For the espresso machine, we are going to use diagrams at this abstraction level to answer questions like:
fr: Le niveau conceptuel définit le problème que nous essayons de résoudre. Pour la machine à expresso, nous allons utiliser des diagrammes à ce niveau d'abstraction pour répondre à des questions telles que :
ta: நாம் தீர்க்க முயற்சிக்கும் சிக்கலை கருத்து நிலை வரையறுக்கிறது. எச்பிரெசோ இயந்திரத்தைப் பொறுத்தவரை, இந்த சுருக்க மட்டத்தில் வரைபடங்களைப் பயன்படுத்தப் போகிறோம்: இது போன்ற கேள்விகளுக்கு பதிலளிக்க:
uk: Рівень концепції визначає проблему, яку ми намагаємося вирішити. Для еспресо-машини ми збираємося використовувати діаграми на цьому рівні абстракції, щоб відповісти на такі питання, як:

source: Who will use the machine and what are their goals while using it?
fr: Qui utilisera la machine et quels sont ses objectifs ?
ta: இயந்திரத்தை யார் பயன்படுத்துவார்கள், அதைப் பயன்படுத்தும் போது அவர்களின் குறிக்கோள்கள் என்ன?
uk: Хто буде використовувати машину і які цілі вони переслідують при її використанні?

source: What sequence of events will a person take while operating the machine?
fr: Quelle est la séquence d'événements qu'une personne doit suivre lors de l'utilisation de la machine ?
ta: இயந்திரத்தை இயக்கும் போது ஒரு நபர் எந்த நிகழ்வுகளை எடுக்கும்?
uk: Яка послідовність подій відбудеться у людини під час роботи з машиною?

source: What are the key features and capabilities required for the machine to perform its intended function?
fr: Quelles sont les principales caractéristiques et capacités requises pour que la machine remplisse la fonction pour laquelle elle a été conçue ?
ta: இயந்திரம் அதன் நோக்கம் கொண்ட செயல்பாட்டைச் செய்ய தேவையான முக்கிய நற்பொருத்தங்கள் மற்றும் திறன்கள் யாவை?
uk: Які ключові характеристики та можливості необхідні машині для виконання призначеної функції?

source: What are the design constraints and requirements that must be considered when designing the machine?
fr: Quelles sont les contraintes et les exigences à prendre en compte lors de la conception de la machine ?
ta: இயந்திரத்தை வடிவமைக்கும்போது கருத்தில் கொள்ள வேண்டிய வடிவமைப்பு கட்டுப்பாடுகள் மற்றும் தேவைகள் யாவை?
uk: Які конструктивні обмеження та вимоги необхідно враховувати при проектуванні машини?

source: What are the key performance metrics that the machine must meet in order to be considered successful?
fr: Quels sont les principaux indicateurs de performance que la machine doit atteindre pour être considérée comme une réussite ?
ta: வெற்றிகரமாக கருதப்படுவதற்கு இயந்திரம் சந்திக்க வேண்டிய முக்கிய செயல்திறன் அளவீடுகள் யாவை?
uk: Яким ключовим показникам продуктивності має відповідати машина, щоб вважатися успішною?

source: How will the machine fit into the larger context of the café, and how will it interact with other systems and components within the café?
fr: Comment la machine s'intégrera-t-elle dans le contexte plus large du café et comment interagira-t-elle avec les autres systèmes et composants du café ?
ta: இயந்திரம் கபேவின் பெரிய சூழலில் எவ்வாறு பொருந்தும், மேலும் இது கபேவுக்குள் உள்ள பிற அமைப்புகள் மற்றும் கூறுகளுடன் எவ்வாறு தொடர்பு கொள்ளும்?
uk: Як машина впишеться в ширший контекст кав’ярні та як вона взаємодіятиме з іншими системами та компонентами в кав’ярні?

source: What are the needs of others like those marketing, selling, manufacturing, or buying the machine?
fr: Quels sont les besoins d'autres personnes telles que celles qui commercialisent, vendent, fabriquent ou achètent la machine ?
ta: சந்தைப்படுத்தல், விற்பனை, விளைவாக்கம் அல்லது இயந்திரத்தை வாங்குவது போன்ற மற்றவர்களின் தேவைகள் என்ன?
uk: Які потреби інших, наприклад тих, хто займається маркетингом, продажем, виробництвом або купівлею машини?

source: At this level, the focus is on understanding the big picture of the espresso machine and its role within the café system. The answers to these questions will help guide the design and development of the machine at the logical and technology levels of abstraction.
fr: À ce niveau, l'accent est mis sur la compréhension de la vue d'ensemble de la machine à espresso et de son rôle dans le système du café. Les réponses à ces questions permettront d'orienter la conception et le développement de la machine aux niveaux d'abstraction logique et technologique.
ta: இந்த மட்டத்தில், எச்பிரெசோ இயந்திரத்தின் பெரிய படத்தையும், கபே அமைப்பினுள் அதன் பங்கையும் புரிந்துகொள்வதில் கவனம் செலுத்தப்படுகிறது. இந்த கேள்விகளுக்கான பதில்கள் இயந்திரத்தின் வடிவமைப்பு மற்றும் வளர்ச்சியை சுருக்கத்தின் தர்க்கரீதியான மற்றும் தொழில்நுட்ப மட்டங்களில் வழிநடத்த உதவும்.
uk: На цьому рівні увага зосереджена на розумінні загальної картини еспресо-машини та її ролі в системі кафе. Відповіді на ці запитання допоможуть скерувати дизайн і розробку машини на логічному та технологічному рівнях абстракції.

source: Use Case Diagram
fr: Diagramme des cas d'utilisation
ta: வழக்கு வரைபடத்தைப் பயன்படுத்து
uk: Діаграма варіантів використання

source: First the ants work on the behavior of the system. Expand the Behavior package in the Model Browser and double-click on the diagram named Use Cases.
fr: Les fourmis commencent par travailler sur le comportement du système. Développez le package Comportement dans le navigateur de modèle et double-cliquez sur le diagramme intitulé Cas d'utilisation.
ta: முதலில் எறும்புகள் அமைப்பின் நடத்தைக்கு வேலை செய்கின்றன. மாதிரி உலாவியில் நடத்தை தொகுப்பை விரிவுபடுத்தி, பயன்பாட்டு வழக்குகள் என்று பெயரிடப்பட்ட வரைபடத்தில் இருமுறை சொடுக்கு செய்யவும்.
uk: Спочатку мурахи працюють над поведінкою системи. Розгорніть пакет Behavior у браузері моделей і двічі клацніть діаграму з назвою Use Cases.

source: A use case diagram is a type of visual representation used in systems engineering to describe the functional requirements of a system, such as an espresso machine. In the context of the espresso machine, a use case diagram would be used to identify and define the different ways in which the machine will be used by its users, such as the café staff and customers.
fr: Un diagramme de cas d'utilisation est un type de représentation visuelle utilisé en ingénierie des systèmes pour décrire les exigences fonctionnelles d'un système, tel qu'une machine à expresso. Dans le contexte de la machine à espresso, un diagramme de cas d'utilisation serait utilisé pour identifier et définir les différentes façons dont la machine sera utilisée par ses utilisateurs, tels que le personnel du café et les clients.
ta: ஒரு பயன்பாட்டு வழக்கு வரைபடம் என்பது எச்பிரெசோ இயந்திரம் போன்ற ஒரு அமைப்பின் செயல்பாட்டுத் தேவைகளை விவரிக்க சிச்டம்ச் இன்சினியரிங் பயன்படுத்தப்படும் ஒரு வகை காட்சி பிரதிநிதித்துவமாகும். எச்பிரெசோ இயந்திரத்தின் சூழலில், கபே ஊழியர்கள் மற்றும் வாடிக்கையாளர்கள் போன்ற அதன் பயனர்களால் இயந்திரம் பயன்படுத்தப்படும் வெவ்வேறு வழிகளைக் கண்டறிந்து வரையறுக்க ஒரு பயன்பாட்டு வழக்கு வரைபடம் பயன்படுத்தப்படும்.
uk: Діаграма варіантів використання — це тип візуального представлення, який використовується в системній інженерії для опису функціональних вимог системи, наприклад еспресо-машини. У контексті кавоварки еспресо діаграма варіантів використання використовувалася б для ідентифікації та визначення різних способів використання машини її користувачами, наприклад персоналом кафе та клієнтами.

source: The diagram would typically include different actors or users, such as the barista, the customer, and possibly a manager or maintenance technician. It would also include different "use cases" or scenarios, which describe the different actions that the users can take with the machine, such as placing an order, making an espresso, or cleaning the machine.
fr: Le diagramme inclut généralement différents acteurs ou utilisateurs, tels que le barman (barista), le client (customer), et éventuellement un directeur (manager) ou un technicien de maintenance (maintenance technician). Il comprend également différents « cas d'utilisation » ou scénarios, qui décrivent les différentes actions que les utilisateurs peuvent effectuer avec la machine, comme passer une commande, préparer un espresso ou nettoyer la machine.
ta: வரைபடத்தில் பொதுவாக பாரிச்டா, வாடிக்கையாளர் மற்றும் ஒரு மேலாளர் அல்லது பராமரிப்பு தொழில்நுட்ப வல்லுநர் போன்ற வெவ்வேறு நடிகர்கள் அல்லது பயனர்கள் அடங்கும். இது வெவ்வேறு "பயன்பாட்டு வழக்குகள்" அல்லது காட்சிகளையும் உள்ளடக்கும், இது பயனர்கள் இயந்திரத்துடன் எடுக்கக்கூடிய வெவ்வேறு செயல்களை விவரிக்கும், அதாவது ஒரு ஆர்டரை வைப்பது, எச்பிரெசோ தயாரிப்பது அல்லது இயந்திரத்தை தூய்மை செய்தல்.
uk: Діаграма зазвичай включатиме різних учасників або користувачів, таких як бариста, клієнт і, можливо, менеджер або технік з обслуговування. Він також включатиме різні «випадки використання» або сценарії, які описують різні дії, які користувачі можуть виконувати з машиною, як-от розміщення замовлення, приготування еспресо або чищення машини.

source: The use case diagram helps to ensure that all the necessary functional requirements of the espresso machine are identified and accounted for, and that the system is designed to meet the needs of its users. It can also be used as a communication tool between the different stakeholders involved in the development of the machine, such as the ants and Cappuccino the cat.
fr: Le diagramme des cas d'utilisation permet de s'assurer que toutes les exigences fonctionnelles nécessaires à la machine à espresso sont identifiées et prises en compte, et que le système est conçu pour répondre aux besoins de ses utilisateurs. Il peut également servir d'outil de communication entre les différents acteurs impliqués dans le développement de la machine, tels que les fourmis et Cappuccino le chat.
ta: எச்பிரெசோ இயந்திரத்தின் தேவையான அனைத்து செயல்பாட்டு தேவைகளும் அடையாளம் காணப்பட்டு கணக்கிடப்படுவதை உறுதிப்படுத்த பயன்பாட்டு வழக்கு வரைபடம் உதவுகிறது, மேலும் கணினி அதன் பயனர்களின் தேவைகளைப் நிறைவு செய்ய வடிவமைக்கப்பட்டுள்ளது. எறும்புகள் மற்றும் கப்புசினோ தி கேட் போன்ற இயந்திரத்தின் வளர்ச்சியில் ஈடுபட்டுள்ள வெவ்வேறு பங்குதாரர்களுக்கு இடையில் இது ஒரு தகவல்தொடர்பு கருவியாகவும் பயன்படுத்தப்படலாம்.
uk: Діаграма варіантів використання допомагає переконатися, що всі необхідні функціональні вимоги еспресо-машини визначені та враховані, а також що система розроблена відповідно до потреб своїх користувачів. Його також можна використовувати як засіб спілкування між різними зацікавленими сторонами, залученими до розробки машини, наприклад мурахами та котом Капучіно.

source: The ants need your help updating the diagrams, so let's get started:
fr: Les fourmis ont besoin de votre aide pour mettre à jour les diagrammes, alors commençons :
ta: எறும்புகளுக்கு வரைபடங்களைப் புதுப்பிக்க உங்கள் உதவி தேவை, எனவே தொடங்குவோம்:
uk: Мурахам потрібна ваша допомога в оновленні діаграм, тож почнемо:

source: Double-click on the actor to pop up the rename dialog, and replace User with Barista.
fr: Double-cliquez sur l'acteur pour faire apparaître la boîte de dialogue de renommage et remplacez Utilisateur par Barman.
ta: மறுபெயரிடு உரையாடலை பாப் செய்ய நடிகருக்கு இருமுறை சொடுக்கு செய்து, பயனரை பாரிச்டாவுடன் மாற்றவும்.
uk: Двічі клацніть на акторі, щоб відкрити діалогове вікно перейменування та замінити User на Barista.

source: Update the name of the oval Use Case from Use Case #1 to Brew espresso.
fr: Mise à jour : le nom du cas d'utilisation ovale passe du cas d'utilisation n°1 à la préparation d'un espresso.
ta: எச்பிரெசோவை காய்ச்சுவதற்கு பயன்பாட்டு வழக்கு #1 இலிருந்து ஓவல் பயன்பாட்டு வழக்கின் பெயரைப் புதுப்பிக்கவும்.
uk: Оновіть назву овального варіанту використання з варіанта використання №1 на варіння еспресо.

source: Update the name of the rectangle Block from Feature to Espresso Machine
fr: Mise à jour : le nom du rectangle 'Bloc de fonctionnalité' à 'machine à café expresso'
ta: அம்சத்திலிருந்து எச்பிரெசோ இயந்திரத்திற்கு செவ்வக தொகுதியின் பெயரைப் புதுப்பிக்கவும்
uk: Оновіть назву прямокутного блоку з Feature на Espresso Machine

source: A barista interacts with the espresso machine. The barista is provided a simple interface with a few push buttons.
fr: Un barman (barista) interagit avec la machine à espresso. Le barman (barista) dispose d'une interface simple avec quelques boutons poussoirs.
ta: ஒரு பாரிச்டா எச்பிரெசோ இயந்திரத்துடன் தொடர்பு கொள்கிறது. பாரிச்டாவுக்கு ஒரு சில புச் பொத்தான்கள் ஒரு எளிய இடைமுகம் வழங்கப்படுகிறது.
uk: Бариста взаємодіє з еспресо-машиною. Бариста має простий інтерфейс із кількома кнопками.

source: In this particular use case diagram, we have one actor named Barista and one use case called Brew espresso, which is allocated to a block called Espresso Machine. The actor, in this case, is a cat barista who interacts with the system (an espresso machine) to accomplish a particular task, which is brewing espresso.
fr: Dans ce diagramme de cas d'utilisation particulier, nous avons un acteur nommé Barista (le barman) et un cas d'utilisation appelé Brew espresso, qui est attribué à un bloc appelé Espresso Machine. L'acteur, dans ce cas, est un chat barman qui interagit avec le système (une machine à expresso) pour accomplir une tâche particulière, à savoir préparer un expresso.
ta: இந்த குறிப்பிட்ட பயன்பாட்டு வழக்கு வரைபடத்தில், எங்களிடம் பாரிச்டா என்ற ஒரு நடிகர் மற்றும் ப்ரூ எச்பிரெசோ எனப்படும் ஒரு பயன்பாட்டு வழக்கு உள்ளது, இது எச்பிரெசோ மெசின் எனப்படும் தொகுதிக்கு ஒதுக்கப்பட்டுள்ளது. நடிகர், இந்த விசயத்தில், ஒரு பூனை பாரிச்டா, அவர் ஒரு குறிப்பிட்ட பணியை நிறைவேற்ற கணினியுடன் (ஒரு எச்பிரெசோ இயந்திரம்) தொடர்பு கொள்கிறார், இது எச்பிரெசோவை காய்ச்சுகிறது.
uk: На цій конкретній діаграмі варіантів використання ми маємо одного актора під назвою Barista та один варіант використання під назвою Brew espresso, який виділено в блок під назвою Espresso Machine. У цьому випадку актором є кіт-бариста, який взаємодіє з системою (машиною для приготування еспресо), щоб виконати певне завдання, яким є приготування еспресо.

source: Use case diagram showing an actor named Barista and a use case called Brew espresso
fr: Le diagramme de cas d'utilisation montre un acteur nommé 'Barista' (le barman) et un cas d'utilisation appelé 'Brew espresso' (Préparer expresso)
ta: பாரிச்டா என்ற நடிகர் மற்றும் ப்ரூ எச்பிரெசோ எனப்படும் பயன்பாட்டு வழக்கு ஆகியவற்றைக் காட்டும் வழக்கு வரைபடத்தைப் பயன்படுத்தவும்
uk: Діаграма варіантів використання, на якій показано актора на ім’я Бариста та варіант використання під назвою «Варити еспресо»

source: The use case Brew espresso represents a specific functionality or action that the system (the Espresso Machine block) can perform. It describes the steps or interactions necessary to complete the task of brewing espresso, such as selecting the appropriate settings, starting the brewing process, and stopping the process once it's complete.
fr: Le cas d'utilisation 'Brew espresso' (Préparer espresso) représente une fonctionnalité ou une action spécifique que le système (le Espresso Machine block (bloc Machine à espresso)) peut réaliser. Il décrit les étapes ou les interactions nécessaires pour accomplir la tâche de préparation d'un espresso, comme la sélection des paramètres appropriés, le démarrage du processus de préparation et l'arrêt du processus une fois qu'il est terminé.
ta: பயன்பாட்டு கேச் ப்ரூ எச்பிரெசோ கணினி (எச்பிரெசோ மெசின் பிளாக்) செய்யக்கூடிய ஒரு குறிப்பிட்ட செயல்பாடு அல்லது செயலைக் குறிக்கிறது. பொருத்தமான அமைப்புகளைத் தேர்ந்தெடுப்பது, காய்ச்சும் செயல்முறையைத் தொடங்குதல் மற்றும் செயல்முறையை முடிந்ததும் நிறுத்துவது போன்ற எச்பிரெசோவை காய்ச்சுவதற்கான பணியை முடிக்க தேவையான படிகள் அல்லது தொடர்புகளை இது விவரிக்கிறது.
uk: Варіант використання Варити еспресо представляє певну функцію або дію, яку може виконувати система (блок еспресо-машини). Він описує кроки або дії, необхідні для завершення завдання приготування еспресо, як-от вибір відповідних налаштувань, запуск процесу заварювання та зупинка процесу після його завершення.
