Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: To create a new diagram, use the Model Browser. Select the element that should contain the new diagram. For now, select _New Model_. Click the New Diagram menu (![Plus symbol of the New Diagram popup menu.](images/list-add-symbolic.svg)) in the header bar.
fr: Pour créer un nouveau diagramme, utilisez le navigateur de modèles. Sélectionnez l'élément dans lequel le nouveau diagramme doit être intégré. Sélectionnez pour l'instant l'option _Nouveau modèle_(_New Model_). Dans la barre d'en-tête, cliquez sur le menu Nouveau diagramme (![Symbole plus du menu contextuel Nouveau diagramme.](images/list-add-symbolic.svg)) in the header bar.
ta: புதிய வரைபடத்தை உருவாக்க, மாதிரி உலாவியைப் பயன்படுத்தவும். புதிய வரைபடத்தைக் கொண்டிருக்க வேண்டிய உறுப்பைத் தேர்ந்தெடுக்கவும். இப்போதைக்கு, _ நியூ மாடல்_ என்பதைத் தேர்ந்தெடுக்கவும். தலைப்பு பட்டியில் புதிய வரைபட மெனுவைக் சொடுக்கு செய்க (! [புதிய வரைபட பாப்அப் மெனுவின் அடையாளம்.
uk: Щоб створити нову діаграму, скористайтеся браузером моделей. Виберіть елемент, який має містити нову діаграму. Наразі виберіть _Нова модель_. Клацніть меню Нова діаграма (![Символ плюса спливного меню Нова діаграма.](images/list-add-symbolic.svg)) у рядку заголовка.

source: Plus symbol of the New Diagram popup menu.
fr: Symbole 'plus' du menu contextuel Nouveau diagramme.
ta: புதிய வரைபட பாப்அப் மெனுவின் அடையாளம்.
uk: Символ «плюс» спливаючого меню «Нова діаграма».

source: ![The New Diagram popup window.](images/first-model-new-diagram-popup.png)
fr: ![La fenêtre contextuelle Nouveau diagramme.](images/first-model-new-diagram-popup.png)
ta: ![புதிய வரைபடம் மேல்தோன்றும் சாளரம்.](images/first-model-new-diagram-popup.png)
uk: ![Спливаюче вікно «Нова діаграма»..](images/first-model-new-diagram-popup.png)

source: The New Diagram popup window.
fr: La fenêtre contextuelle Nouveau diagramme.
ta: புதிய வரைபடம் பாப்அப் சாளரம்.
uk: Спливаюче вікно «Нова діаграма».

source: Select _New Generic Diagram_ and a new diagram is created.
es: Seleccione _Diagrama genérico nuevo_ y se creará un diagrama nuevo.
fr: Sélectionnez _New Generic Diagram_ (_Nouveau diagramme générique_) et un nouveau diagramme est créé.
ta: _ புதிய பொதுவான வரைபடம்_ மற்றும் புதிய வரைபடம் உருவாக்கப்பட்டது.
uk: Виберіть _New Generic Diagram_, і буде створено нову діаграму.

source: Now drag the elements from the Model Browser onto the new diagram. First the classes `Shape` and `Circle`. Add the generalization last. Drop it somewhere between the two classes. The relation will be created to the diagram.
es: Ahora arrastre los elementos del Navegador de modelos al diagrama nuevo. Primero las clases `Forma` y `Círculo`. Añada la generalización en último lugar. Suéltela en algún lugar entre las dos clases. La relación se creará en el diagrama.
fr: Faites maintenant glisser les éléments du navigateur de modèle sur le nouveau diagramme. Commencez par ajouter les classes `Shape` (Forme) et `Circle` (Cercle). Ajoutez la généralisation en dernier. Déposez-la entre les deux classes. La relation sera créée automatiquement dans le diagramme.
ta: இப்போது மாதிரி உலாவியில் இருந்து உறுப்புகளை புதிய வரைபடத்தில் இழுக்கவும். முதலில் வகுப்புகள் `வடிவம்` மற்றும்` வட்டம்`. கடைசியாக பொதுமைப்படுத்தலைச் சேர்க்கவும். இரண்டு வகுப்புகளுக்கு இடையில் எங்காவது அதை விடுங்கள். உறவு வரைபடத்திற்கு உருவாக்கப்படும்.
uk: Тепер перетягніть елементи з браузера моделей на нову діаграму. Спочатку класи `Shape` та `Circle`. Узагальнення додайте останнім. Помістіть його десь між цими двома класами. Буде створено відношення до діаграми.

source: Now change the name of class `Circle` to `Ellipse`. Check the other diagram. The name has been changed there as well.
es: Ahora cambie el nombre de la clase `Círculo` por `Elipse`. Compruebe el otro diagrama. El nombre ha cambiado allí también.
fr: Maintenant, changez le nom de la classe `Circle` (Cercle) en `Ellipse`. Vérifiez l'autre diagramme. Le nom a également été modifié.
ta: இப்போது வகுப்பு `வட்டம்` பெயரை` எலிப்ச்` ஆக மாற்றவும். மற்ற வரைபடத்தை சரிபார்க்கவும். பெயர் அங்கேயும் மாற்றப்பட்டுள்ளது.
uk: Тепер змініть назву класу `Circle` на `Ellipse`. Перевірте іншу схему. Там також змінили назву.

source: Elements in a diagram are only a _representation_ of the elements in the underlying model. The model is what you see in the Model Browser.
es: Los elementos de un diagrama son sólo una _representación_ de los elementos del modelo subyacente. El modelo es lo que se ve en el Navegador de modelos.
fr: Les éléments d'un diagramme ne sont qu'une _representation_ (_représentation_) des éléments du modèle sous-jacent. Le modèle est ce que vous voyez dans le navigateur de modèle(Model Browser).
ta: ஒரு வரைபடத்தில் உள்ள கூறுகள் அடிப்படை மாதிரியில் உள்ள உறுப்புகளின் _ மறுபரிசீலனை_ மட்டுமே. மாதிரி உலாவியில் நீங்கள் காணும் மாதிரி.
uk: Елементи на діаграмі є лише _представленням_ елементів базової моделі. Модель – це те, що ви бачите в переглядачі моделей.

source: Elements in the model are automatically removed when there are no more representations in any of the diagrams.
es: Los elementos del modelo se eliminan automáticamente cuando ya no hay representaciones en ninguno de los diagramas.
fr: Les éléments du modèle sont automatiquement supprimés lorsqu'il n'y a plus de représentations dans aucun des diagrammes.
ta: எந்தவொரு வரைபடத்திலும் அதிக பிரதிநிதித்துவங்கள் இல்லாதபோது மாதிரியில் உள்ள கூறுகள் தானாகவே அகற்றப்படும்.
uk: Елементи в моделі автоматично видаляються, коли на жодній із діаграм більше немає зображень.

source: Examples of Gaphor models
fr: Exemples de modèles Gaphor
ta: கஃபர் மாதிரிகளின் எடுத்துக்காட்டுகள்
uk: Приклади моделей Gaphor

source: SysML Models
fr: Modèles SysML
ta: SysML மாதிரிகள்
uk: Моделі SysML

source: To see how a larger model comes together in Gaphor check out [Gaphor Distilled](https://github.com/mikekidner/gaphor_distilled) which implements the DELL-SAT-77 model used as the basis for [SysML Distilled](https://delligattiassociates.com/publications/?_gl=1*1tu6ekh*_ga*MTMwMTU4NjMyNC4xNzMyNTYyOTUw*_up*MQ..) one of the standard references for the SysML language.
fr: Pour voir comment un modèle plus large est assemblé dans Gaphor, consultez [Gaphor Distilled](https://github.com/mikekidner/gaphor_distilled) qui met en œuvre le modèle DELL-SAT-77 utilisé comme base pour [SysML Distilled](https://delligattiassociates.com/publications/?_gl=1*1tu6ekh*_ga*MTMwMTU4NjMyNC4xNzMyNTYyOTUw*_up*MQ..) l'une des références standard pour le langage SysML.
ta: கஃபரில் ஒரு பெரிய மாதிரி எவ்வாறு ஒன்றாக வருகிறது என்பதைப் பார்க்க [கஃபர் வடிகட்டப்பட்ட](https://github.com/mikekidner/gaphor_distilled) இது SysML மொழிக்கான நிலையான குறிப்புகளில் ஒன்றான [SysML வடிகட்டப்பட்ட](https://delligattiassociates.com/publications/?_gl=1*1tu6ekh*_ga*MTMwMTU4NjMyNC4xNzMyNTYyOTUw*_up*MQ..) க்கு அடிப்படையாகப் பயன்படுத்தப்படும் DELL-SAT-77 மாதிரியைச் செயல்படுத்துகிறது.
uk: Щоб побачити, як більша модель збирається в Gaphor, перегляньте [Gaphor Distilled](https://github.com/mikekidner/gaphor_distilled), який реалізує модель DELL-SAT-77, що використовується як основа для [SysML Distilled](https://delligattiassociates.com/publications/?_gl=1*1tu6ekh*_ga*MTMwMTU4NjMyNC4xNzMyNTYyOTUw*_up*MQ..), одного зі стандартних посилань для мови SysML.

source: Framework
ta: கட்டமைப்பு
uk: Каркас

source: Overview
es: Resumen
fr: Vue d'ensemble
ta: கண்ணோட்டம்
uk: Огляд

source: Gaphor is built in a light, service oriented fashion. The application is split in a series of services, such as a file, event, and undo managers. Those services are loaded based on entry points defined in the `pyproject.toml` file. To learn more about the architecture, please see the description about the [Service Oriented Architecture](service_oriented.md).
es: Gaphor está construido de una manera ligera y orientada a servicios. La aplicación se divide en una serie de servicios, como un gestor de archivos, eventos y deshacer. Estos servicios se cargan en base a los puntos de entrada definidos en el archivo `pyproject.toml`. Para obtener más información sobre la arquitectura, consulte la descripción sobre la [Arquitectura Orientada a Servicios](service_oriented.md).
fr: Gaphor est conçu pour être léger et orienté vers les services. L'application est divisée en une série de services, tels que les gestionnaires de fichiers, d'événements et d'annulations. Ces services sont chargés en fonction des points d'entrée définis dans le fichier `pyproject.toml`. Pour en savoir plus sur l'architecture, veuillez consulter la description de l'architecture orientée services [Service Oriented Architecture](service_oriented.md).
ta: கஃபர் ஒரு ஒளி, பணி சார்ந்த பாணியில் கட்டப்பட்டுள்ளது. ஒரு கோப்பு, நிகழ்வு மற்றும் செயல்தவிர் மேலாளர்கள் போன்ற தொடர்ச்சியான சேவைகளில் பயன்பாடு பிரிக்கப்பட்டுள்ளது. `Pyproject.toml` கோப்பில் வரையறுக்கப்பட்ட நுழைவு புள்ளிகளின் அடிப்படையில் அந்த சேவைகள் ஏற்றப்படுகின்றன. கட்டிடக்கலை பற்றி மேலும் அறிய, தயவுசெய்து [சேவை சார்ந்த கட்டமைப்பு](service_oriented.md) பற்றிய விளக்கத்தைப் பார்க்கவும்.
uk: Gaphor побудований у легкій, сервіс-орієнтованій манері. Додаток розділено на низку сервісів, таких як менеджери файлів, подій та скасувань. Ці сервіси завантажуються на основі точок входу, визначених у файлі `pyproject.toml`. Щоб дізнатися більше про архітектуру, будь ласка, перегляньте опис [Сервісно-орієнтованої архітектури] (service_oriented.md).

source: Event driven
es: Dirigido por eventos
fr: Axé sur les événements
ta: நிகழ்வு இயக்கப்படுகிறது
uk: Керується подією

source: Parts of Gaphor communicate with each other through events. Whenever something important happens, for example, an attribute of a model element changes, an event is sent. When other parts of the application are interested in a change, they register an event handler for that event type. Events are emitted though a central broker so you do not have to register on every individual element that can send an event they are interested in. For example, a diagram item could register an event rule and then check if the element that sent the event is actually the event the item is representing. For more information see the full description of the [event system](event_system).
fr: Les parties de Gaphor communiquent entre elles par le biais d'événements. Lorsque quelque chose d'important se produit, par exemple un changement d'attribut d'un élément de modèle, un événement est envoyé. Lorsque d'autres parties de l'application sont intéressées par un changement, elles enregistrent un gestionnaire d'événement pour ce type d'événement. Les événements sont émis par l'intermédiaire d'un courtier central, de sorte qu'il n'est pas nécessaire de s'enregistrer pour chaque élément individuel susceptible d'envoyer un événement qui les intéresse. Par exemple, un élément de diagramme peut enregistrer une règle d'événement et vérifier ensuite si l'élément qui a envoyé l'événement est réellement l'événement que l'élément représente. Pour plus d'informations, voir la description complète du [event system](event_system).
ta: கஃபரின் பகுதிகள் நிகழ்வுகள் மூலம் ஒருவருக்கொருவர் தொடர்பு கொள்கின்றன. முக்கியமான ஏதாவது நிகழும்போது, எடுத்துக்காட்டாக, ஒரு மாதிரி உறுப்பின் பண்புக்கூறு மாறுகிறது, ஒரு நிகழ்வு அனுப்பப்படுகிறது. பயன்பாட்டின் பிற பகுதிகள் மாற்றத்தில் ஆர்வம் காட்டும்போது, அந்த நிகழ்வு வகைக்கு நிகழ்வு கையாளுபவரை அவர்கள் பதிவு செய்கிறார்கள். ஒரு மைய தரகர் என்றாலும் நிகழ்வுகள் வெளியேற்றப்படுகின்றன, எனவே அவர்கள் ஆர்வமுள்ள ஒரு நிகழ்வை அனுப்பக்கூடிய ஒவ்வொரு தனிப்பட்ட உறுப்பிலும் நீங்கள் பதிவு செய்ய வேண்டியதில்லை. எடுத்துக்காட்டாக, ஒரு வரைபட உருப்படி ஒரு நிகழ்வு விதியை பதிவு செய்து, நிகழ்வை அனுப்பிய உறுப்பு என்று சரிபார்க்கவும் உண்மையில் உருப்படி குறிக்கும் நிகழ்வு. மேலும் தகவலுக்கு [நிகழ்வு அமைப்பு](event_system) இன் முழு விளக்கத்தையும் காண்க.
uk: Частини Gaphor спілкуються між собою за допомогою подій. Щоразу, коли відбувається щось важливе, наприклад, змінюється атрибут елемента моделі, надсилається подія. Коли інші частини програми зацікавлені у зміні, вони реєструють обробник події для цього типу подій. Події надсилаються через центральний брокер, тому вам не потрібно реєструвати кожен окремий елемент, який може надіслати подію, що їх цікавить. Наприклад, елемент діаграми може зареєструвати правило події, а потім перевірити, чи елемент, який надіслав подію, насправді є тією подією, яку представляє цей елемент. Для отримання додаткової інформації зверніться до повного опису [системи подій](event_system).

source: Transactional
es: Transaccional
fr: Transactionnel
ta: பரிவர்த்தனை
uk: Трансакційний

source: Gaphor is transactional, which means it keeps track of the functions it performs as a series of transactions. The transactions work by sending an event when a transaction starts and sending another when a transaction ends. This allows, for example, the undo manager to keep a running log of the previous transactions so that a transaction can be reversed if the undo button is pressed.
fr: Gaphor est transactionnel, ce qui signifie qu'il conserve la trace des fonctions qu'il exécute sous la forme d'une série de transactions. Les transactions s'envoient un événement lorsqu'elles commencent, puis un autre lorsqu'elles se terminent. Cela permet notamment au gestionnaire d'annulation de conserver un journal des transactions précédentes, de sorte qu'il soit possible d'annuler une transaction en appuyant sur le bouton d'annulation.
ta: கஃபர் பரிவர்த்தனை, அதாவது இது தொடர்ச்சியான பரிவர்த்தனைகளாக அது செய்யும் செயல்பாடுகளை கண்காணிக்கிறது. ஒரு பரிவர்த்தனை தொடங்கும் போது ஒரு நிகழ்வை அனுப்புவதன் மூலமும், பரிவர்த்தனை முடிவடையும் போது மற்றொன்றை அனுப்புவதன் மூலமும் பரிவர்த்தனைகள் செயல்படுகின்றன. எடுத்துக்காட்டாக, முந்தைய பரிவர்த்தனைகளின் இயங்கும் பதிவை வைத்திருக்க செயல்தவிர் மேலாளரை அனுமதிக்கிறது, இதனால் செயல்தவிர் பொத்தானை அழுத்தினால் ஒரு பரிவர்த்தனையை மாற்றியமைக்க முடியும்.
uk: Gaphor є транзакційним, що означає, що він відстежує функції, які він виконує, як серію транзакцій. Транзакції працюють, надсилаючи подію, коли транзакція починається, і надсилаючи іншу, коли транзакція закінчується. Це дозволяє, наприклад, менеджеру скасувань вести журнал попередніх транзакцій, щоб можна було скасувати транзакцію, якщо натиснути кнопку скасування.

source: Main Components
es: Componentes principales
fr: Composants principaux
ta: முக்கிய கூறுகள்
uk: Основні компоненти

source: The main portion of Gaphor that executes first is called the `Application`. Gaphor can have multiple models open at any time. Each model is kept in a `Session`. Only one Application instance is active. Each session will load its own services defined as [gaphor.services](service_oriented.md).
es: La parte principal de Gaphor que se ejecuta primero se llama `Aplicación`. Gaphor puede tener varios modelos abiertos en cualquier momento. Cada modelo se mantiene en una `Sesión`. Sólo una instancia de la aplicación está activa. Cada sesión cargará sus propios servicios definidos como [gaphor.services](service_oriented.md).
fr: La partie principale de Gaphor qui s'exécute en premier est appelée `Application`. Gaphor peut avoir plusieurs modèles ouverts à tout moment. Chaque modèle est conservé dans une `Session`. Une seule instance de l'application est active. Chaque session chargera ses propres services définis comme [gaphor.services](service_oriented.md).
ta: முதலில் செயல்படுத்தும் கஃபரின் முக்கிய பகுதி `விண்ணப்பம்` என்று அழைக்கப்படுகிறது. கஃபர் எந்த நேரத்திலும் பல மாதிரிகள் திறக்கப்படலாம். ஒவ்வொரு மாதிரியும் ஒரு `அமர்வில்` வைக்கப்பட்டுள்ளது. ஒரு பயன்பாட்டு நிகழ்வு மட்டுமே செயலில் உள்ளது. ஒவ்வொரு அமர்வும் [gaphor.services](service_oriented.md) என வரையறுக்கப்பட்ட அதன் சொந்த சேவைகளை ஏற்றும்.
uk: Основна частина Gaphor, яка виконується першою, називається "Додаток". У Gaphor може бути відкрито декілька моделей одночасно. Кожна модель зберігається у "Сесії". Активним є лише один екземпляр додатку. Кожен сеанс завантажує власні сервіси, визначені як [gaphor.services](service_oriented.md).

source: The most notable services are:
es: Los servicios más destacados son:
fr: Les services les plus importants sont les suivants :
ta: மிகவும் குறிப்பிடத்தக்க சேவைகள்:
uk: Найпомітніші послуги:

source: event_manager
es: gestor_de_eventos
fr: event_manager (gestionnaire d'événements)
ta: நிகழ்வு மேலாளர்

source: This is the central component used for event dispatching. Every service that does something with events (both sending and receiving) depends on this component.
es: Este es el componente central usado para el envío de eventos. Cada servicio que hace algo con eventos (tanto enviar como recibir) depende de este componente.
fr: Il s'agit du composant central utilisé pour la distribution des événements. Tous les services qui utilisent des événements (à la fois pour l'envoi et la réception) dépendent de ce composant.
ta: நிகழ்வு அனுப்புவதற்கு இது பயன்படுத்தப்படும் மைய கூறு ஆகும். நிகழ்வுகளுடன் ஏதாவது செய்யும் ஒவ்வொரு சேவையும் (அனுப்புதல் மற்றும் பெறுதல்) இந்த கூறுகளைப் பொறுத்தது.
uk: Це центральний компонент, який використовується для диспетчеризації подій. Кожна служба, яка щось робить з подіями (як надсилання, так і отримання), залежить від цього компонента.

source: element_factory
es: fábrica_de_elementos
fr: element_factory (fabrique d'éléments)
ta: உறுப்பு_பாக்டரி

source: The [data model](models/core) itself is maintained in the element factory ({obj}`~gaphor.core.modeling.ElementFactory`). This service is used to create model elements, as well as to lookup elements or query for a set of elements.
fr: Le 'modèle de données' [data model](models/core) lui-même est maintenu dans la fabrique d'éléments ({obj}`~gaphor.core.modeling.ElementFactory`). Ce service est utilisé pour créer des éléments de modèle, ainsi que pour rechercher des éléments ou un ensemble d'éléments.
ta: [தரவு மாதிரி](models/core) உறுப்பு தொழிற்சாலையில் ({obj}`~gaphor.core.modeling.ElementFactory`) பராமரிக்கப்படுகிறது. இந்த பணி மாதிரி கூறுகளை உருவாக்க பயன்படுகிறது, அத்துடன் தேடல் கூறுகள் அல்லது ஒரு உறுப்புக்கான வினவல்களுக்கும் பயன்படுத்தப்படுகிறது.
uk: Сама [модель даних](models/core) зберігається у фабриці елементів ({obj}`~gaphor.core.modeling.ElementFactory`). Цей сервіс використовується для створення елементів моделі, а також для пошуку елементів або запиту набору елементів.

source: One of the most appreciated services. It allows users to make a mistake every now and then!
es: Uno de los servicios más apreciados. ¡Permite a los usuarios equivocarse de vez en cuando!
fr: Un des services les plus appréciés. Il permet aux utilisateurs de se tromper de temps en temps !
ta: மிகவும் பாராட்டப்பட்ட சேவைகளில் ஒன்று. இது பயனர்களை ஒவ்வொரு முறையும் தவறு செய்ய அனுமதிக்கிறது!
uk: Одна з найдорожчих послуг. Це дозволяє користувачам час від часу робити помилки!

source: The undo manager is transactional. Actions performed by a user are only stored if a transaction is active. If a transaction is completed (committed) a new undo action is stored. Transactions can also be rolled back, in which case all changes are played back directly. For more information see the full description of the [undo manager](undo).
fr: Le gestionnaire d'annulation est transactionnel. Les actions effectuées par un utilisateur ne sont stockées que si une transaction est active. Si une transaction est terminée (validée), une nouvelle action d'annulation est stockée. Les transactions peuvent également être annulées, auquel cas toutes les modifications sont directement reproduites. Pour plus d'informations, voir la description complète du 'gestionnaire d'annulation' [undo manager](undo).
ta: செயல்தவிர் மேலாளர் பரிவர்த்தனை. ஒரு பரிவர்த்தனை செயலில் இருந்தால் மட்டுமே ஒரு பயனரால் செய்யப்படும் செயல்கள் சேமிக்கப்படும். ஒரு பரிவர்த்தனை முடிந்தால் (உறுதியுடன்) ஒரு புதிய செயல்தவிர் நடவடிக்கை சேமிக்கப்படும். பரிவர்த்தனைகளையும் மீண்டும் உருட்டலாம், இந்த விசயத்தில் அனைத்து மாற்றங்களும் நேரடியாக மீண்டும் இயக்கப்படுகின்றன. மேலும் தகவலுக்கு, [செயல்தவிர் மேலாளரின்](undo) இன் முழு விளக்கத்தையும் காண்க.
uk: Менеджер скасувань є транзакційним. Дії, виконані користувачем, зберігаються лише тоді, коли транзакція активна. Якщо транзакцію завершено (зафіксовано), зберігається нова дія скасування. Транзакції також можна відкотити, в цьому випадку всі зміни відтворюються безпосередньо. Для отримання додаткової інформації дивіться повний опис [undo manager](менеджер відміни).

source: Loading and saving a model is done through this service.
es: La carga y guardado de un modelo se realiza a través de este servicio.
fr: Le chargement et l'enregistrement d'un modèle s'effectuent par l'intermédiaire de ce service.
ta: ஒரு மாதிரியை ஏற்றுவதும் சேமிப்பதும் இந்த சேவையின் மூலம் செய்யப்படுகிறது.
uk: Завантаження та збереження моделі здійснюється через цей сервіс.

source: Example: Gaphor services
es: Ejemplo: Servicios de Gaphor
fr: Exemple : Services Gaphor
ta: எடுத்துக்காட்டு: காஃபர் சேவைகள்
uk: Приклад: послуги Gaphor

source: In this example we're doing something a little less trivial. In Gaphor, services are defined as [entry points](https://packaging.python.org/en/latest/specifications/entry-points/). Each service is a class, and takes parameters with names that match other services. This allows services to depend on other services.
fr: Dans cet exemple, nous faisons quelque chose d'un peu moins trivial. Dans Gaphor, les services sont définis comme des points d'entrée [entry points](https://packaging.python.org/en/latest/specifications/entry-points/). Chaque service est une classe et prend des paramètres dont les noms correspondent à ceux d'autres services. Cela permet aux services de dépendre d'autres services.
ta: இந்த எடுத்துக்காட்டில் நாங்கள் கொஞ்சம் குறைவான கீழான ஒன்றைச் செய்கிறோம். Gaphor இல், சேவைகள் [நுழைவு புள்ளிகள்](https://packaging.python.org/en/latest/specifications/entry-points/) என வரையறுக்கப்படுகின்றன. ஒவ்வொரு சேவையும் ஒரு வகை, மற்ற சேவைகளுடன் பொருந்தக்கூடிய பெயர்களுடன் அளவுருக்களை எடுக்கும். இது சேவைகளை மற்ற சேவைகளை சார்ந்து இருக்க அனுமதிக்கிறது.
uk: У цьому прикладі ми робимо дещо менш тривіальне. У Gaphor сервіси визначаються як [точки входу] (https://packaging.python.org/en/latest/specifications/entry-points/). Кожен сервіс є класом і отримує параметри з іменами, які збігаються з іменами інших сервісів. Це дозволяє сервісам залежати від інших сервісів.

source: It looks something like this:
es: Es algo parecido a esto:
fr: Il se présente comme suit :
ta: இது இதுபோன்றதாகத் தெரிகிறது:
uk: Виглядає це приблизно так:

source: Let's first load the entry points.
es: Carguemos primero los puntos de entrada.
fr: Commençons par charger les points d'entrée.
ta: முதலில் நுழைவு புள்ளிகளை ஏற்றுவோம்.
uk: Давайте спочатку завантажимо точки входу.

source: Now let's create a component in our model for every service.
es: Ahora vamos a crear un componente en nuestro modelo para cada servicio.
fr: Créons maintenant un composant dans notre modèle pour chaque service.
ta: இப்போது ஒவ்வொரு சேவைக்கும் எங்கள் மாதிரியில் ஒரு கூறுகளை உருவாக்குவோம்.
uk: Тепер давайте створимо компонент у нашій моделі для кожної служби.

source: With all components mapped, we can create dependencies between those components, based on the constructor parameter names.
es: Con todos los componentes mapeados, podemos crear dependencias entre esos componentes, basándonos en los nombres de los parámetros del constructor.
fr: Une fois tous les composants mappés, nous pouvons créer des dépendances entre ces composants, sur la base des noms des paramètres du constructeur.
ta: அனைத்து கூறுகளையும் வரைபடமாக்குவதன் மூலம், கட்டமைப்பாளர் அளவுரு பெயர்களின் அடிப்படையில் அந்த கூறுகளுக்கு இடையில் சார்புகளை உருவாக்கலாம்.
uk: Коли всі компоненти зіставлені, ми можемо створювати залежності між цими компонентами на основі імен параметрів конструктора.
