Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: In order to provide extra information to the diagram elements (mainly association ends), the Gaphor model has been extended with stereotypes.
es: Para proporcionar información adicional a los elementos del diagrama (principalmente extremos de asociación), el modelo Gaphor se ha ampliado con estereotipos.
fr: Afin de fournir des informations supplémentaires aux éléments du diagramme (principalement les extrémités d'association), le modèle Gaphor a été étendu avec des stéréotypes.
ta: வரைபடக் கூறுகளுக்கு கூடுதல் தகவல்களை வழங்குவதற்காக (முக்கியமாக அசோசியேசன் முனைகள்), GAPHOR மாதிரி ஒரே மாதிரியானவற்றுடன் நீட்டிக்கப்பட்டுள்ளது.
uk: Щоб надати додаткову інформацію елементам діаграми (головним чином кінцям асоціацій), модель Gaphor була розширена стереотипами.

source: Plugins
ta: செருகுநிரல்கள்
uk: Плагіни

source: Plugins is an experimental feature! The API may change.
fr: Plugins est une fonctionnalité expérimentale ! L'API peut changer.
ta: செருகுநிரல்கள் ஒரு சோதனை அம்சம்! பநிஇ மாறக்கூடும்.
uk: Плагіни — це експериментальна функція! API може змінюватися.

source: We welcome you to try and provide your feedback.
fr: Nous vous invitons à l'essayer et à nous faire part de vos commentaires.
ta: உங்கள் கருத்தை வழங்க முயற்சிக்கிறோம்.
uk: Ми запрошуємо вас спробувати надіслати свій відгук.

source: Plugins allow you to extend the functionality of Gaphor beyond the features provided in the standard distributions. In particular, plugins can be helpful if you install the binary distributions available on the [download page](https://gaphor.org/download/).
fr: Les plugins vous permettent d'étendre les fonctionnalités de Gaphor au-delà des fonctionnalités fournies dans les distributions standard. En particulier, les plugins peuvent être utiles si vous installez les distributions binaires disponibles sur la [page de téléchargement] (https://gaphor.org/download/).
ta: நிலையான விநியோகங்களில் வழங்கப்பட்ட அம்சங்களுக்கு அப்பால் கஃபரின் செயல்பாட்டை நீட்டிக்க செருகுநிரல்கள் உங்களை அனுமதிக்கின்றன. குறிப்பாக, [பதிவிறக்கப் பக்கத்தில்](https://gaphor.org/ta/download/) இல் கிடைக்கும் பைனரி விநியோகங்களை நிறுவினால் செருகுநிரல்கள் உதவியாக இருக்கும்.
uk: Плагіни дозволяють розширити функціональність Gaphor за межі можливостей, наданих у стандартних дистрибутивах. Зокрема, плагіни можуть бути корисними, якщо ви встановлюєте бінарні дистрибутиви, доступні на [сторінці завантаження](https://gaphor.org/download/).

source: Gaphor can be extended via entry points in several ways:
fr: Gaphor peut être étendu par des points d'entrée de plusieurs manières :
ta: நுழைவு புள்ளிகள் வழியாக பல வழிகளில் கஃபர் நீட்டிக்கப்படலாம்:
uk: Gaphor можна розширити через точки входу кількома способами:

source: Application (global) services (`gaphor.appservices`)
fr: Services d'application (globaux) (`gaphor.appservices`)
ta: பயன்பாடு (உலகளாவிய) சேவைகள் (`gaphor.appservices`)
uk: Додатки (глобальні) служби (`gaphor.appservices`)

source: Session specific services (`gaphor.services`)
fr: Services spécifiques à la session (`gaphor.services`)
ta: அமர்வு குறிப்பிட்ட சேவைகள் (`kaphor.services`)
uk: Спеціальні служби сеансу (`gaphor.services`)

source: [Modeling languages](modeling_language) (`gaphor.modelinglanguages`)
fr: [Langues de modélisation](modeling_language) (`gaphor.modelinglanguages`)
ta: [மாதிரியமைத்தல் மொழிகள்](modeling_language) (`gaphor.modelinglanguages`)
uk: [Мови моделювання](modeling_language) (`gaphor.modelinglanguages`)

source: (Sub)command line parsers (`gaphor.argparsers`)
fr: Analyseurs de ligne de (sous-)commande (`gaphor.argparsers`)
ta: (துணை) கட்டளை வரி பாகுபடுத்தி (`gaphor.argparse`)
uk: (Під)парсери командного рядка (`gaphor.argparsers`)

source: Indirectly loaded modules (`gaphor.modules`), mainly for UI components
fr: Modules chargés indirectement (`gaphor.modules`), principalement pour les composants de l'interface utilisateur
ta: மறைமுகமாக ஏற்றப்பட்ட தொகுதிகள் (`kaphor.modules`), முக்கியமாக இடைமுகம் கூறுகளுக்கு
uk: Непрямо завантажені модулі (`gaphor.modules`), переважно для компонентів інтерфейсу користувача

source: The default location for plugins is `$HOME/.local/gaphor/plugins-2` (`$USER/.local/gaphor/plugins-2` on Windows). This location can be changed by setting the environment variable `GAPHOR_PLUGIN_PATH` and point to a directory.
fr: L'emplacement par défaut des plugins est `$HOME/.local/gaphor/plugins-2` (`$USER/.local/gaphor/plugins-2` sous Windows). Cet emplacement peut être modifié en définissant la variable d'environnement `GAPHOR_PLUGIN_PATH` et en pointant vers un répertoire.
ta: செருகுநிரல்களுக்கான இயல்புநிலை இருப்பிடம் `$ முகப்பு/.லோகல்/கஃபர்/செருகுநிரல்கள் -2` (` $ பயனர்/.லோகல்/கஃபர்/செருகுநிரல்கள் -2` விண்டோசில்). சுற்றுச்சூழல் மாறியை `gaphor_plugin_path` அமைப்பதன் மூலம் இந்த இருப்பிடத்தை மாற்றலாம் மற்றும் ஒரு கோப்பகத்தை சுட்டிக்காட்டலாம்.
uk: За замовчуванням для плагінів використовується каталог `$HOME/.local/gaphor/plugins-2` (`$USER/.local/gaphor/plugins-2` у Windows). Це розташування можна змінити, встановивши змінну оточення `GAPHOR_PLUGIN_PATH` і вказавши на каталог.

source: Install a plugin
fr: Installer un plugin
ta: சொருகி நிறுவவும்
uk: Встановити плагін

source: At this moment Gaphor does not have functionality bundled to install and maintain plugins. To install a plugin, use `pip` from a Python installation on your computer. On macOS and Linux, that should be easy, on Windows you may need to install Python separately from [python.org](https://python.org) or the Windows Store.
fr: Pour l'instant, Gaphor ne dispose pas de fonctionnalité intégrée pour installer et maintenir les plugins. Pour installer un plugin, utilisez `pip` depuis une installation de Python sur votre ordinateur. Sur macOS et Linux, cela devrait être facile, mais sur Windows, vous devrez peut-être installer Python séparément depuis le site python.org ou le Windows Store.
ta: இந்த நேரத்தில் செருகுநிரல்களை நிறுவவும் பராமரிக்கவும் காஃபருக்கு தொகுக்கப்பட்ட செயல்பாடு இல்லை. ஒரு சொருகி நிறுவ, உங்கள் கணினியில் பைதான் நிறுவலில் இருந்து `பிப்` ஐப் பயன்படுத்தவும். மேகோச் மற்றும் லினக்சில், அது எளிதாக இருக்க வேண்டும், சாளரங்களில் நீங்கள் [python.org] (https://python.org) அல்லது சாளரங்கள் ச்டோரிலிருந்து தனித்தனியாக பைத்தானை நிறுவ வேண்டியிருக்கும்.
uk: На даний момент Gaphor не має вбудованої функціональності для встановлення та підтримки плагінів. Щоб встановити плагін, використовуйте `pip` з інсталяції Python на вашому комп'ютері. На macOS і Linux це має бути легко, на Windows вам може знадобитися встановити Python окремо з [python.org](https://python.org) або з Windows Store.

source: Since plugins are installed with your system Python version, it's important that plugins are pure Python and do not contain compiled C code.
fr: Comme les plugins sont installés avec la version Python de votre système, il est important qu'ils soient purement Python et ne contiennent pas de code C compilé.
ta: உங்கள் கணினி பைதான் பதிப்பில் செருகுநிரல்கள் நிறுவப்பட்டிருப்பதால், செருகுநிரல்கள் தூய பைதான் மற்றும் தொகுக்கப்பட்ட சி குறியீட்டைக் கொண்டிருக்கவில்லை என்பது முதன்மை.
uk: Оскільки плагіни встановлюються з версією Python вашої системи, важливо, щоб плагіни були чистим Python і не містили скомпільований код C.

source: If you use Gaphor installed as Flatpak, you need to grant Gaphor access to user files (`filesystem=home`), so Gaphor can find files in your `.local` folder. You can use [FlatSeal](https://flathub.org/apps/com.github.tchx84.Flatseal) to change permissions of Flatpaks.
fr: Si vous utilisez Gaphor installé en tant que Flatpak, vous devez accorder à Gaphor l'accès aux fichiers de l'utilisateur (`filesystem=home`), afin que Gaphor puisse trouver les fichiers dans votre dossier `.local`. Pour changer les permissions des Flatpaks, vous pouvez utiliser FlatSeal (https://flathub.org/apps/com.github.tchx84.Flatseal).
ta: பிளாட்பேக்காக நிறுவப்பட்ட காஃபரை நீங்கள் பயன்படுத்தினால், நீங்கள் பயனர் கோப்புகளுக்கு (`கோப்பு முறைமை = வீடு`) காஃபர் அணுகலை வழங்க வேண்டும், எனவே உங்கள்` .லோகல்` கோப்புறையில் கோப்புகளைக் காணலாம். பிளாட்பேக்குகளின் அனுமதிகளை மாற்ற நீங்கள் [flatseal] (https://flathub.org/apps/com.github.tchx84.flatseal) ஐப் பயன்படுத்தலாம்.
uk: Якщо ви використовуєте Gaphor, встановлений як Flatpak, вам потрібно надати Gaphor доступ до файлів користувача (`filesystem=home`), щоб Gaphor міг знаходити файли у вашій теці `.local`. Ви можете скористатися [FlatSeal](https://flathub.org/apps/com.github.tchx84.Flatseal) для зміни дозволів для Flatpak'ів.

source: For example: to install the [Hello World plugin](https://github.com/gaphor/gaphor_plugin_helloworld) on Linux and macOS, enter:
fr: Par exemple : pour installer le [plugin Hello World] (https://github.com/gaphor/gaphor_plugin_helloworld) sur Linux et macOS, entrez :
ta: எடுத்துக்காட்டாக: லினக்ச் மற்றும் மேகோசில் [அலோ வேர்ல்ட் சொருகி] (https://github.com/gaphor/gaphor_plugin_helloworld) ஐ நிறுவ, உள்ளிடவும்:
uk: Наприклад: щоб установити [плагін Hello World](https://github.com/gaphor/gaphor_plugin_helloworld) у Linux і macOS, введіть:

source: Then start Gaphor as you normally would. A new Hello World entry has been added to the tools menu (![Menu icon](images/open-menu-symbolic.svg) → Tools → Hello World).
fr: Ensuite, démarrez Gaphor comme vous le feriez normalement. Une nouvelle entrée Hello World a été ajoutée au menu des outils ( ![Icône de menu](images/open-menu-symbolic.svg) → Outils → Hello World).
ta: நீங்கள் பொதுவாக விரும்பியபடி கஃபரைத் தொடங்குங்கள். கருவிகள் பட்டியலில் (! [மெனு ஐகான்](images/open-menu-symbolic.svg) → கருவிகள் → அலோ வேர்ல்ட்) ஒரு புதிய அலோ உலக நுழைவு சேர்க்கப்பட்டுள்ளது.
uk: Потім запустіть Gaphor, як зазвичай. До меню інструментів додано новий пункт Hello World (![Піктограма меню](images/open-menu-symbolic.svg) → Інструменти → Hello World).

source: Create your own plugin
fr: Créez votre propre plugin
ta: உங்கள் சொந்த சொருகி உருவாக்கவும்
uk: Створіть власний плагін

source: If you want to write a plugin yourself, you can familiarize yourself with Gaphor's [design principles](design_principles), [service oriented architecture](service_oriented), and [event driven framework](framework).
fr: Si vous souhaitez écrire votre propre plugin, vous pouvez vous familiariser avec les principes de conception, l'architecture orientée services et le cadre orienté événements de Gaphor [design principles](design_principles), [service oriented architecture](service_oriented), and [event driven framework](framework).
ta: நீங்களே ஒரு சொருகி எழுத விரும்பினால், காஃபரின் [வடிவமைப்பு கோட்பாடுகள்](design_principles), [சேவை சார்ந்த கட்டமைப்பு](service_oriented) மற்றும் [நிகழ்வு இயக்கப்படும் கட்டமைப்பு](framework) ஆகியவற்றை நீங்கள் அறிந்து கொள்ளலாம்.
uk: Якщо ви хочете написати плагін самостійно, ви можете ознайомитися з [принципами проектування](design_principles), [сервісно-орієнтованою архітектурою](service_oriented) та [фреймворком, керованим подіями](framework) Gaphor.

source: Example plugin
es: Ejemplo de plugin
fr: Exemple de plugin
ta: எடுத்துக்காட்டு சொருகி
uk: Приклад плагіна

source: You can have a look at the [Hello World plugin](https://github.com/gaphor/gaphor_plugin_helloworld) available on GitHub for an example of how to create your own plugin.
fr: Vous pouvez consulter le [Hello World plugin](https://github.com/gaphor/gaphor_plugin_helloworld) disponible sur GitHub pour un exemple de création de votre propre plugin.
ta: உங்கள் சொந்த சொருகி எவ்வாறு உருவாக்குவது என்பதற்கான எடுத்துக்காட்டுக்கு கிட்அப்பில் கிடைக்கும் [அலோ வேர்ல்ட் சொருகி] (https://github.com/gaphor/gaphor_plugin_helleorld) ஐப் பார்க்கலாம்.
uk: Ви можете переглянути [плагін Hello World](https://github.com/gaphor/gaphor_plugin_helloworld), доступний на GitHub, щоб отримати приклад того, як створити власний плагін.

source: The [pyproject.toml](https://github.com/gaphor/gaphor_plugin_helloworld/blob/main/pyproject.toml) file contains a plugin:
fr: Le fichier [pyproject.toml](https://github.com/gaphor/gaphor_plugin_helloworld/blob/main/pyproject.toml) contient un plugin :
ta: [Pyproject.toml] (https://github.com/gaphor/gaphor_plugin_helloworld/blob/main/pyproject.toml) கோப்பில் ஒரு சொருகி உள்ளது:
uk: Файл [pyproject.toml](https://github.com/gaphor/gaphor_plugin_helloworld/blob/main/pyproject.toml) містить плагін:

source: This refers to the class `HelloWorldPlugin` in package/module [gaphor_plugins_helloworld](https://github.com/gaphor/gaphor_plugin_helloworld/blob/main/gaphor_helloworld_plugin/__init__.py).
fr: Ceci fait référence à la classe `HelloWorldPlugin` dans le paquet/module [gaphor_plugins_helloworld] (https://github.com/gaphor/gaphor_plugin_helloworld/blob/main/gaphor_helloworld_plugin/__init__.py).
ta: இது தொகுப்பு/தொகுதி [KAPHOR_PLUGINS_HELELEDORLD] (https://github.com/gaphor/gaphor_plugin_helledorld/blob/main/gaphor_helloorld_plugin/__it__.py) வகையை வகைப்படுத்துகிறது.
uk: Це відноситься до класу `HelloWorldPlugin` у пакеті/модулі [gaphor_plugins_helloworld](https://github.com/gaphor/gaphor_plugin_helloworld/blob/main/gaphor_helloworld_plugin/__init__.py).

source: Here is a stripped version of the hello world plugin:
es: Aquí tiene una versión reducida del plugin hello world:
fr: Voici une version dépouillée du plugin hello world :
ta: அலோ வேர்ல்ட் செருகுநிரலின் பறிக்கப்பட்ட பதிப்பு இங்கே:
uk: Ось урізана версія плагіна Hello World:

source: As stated before, a plugin should implement the `Service` interface. It also implements `ActionProvider`, saying it has some actions to be performed by the user.
es: Como se ha dicho antes, un plugin debe implementar la interfaz `Service`. También implementa `ActionProvider`, diciendo que tiene algunas acciones a realizar por el usuario.
fr: Comme indiqué précédemment, un plugin doit implémenter l'interface `Service`. Il implémente également l'interface `ActionProvider`, ce qui signifie qu'il a des actions à effectuer par l'utilisateur.
ta: முன்பு கூறியது போல, ஒரு சொருகி `சேவை` இடைமுகத்தை செயல்படுத்த வேண்டும். இது `ஆக்சன் ப்ரோவைடர்` ஐ செயல்படுத்துகிறது, இது பயனரால் செய்யப்பட வேண்டிய சில செயல்களைக் கொண்டுள்ளது என்று கூறுகிறது.
uk: Як було сказано раніше, плагін повинен реалізовувати інтерфейс `Service`. Він також реалізує `ActionProvider`, кажучи, що він має деякі дії, які повинен виконати користувач.

source: The menu entry will be part of the "Tools" extension menu. This extension point is created as a service. Other services can also be passed as dependencies. Services can get references to other services by defining them as arguments of the constructor.
es: La entrada de menú formará parte del menú de extensión "Herramientas". Este punto de extensión se crea como un servicio. También se pueden pasar otros servicios como dependencias. Los servicios pueden obtener referencias a otros servicios definiéndolos como argumentos del constructor.
fr: L'entrée de menu fera partie du menu d'extension "Outils". Ce point d'extension est créé en tant que service. D'autres services peuvent également être transmis en tant que dépendances. Les services peuvent obtenir des références à d'autres services en les définissant comme arguments du constructeur.
ta: பட்டியல் நுழைவு "கருவிகள்" நீட்டிப்பு மெனுவின் ஒரு பகுதியாக இருக்கும். இந்த நீட்டிப்பு புள்ளி ஒரு சேவையாக உருவாக்கப்பட்டது. பிற சேவைகளையும் சார்புகளாகவும் அனுப்பலாம். சேவைகள் மற்ற சேவைகளைப் பற்றிய குறிப்புகளைப் பெறலாம், அவற்றை கட்டமைப்பாளரின் வாதங்களாக வரையறுக்கிறது.
uk: Пункт меню буде частиною меню розширення "Інструменти". Цей пункт розширення створено як службу. Інші сервіси також можуть бути передані як залежності. Сервіси можуть отримувати посилання на інші сервіси, визначаючи їх як аргументи конструктора.

source: All action defined in this service are registered.
es: Se registran todas las acciones definidas en este servicio.
fr: Toutes les actions définies dans ce service sont enregistrées.
ta: இந்த சேவையில் வரையறுக்கப்பட்ட அனைத்து நடவடிக்கைகளும் பதிவு செய்யப்பட்டுள்ளன.
uk: Усі дії, визначені в цьому сервісі, реєструються.

source: Each service has a `shutdown()` method. This allows the service to perform some cleanup when it's shut down.
es: Cada servicio tiene un método `shutdown()`. Esto permite al servicio realizar alguna limpieza cuando se apaga.
fr: Chaque service a une méthode `shutdown()`. Cela permet au service d'effectuer un certain nettoyage lorsqu'il est arrêté.
ta: ஒவ்வொரு சேவையிலும் `பணிநிறுத்தம் ()` முறை உள்ளது. இது மூடப்படும் போது சில தூய்மைப்படுத்தலைச் செய்ய சேவையை அனுமதிக்கிறது.
uk: Кожна служба має метод `shutdown()`. Це дозволяє службі виконувати певне очищення, коли вона вимкнена.

source: The action that can be invoked. The action is defined and will be picked up by `add_actions()` method (see 3.)
es: La acción que puede ser invocada. La acción está definida y será recogida por el método `add_actions()` (ver 3.)
fr: L'action qui peut être invoquée. L'action est définie et sera récupérée par la méthode `add_actions()` (voir 3.)
ta: செயல்படுத்தக்கூடிய செயல். செயல் வரையறுக்கப்படுகிறது மற்றும் `கூடுதல்_ஆக்சிகள் ()` முறை மூலம் எடுக்கப்படும் (பார்க்க 3.)
uk: Дія, яку можна викликати. Дія визначена та буде підібрана методом add_actions() (див. 3.)

source: Plugin Development FAQ
fr: FAQ sur le développement de plugins
ta: சொருகி மேம்பாட்டு கேள்விகள்
uk: Поширені запитання щодо розробки плагінів

source: How do I acceess gaphor services in my plugin?
fr: Comment accéder aux services gaphor dans mon plugin ?
ta: எனது சொருகி சேவைகளை எவ்வாறு அணுகுவது?
uk: Як отримати доступ до послуг gaphor у своєму плагіні?

source: Gaphor's services can be made accessible by listing the service names in the init function of your plugin class. This also requires including Service as a base class. In the HelloWorldPlugin example, the tools_menu service is included.
fr: Les services de Gaphor peuvent être rendus accessibles en listant les noms des services dans la fonction init de votre classe de plugin. Cela nécessite également d'inclure Service en tant que classe de base. Dans l'exemple de HelloWorldPlugin, le service tools_menu est inclus.
ta: உங்கள் சொருகி வகுப்பின் INIT செயல்பாட்டில் பணி பெயர்களை பட்டியலிடுவதன் மூலம் காஃபரின் சேவைகளை அணுக முடியும். இதற்கு ஒரு அடிப்படை வகுப்பாக சேவையை உள்ளடக்கியது. எலோவோர்ல்ட்ப்ளூகின் எடுத்துக்காட்டில், கருவிகள்_மெனு பணி சேர்க்கப்பட்டுள்ளது.
uk: Сервіси Gaphor можна зробити доступними, перерахувавши імена сервісів у функції init вашого класу плагіна. Для цього також потрібно включити Service як базовий клас. У прикладі HelloWorldPlugin включено сервіс tools_menu.

source: A more complete description of this approach can be found in the [Service Oriented Architecture documentation page](service_oriented.md).
fr: Une description plus complète de cette approche est disponible sur la [page de documentation de l'architecture orientée services](service_oriented.md).
ta: இந்த அணுகுமுறையின் முழுமையான விளக்கத்தை [சேவை சார்ந்த கட்டிடக்கலை ஆவணப்படுத்தல் பக்கம்](service_oriented.md) இல் காணலாம்.
uk: Більш повний опис цього підходу можна знайти на [сторінці документації щодо сервісно-орієнтованої архітектури] (service_oriented.md).

source: Community Developed Plugins
fr: Plugins développés par la communauté
ta: சமூகம் உருவாக்கிய செருகுநிரல்கள்
uk: Плагіни, розроблені спільнотою

source: What does it do?
fr: Que fait-il ?
ta: அது என்ன செய்கிறது?
uk: Що це робить?

source: Import and export of SysML requirements and notes to Excel and Confluence. It's currently at the proof-of-concept stage of development, but does allow a requirements table to be exported, then edited and imported bringing in all the changes to the model, similarly for element notes.
fr: Il permet l'importation et l'exportation d'exigences et de notes SysML vers Excel et Confluence. Il en est actuellement au stade de la preuve de concept, mais il permet d'exporter un tableau d'exigences, puis de l'éditer et de l'importer en apportant toutes les modifications au modèle, de la même manière pour les notes sur les éléments.
ta: எக்செல் மற்றும் சங்கமத்திற்கு SysML தேவைகள் மற்றும் குறிப்புகளை இறக்குமதி செய்து ஏற்றுமதி செய்யுங்கள். இது தற்போது வளர்ச்சியின் ஆதார ஆதாரத்தில் உள்ளது, ஆனால் ஒரு தேவைகள் அட்டவணையை ஏற்றுமதி செய்ய அனுமதிக்கிறது, பின்னர் திருத்தப்பட்டு இறக்குமதி செய்யப்படுகிறது, இதேபோல் உறுப்புக் குறிப்புகளுக்கும் மாதிரியில் அனைத்து மாற்றங்களையும் கொண்டுவருகிறது.
uk: Імпорт та експорт вимог і приміток SysML до Excel та Confluence. Наразі ця функція знаходиться на стадії підтвердження концепції, але вона дозволяє експортувати таблицю вимог, потім редагувати та імпортувати її, вносячи всі зміни в модель, аналогічно до приміток до елементів.

source: Where can I get it?
fr: Où puis-je l'obtenir ?
ta: நான் அதை எங்கே பெற முடியும்?
uk: Де я можу це отримати?

source: From this [BitBucket Repo](https://bitbucket.org/resonatesystems/gaphor_tools/src/main/)
fr: De ce [BitBucket Repo] (https://bitbucket.org/resonatesystems/gaphor_tools/src/main/)
ta: இதிலிருந்து [பிட்பக்கெட் ரெப்போ] (https://bitbucket.org/resonatesystems/gaphor_tools/src/main/)
uk: З цього [BitBucket Repo](https://bitbucket.org/resonatesystems/gaphor_tools/src/main/)

source: Jupyter and Scripting
es: Jupyter y Scripting
fr: Jupyter et les scripts
ta: சூபிட்டர் மற்றும் ச்கிரிப்டிங்
uk: Юпітер і сценарії

source: One way to work with models is through the GUI. However, you may also be interested in getting more out of your models by interacting with them through Python scripts and [Jupyter notebooks](https://jupyter.org/).
es: Una forma de trabajar con los modelos es a través de la GUI. Sin embargo, también puede interesarte sacar más partido de tus modelos interactuando con ellos mediante scripts de Python y [Jupyter notebooks](https://jupyter.org/).
fr: L'une des façons de travailler avec les modèles est d'utiliser l'interface graphique. Cependant, vous pouvez également être intéressé par une meilleure exploitation de vos modèles en interagissant avec eux par le biais de scripts Python et de [carnets Jupyter] (https://jupyter.org/).
ta: மாடல்களுடன் பணிபுரிய ஒரு வழி GUI வழியாகும். இருப்பினும், பைதான் ச்கிரிப்டுகள் மற்றும் [சூபிட்டர் நோட்புக்குகள்](https://jupyter.org/) மூலம் அவர்களுடன் தொடர்புகொள்வதன் மூலம் உங்கள் மாடல்களில் இருந்து அதிகம் வெளியேறவும் நீங்கள் ஆர்வமாக இருக்கலாம்.
uk: Одним із способів роботи з моделями є використання графічного інтерфейсу. Однак ви також можете бути зацікавлені в тому, щоб отримати більше від ваших моделей, взаємодіючи з ними за допомогою скриптів Python та [блокнотів Jupyter](https://jupyter.org/).

source: You can use scripts to:
es: Puede utilizar scripts para:
fr: Vous pouvez utiliser des scripts pour :
ta: நீங்கள் இதற்கு ச்கிரிப்ட்களைப் பயன்படுத்தலாம்:
uk: Ви можете використовувати сценарії, щоб:

source: Explore the model, check for (in)valid conditions.
es: Explorar el modelo, comprobar las condiciones (no)válidas.
fr: Explorer le modèle, vérifier les conditions (in)valides.
ta: மாதிரியை ஆராய்ந்து, செல்லுபடியாகும் நிபந்தனைகளை சரிபார்க்கவும்.
uk: Вивчіть модель, перевірте наявність (не)дійсних умов.

source: Generate code, as is done for Gaphor’s data model.
es: Genere código, como se hace para el modelo de datos de Gaphor.
fr: Générer du code, comme pour le modèle de données de Gaphor.
ta: காஃபரின் தரவு மாதிரிக்காக செய்யப்படுவது போல குறியீட்டை உருவாக்குங்கள்.
uk: Згенеруйте код, як це робиться для моделі даних Gaphor.

source: Update a model from another source, like a CSV file.
es: Actualizar un modelo a partir de otra fuente, como un archivo CSV.
fr: Mettre à jour un modèle à partir d'une autre source, comme un fichier CSV.
ta: சி.எச்.வி கோப்பு போன்ற மற்றொரு மூலத்திலிருந்து ஒரு மாதிரியைப் புதுப்பிக்கவும்.
uk: Оновіть модель з іншого джерела, наприклад файлу CSV.
