Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: ``allow()``: is the connection allowed at all (during mouse movement for example).
es: ``allow()``: si la conexión está permitida (durante el movimiento del ratón, por ejemplo).

source: ``connect()``: Establish a connection between element and line. Also takes care of disconnects, if required (e.g. 1:1 relationships)
es: ``connect()``: Establece una conexión entre elemento y línea. También se encarga de las desconexiones, si es necesario (por ejemplo, relaciones 1:1)

source: ``disconnect()``: Break connection, called when dropping a handle on a point where it can not connect.
es: ``disconnect()``: Rompe la conexión, se llama cuando se suelta un manejador en un punto donde no se puede conectar.

source: Connect to an element. Note that at this point the line may be connected to some other, or the same element. The connection at model level also still exists.
es: Conectar a un elemento. Tenga en cuenta que en este punto la línea puede estar conectada a algún otro, o al mismo elemento. La conexión a nivel de modelo también sigue existiendo.

source: Copy and paste works out of the box for simple items: one diagram item with one model element (the `subject`). It leveages the `load()` and `save()` methods of the elements to ensure all relevant data is copied.
es: Copiar y pegar funciona para elementos simples: un elemento del diagrama con un elemento del modelo (el `sujeto`). Usa los métodos `load()` y `save()` de los elementos para asegurarse de que se copian todos los datos relevantes.

source: Create a copy of an element (or list of elements). The returned type should be distinct, so the `paste()` function can properly dispatch.
es: Crea una copia de un elemento (o lista de elementos). El tipo devuelto debe ser distinto, para que la función `paste()` pueda despacharse correctamente.

source: Paste previously copied data. Based on the data type created in the ``copy()`` function, try to duplicate the copied elements. Returns the newly created item or element
es: Pega los datos copiados previamente. Basándose en el tipo de datos creado en la función ``copy()``, intenta duplicar los elementos copiados. Devuelve el elemento o ítem recién creado

source: Create a copy of the Presentation element, but try to link the underlying model element. A shallow copy.
es: Crea una copia del elemento presentación, pero intenta vincular el elemento modelo subyacente. Una copia superficial.

source: Create a copy of both Presentation and model element. A deep copy.
es: Crea una copia tanto de la presentación como del elemento modelo. Una copia profunda.

source: To serialize the copied elements and deserialize them again, there are two functions available:
es: Para serializar los elementos copiados y deserializarlos de nuevo, hay dos funciones disponibles:

source: Return a serialized version of a value. If the ``value`` is an element, it's referenced.
es: Devuelve una versión serializada de un valor. Si el ``valor`` es un elemento, se hace referencia a él.

source: Deserialize a value previously serialized with ``serialize()``. The ``lookup`` function is used to resolve references to other elements.
es: Deserializa un valor previamente serializado con ``serialize()``. La función ``lookup`` se usa para resolver referencias a otros elementos.

source: The drop function creates a new presentation for an element on the diagram. For relationships, a drop only works if both connected elements are present in the same diagram.
es: La función de soltar crea una nueva presentación para un elemento en el diagrama. Para las relaciones, soltar sólo funciona si los dos elementos conectados están presentes en el mismo diagrama.

source: The big difference with dragging an element from the toolbox, is that dragging from the toolbox will actually place a new ``Presentation`` element on the diagram. ``drop`` works the other way around: it starts with a model element and creates an accompanying ``Presentation``.
es: La gran diferencia con arrastrar un elemento desde la caja de herramientas, es que arrastrar desde la caja de herramientas colocará un nuevo elemento de ``Presentación`` en el diagrama. ``drop`` funciona al revés: comienza con un elemento del modelo y crea una ``Presentación`` que lo acompaña.

source: Editor property pages
es: Páginas de propiedades del editor

source: When you double click on an item in a diagram, a popup can show up so you can easily change the name.
es: Cuando hace doble clic en un elemento de un diagrama, puede aparecer una ventana emergente para que pueda cambiar el nombre fácilmente.

source: By default this works for any named element. You can register your own inline editor function if you need to.
es: Por defecto esto funciona para cualquier elemento con nombre. Puede registrar su propia función de editor en línea si lo necesita.

source: The `Element` class acts as the root for all gaphor domain classes. `Diagram` and `Presentation` form the basis for everything you see in a diagram.
es: La clase `Element` actúa como raíz de todas las clases de dominio gaphor. Las clases `Diagram` y `Presentation` forman la base de todo lo que se ve en un diagrama.

source: The `Element` base class provides event notification and integrates with the model repository (internally known as `ElementFactory`). Bi-directional relationships are also possible, as well as derived relations.
es: La clase base `Element` proporciona notificación de eventos y se integra con el repositorio del modelo (conocido internamente como `ElementFactory`). Las relaciones bidireccionales también son posibles, así como las relaciones derivadas.

source: 1. Stereotype Applications
es: 1. Aplicaciones de estereotipo

source: The first step is to load a model. For this you’ll need an `ElementFactory`. The `ElementFactory` is responsible to creating and maintaining the model. It acts as a repository for the model while you’re working on it.
es: El primer paso es cargar un modelo. Para ello necesitarás un `ElementFactory`. El `ElementFactory` es responsable de crear y mantener el modelo. Actúa como un repositorio para el modelo mientras trabajas en él.

source: A nice example of a service in use is the ElementFactory. It is one of the core services.
es: Un buen ejemplo de un servicio en uso es ElementFactory. Es uno de los servicios centrales.

source: The UndoManager depends on the events emitted by the ElementFactory. When an important events occurs, like an element is created or destroyed, that event is emitted. We then use an event handler for ElementFactory that stores the add/remove signals in the undo system. Another example of events that are emitted are with `UML.Element`s. Those classes, or more specifically, the properties, send notifications every time their state changes.
es: El UndoManager depende de los eventos emitidos por el ElementFactory. Cuando ocurre un evento importante, como la creación o destrucción de un elemento, ese evento es emitido. Entonces usamos un manejador de eventos para el ElementFactory que almacena las señales de añadir/eliminar en el sistema de deshacer. Otro ejemplo de eventos que se emiten son los `UML.Element`s. Estas clases, o más específicamente, las propiedades, envían notificaciones cada vez que su estado cambia.

source: Gaphor uses a main entry point group called `gaphor.services`.
es: Gaphor utiliza un punto principal de entrada de grupo llamado `gaphor.services`.

source: Typically a service and UI component would like to present some actions to the user, by means of menu entries. Every service and UI component can advertise actions by implementing the `gaphor.abc.ActionProvider` interface:
es: Normalmente, un servicio y un componente de interfaz de usuario desea presentar algunas acciones al usuario mediante entradas de menú. Cada servicio y componente UI puede anunciar acciones implementando la interfaz `gaphor.abc.ActionProvider`:

source: A small example is provided by means of the Hello world plugin. Take a look at the files at [GitHub](https://github.com/gaphor/gaphor.plugins.helloworld). The example plugin needs to be updated to support versions 1.0.0 and later of Gaphor.
es: Se proporciona un pequeño ejemplo mediante el plugin Hello world. Eche un vistazo a los archivos en [GitHub](https://github.com/gaphor/gaphor.plugins.helloworld). Es necesario actualizar el plugin de ejemplo para que sea compatible con las versiones 1.0.0 y posteriores de Gaphor.

source: The [setup.py](https://github.com/gaphor/gaphor.plugins.helloworld/blob/master/setup.py) file contains an entry point:
es: El archivo [setup.py](https://github.com/gaphor/gaphor.plugins.helloworld/blob/master/setup.py) contiene un punto de entrada:

source: This refers to the class `HelloWorldPlugin` in package/module [gaphor.plugins.helloworld](https://github.com/gaphor/gaphor.plugins.helloworld/blob/master/gaphor/plugins/helloworld/__init__.py).
es: Hace referencia a la clase `HelloWorldPlugin` del paquete/módulo [gaphor.plugins.helloworld](https://github.com/gaphor/gaphor.plugins.helloworld/blob/master/gaphor/plugins/helloworld/__init__.py).

source: Here we cover the reStructured Text syntax. If you prefer markdown, we suggest you have a look at the `MyST-parser <https://myst-parser.readthedocs.io/>`_, as it `supports Sphinx directives <https://myst-parser.readthedocs.io/en/latest/syntax/syntax.html>`_.
es: Aquí cubrimos la sintaxis de reStructured Text. Si prefiere markdown, le sugerimos que eche un vistazo a `MyST-parser <https://myst-parser.readthedocs.io/>`_, ya que `soporta directivas Sphinx <https://myst-parser.readthedocs.io/en/latest/syntax/syntax.html>`_.

source: `Image properties`_ can also be applied:
es: También se pueden aplicar `propiedades de imagen`_:

source: ![Stereotype usage example](images/stereotype-usage.png)
es: ![Ejemplo de uso de estereotipos](images/stereotype-usage.png)

source: Stereotype usage example
es: Ejemplo de uso de estereotipos

source: ``generaliation[subject]``
es: ``generaliación[tema]``

source: ``node:empty``
es: ``nodo:vacío``

source: An item is at the top level of the diagram.
es: Un elemento se encuentra en el nivel superior del diagrama.

source: Color used for lines.
es: Color usado para las líneas.

source: Color for text.
es: Color del texto.

source: A single font name (e.g. ``sans``, ``serif``, ``courier``).
es: Un único nombre de tipografía (p. ej., ``sans``, ``serif``, ``courier``).

source: An absolute size (e.g. ``14``) or a size value (e.g. ``small``).
es: Un tamaño absoluto (p. ej., ``14``) o un valor de tamaño (p. ej., ``small``).

source: Either ``normal`` or ``italic``.
es: Ya sea ``normal`` o ``italic``.

source: Either ``normal`` or ``bold``.
es: Ya sea ``normal`` o ``bold``.

source: Either ``left``, ``center``, ``right``.
es: Ya sea ``left``, ``center``, ``right``.

source: Set the width for lines: ``line-width: 2``.
es: Establece el ancho de las líneas: ``line-width: 2``.

source: Working with model elements
es: Trabajar con elementos del modelo

source: To create your own expression you may want to use the Console (Tools -> Console, in the Hamburger menu). Drop us a line on [Gitter](https://gitter.im/gaphor/Lobby) and we would be happy to help you.
es: Para crear su propia expresión puede usar la Consola (Herramientas -> Consola, en el menú de hamburguesa). Escríbenos a [Gitter](https://gitter.im/gaphor/Lobby) y estaremos encantados de ayudarle.

source: Transaction support
es: Soporte de transacciones

source: Transaction support is located in module `gaphor.transaction`:
es: El soporte de transacciones se encuentra en el módulo `gaphor.transaction`:

source: Do some basic initialization, so event emission will work. Since the transaction decorator does not know about the active user session (window), it emits it's events via a global list of subscribers:
es: Hacer alguna inicialización básica, para que la emisión de eventos funcione. Dado que el decorador de transacciones no conoce la sesión de usuario activa (ventana), emite sus eventos a través de una lista global de suscriptores:

source: The Transaction class is used mainly to signal the begin and end of a transaction. This is done by the TransactionBegin, TransactionCommit and TransactionRollback events:
es: La clase Transaction se usa principalmente para señalar el comienzo y el final de una transacción. Esto se hace mediante los eventos TransactionBegin, TransactionCommit y TransactionRollback:

source: Same goes for commit and rollback events:
es: Lo mismo ocurre con los eventos de commit y rollback:

source: A Transaction is started by initiating a Transaction instance:
es: Una transacción se inicia con una instancia de transacción:

source: On success, a transaction can be committed:
es: En caso de éxito, se puede confirmar la transacción:

source: After a commit, a rollback is no longer allowed (the transaction is closed):
es: Después de una confirmación, ya no se permite revertir (la transacción se cierra):

source: Transactions may be nested:
es: Las transacciones pueden estar anidadas:

source: Transactions should be closed in the right order (subtransactions first):
es: Las transacciones deben cerrarse en el orden correcto (primero las subtransacciones):

source: The transactional decorator can be used to mark functions as transactional:
es: El decorador transaccional puede usarse para marcar funciones como transaccionales:

source: If an exception is raised from within the decorated function a rollback is performed:
es: Si se produce una excepción dentro de la función decorada, se revierte:

source: Cleanup:
es: Limpieza:

source: The recording and playback of changes in Gaphor is handled by the the Undo Manager. The Undo Manager works transactionally. A transaction must succeed or fail as a complete unit. If the transaction fails in the middle, it is rolled back. In Gaphor this is achieved by the `transaction` module, which provides a context manager `Transaction`.
es: La grabación y reproducción de cambios en Gaphor se gestiona mediante el Gestor de deshacer. El Gestor de deshacer funciona transaccionalmente. Una transacción debe tener éxito o fallar como una unidad completa. Si la transacción falla en el medio, es revertida. En Gaphor esto se consigue mediante el módulo `transaction`, que proporciona un gestor de contexto `Transaction`.

source: When transactions take place, they emit event notifications on the key transaction milestones so that other services can make use of the events. The event notifications are for the begin of the transaction, and the commit of the transaction if it is successful or the rollback of the transaction if it fails.
es: Cuando las transacciones tienen lugar, emiten notificaciones de eventos sobre los hitos clave de la transacción para que otros servicios puedan hacer uso de los eventos. Las notificaciones de eventos son para el inicio de la transacción, y la confirmación de la transacción si tiene éxito o la reversión de la transacción si falla.

source: Gaphor can be installed as with our our installer. Check out the [Gaphor download page](https://gaphor.org/download#windows) for details.
es: Gaphor se puede instalar con nuestro instalador. Consulte la [página de descarga de Gaphor](https://gaphor.org/download#windows) para más detalles.

source: We recommend using [Chocolately](https://chocolatey.org/) as a package manager in Windows.
es: Recomendamos usar [Chocolately](https://chocolatey.org/) como gestor de paquetes en Windows.

source: To install it, open PowerShell as an administrator, then execute:
es: Para instalarlo, abra PowerShell como administrador y ejecute:

source: To run local scripts in follow-on steps, also execute
es: Para ejecutar scripts locales en los pasos siguientes, ejecute también

source: This allows for local PowerShell scripts to run without signing, but still requires signing for remote scripts.
es: Esto permite que los scripts locales de PowerShell se ejecuten sin firmar, pero sigue siendo necesario firmar los scripts remotos.

source: To setup a development environment in Windows first install [Git](https://gitforwindows.org) by executing as an administrator:
es: Para configurar un entorno de desarrollo en Windows primero instale [Git](https://gitforwindows.org) ejecutándolo como administrador:

source: The development environment in the next step needs MSYS2 installed to provide some Linux command line tools in Windows.
es: El entorno de desarrollo en el siguiente paso necesita MSYS2 instalado para proporcionar algunas herramientas de línea de comandos de Linux en Windows.

source: Keep PowerShell open as administrator and install [MSYS2](http://www.msys2.org/):
es: Mantenga PowerShell abierto como administrador e instale [MSYS2](http://www.msys2.org/):

source: GTK and Python with gvsbuild
es: GTK y Python con gvsbuild

source: gvsbuild provides a Python script helps you build the GTK library stack for Windows using Visual Studio. By compiling GTK with Visual Studio, we can then use a standard Python development environment in Windows.
es: gvsbuild proporciona un script en Python que ayuda a construir la pila de librerías GTK para Windows usando Visual Studio. Al compilar GTK con Visual Studio, podemos usar un entorno de desarrollo Python estándar en Windows.

source: First we will install the gvsbuild dependencies:
es: Primero instalaremos las dependencias de gvsbuild:

source: Visual C++ build tools workload for Visual Studio 2022 Build Tools
es: Carga de trabajo de las herramientas de creación de Visual C++ para Visual Studio 2022 Build Tools

source: Install Visual Studio 2022
es: Instalar Visual Studio 2022

source: With your admin PowerShell terminal:
es: Con su terminal PowerShell de administrador:

source: Install from Chocolately with administrator PowerShell:
es: Instalar desde Chocolately con PowerShell de administrador:

source: Restart your PowerShell terminal as a normal user and check that the dot command is available:
es: Reinicie su terminal PowerShell como usuario normal y compruebe que el comando dot está disponible:

source: Install gvsbuild
es: Instalar gvsbuild

source: Build GTK
es: Construir GTK

source: In the same PowerShell terminal, execute:
es: En el mismo terminal PowerShell, ejecute:

source: Grab a coffee, the build will take a few minutes to complete.
es: Tómese un café, la construcción tardará unos minutos en completarse.
