Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: Loading and saving
fr: Chargement et enregistrement
ta: ஏற்றுதல் மற்றும் சேமித்தல்
uk: Завантаження та збереження

source: Loads value in name.
fr: Charge la valeur dans le nom.
ta: பெயரில் மதிப்பு ஏற்றுகிறது.
uk: Завантажує значення в назві.

source: Make sure that after all elements are loaded, postload() should be called.
fr: Assurez-vous que la fonction postload() est appelée après le chargement de tous les éléments.
ta: எல்லா கூறுகளும் ஏற்றப்பட்ட பிறகு, போச்ட் லோட் () என்று அழைக்கப்பட வேண்டும் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள்.
uk: Переконайтеся, що після завантаження всіх елементів слід викликати postload().

source: Fix up the odds and ends.
fr: Réparer diverses petites choses.
ta: முரண்பாடுகள் மற்றும் முனைகளை சரிசெய்யவும்.
uk: Виправляйте всі обставини.

source: This is run after all elements are loaded.
fr: Cette opération est exécutée après le chargement de tous les éléments.
ta: அனைத்து கூறுகளும் ஏற்றப்பட்ட பிறகு இது இயக்கப்படுகிறது.
uk: Це запускається після завантаження всіх елементів.

source: Save the state by calling ``save_func(name, value)``.
fr: Sauvegarder l'état en appelant ``save_func(name, value)``.
ta: ``save_func(name, value)`` என்று அழைப்பதன் மூலம் மாநிலத்தை சேமிக்கவும்.
uk: Збережіть стан, викликавши ``save_func(name, value)``.

source: OCL-style methods
fr: Méthodes de type OCL
ta: OCL- பாணி முறைகள்
uk: Методи стилю OCL

source: Returns :const:`True` if the object is an instance of ``class_``.
fr: Retourne :const:`True` si l'objet est une instance de ``class_``.
ta: வருமானம் :const:`True` பொருள் ``class_`` இன் உதாரணமாக இருந்தால்.
uk: Повертає :const:`True`, якщо об’єкт є екземпляром ``class_``.

source: Returns :const:`True` if the object is of the same type as the ``other``.
fr: Retourne :const:`True` si l'objet est du même type que ``other``.
ta: வருமானம் :const:`True` பொருள் ``other`` அதே வகையாக இருந்தால்.
uk: Повертає :const:`True`, якщо об’єкт має той самий тип, що й ``other``.

source: The ``Presentation`` class
fr: La classe ``Presentation``
ta: ``Presentation`` வகுப்பு
uk: Клас ``Презентація``

source: A special type of :obj:`Base` that can be displayed on a :obj:`Diagram`.
fr: Un type spécial de :obj:`Base` qui peut être affiché sur un :obj:`Diagram`.
ta: ஒரு சிறப்பு வகை :obj:`Base` இது ஒரு :obj:`Diagram` இல் காட்டப்படலாம்.
uk: Спеціальний тип :obj:`Base`, який можна відобразити на :obj:`Diagram`.

source: Presentation instances can only be owned by diagrams.
fr: Les instances de présentation ne peuvent appartenir qu'à des diagrammes.
ta: விளக்கக்காட்சி நிகழ்வுகள் வரைபடங்களுக்கு மட்டுமே சொந்தமாக இருக்க முடியும்.
uk: Примірниками презентації можуть володіти лише діаграми.

source: Subtypes of ``Presentation`` should implement the :obj:`gaphas.item.Item` protocol.
fr: Les sous-types de ``Presentation`` doivent implémenter le protocole :obj:`gaphas.item.Item`.
ta: ``Presentation`` இன் துணை வகைகள் :obj:`gaphas.item.Item` நெறிமுறை.
uk: Підтипи ``Presentation`` мають реалізовувати протокол :obj:`gaphas.item.Item`.

source: Mark this presentation object for update.
fr: Marquer cet objet de présentation pour mise à jour.
ta: புதுப்பிப்புக்கு இந்த விளக்கக்காட்சி பொருளைக் குறிக்கவும்.
uk: Позначити цей об’єкт презентації для оновлення.

source: Updates are orchestrated by diagrams.
fr: Les mises à jour sont orchestrées par des diagrammes.
ta: புதுப்பிப்புகள் வரைபடங்களால் திட்டமிடப்படுகின்றன.
uk: Оновлення організовано за допомогою діаграм.

source: Watch a certain path of elements starting with ``self``.
fr: Observez un certain chemin d'éléments commençant par ``self``.
ta: ``self`` உடன் தொடங்கும் உறுப்புகளின் ஒரு குறிப்பிட்ட பாதையைப் பாருங்கள்.
uk: Слідкуйте за певним шляхом елементів, починаючи з ``self``.

source: The handler is optional and will default to a simple :obj:`request_update`.
fr: Le traitement est optionnel et sera par défaut un simple :obj:`request_update`.
ta: கையாளுதல் விருப்பமானது மற்றும் இயல்புநிலை ஒரு எளிய :obj:`request_update`.
uk: Обробник є необов’язковим і за умовчанням використовуватиме простий :obj:`request_update`.

source: Watches should be set in the constructor, so they can be registered and unregistered in one shot.
fr: Les surveillants doivent être définis dans le constructeur, de sorte qu'ils puissent être enregistrés et désenregistrés en une seule opération.
ta: கட்டமைப்பாளரில் கடிகாரங்கள் அமைக்கப்பட வேண்டும், எனவே அவை ஒரு சாட்டில் பதிவு செய்யப்பட்டு பதிவு செய்யப்படாது.
uk: Годинники повинні бути встановлені в конструкторі, щоб їх можна було реєструвати і знімати одним пострілом.

source: This interface is fluent: returns ``self``.
fr: Cette interface est fluide : elle renvoie ``self``.
ta: இந்த இடைமுகம் சரளமாக உள்ளது: ``self`` தருகிறது.
uk: Цей інтерфейс вільний: повертає ``self``.

source: Change the parent and update the item's matrix so the item visually remains in the same place.
fr: Modifier le parent et mettre à jour la matrice de l'élément afin que l'élément reste visuellement au même endroit.
ta: பெற்றோரை மாற்றி, உருப்படியின் மேட்ரிக்சைப் புதுப்பிக்கவும், எனவே உருப்படி பார்வைக்கு ஒரே இடத்தில் இருக்கும்.
uk: Змініть батьківський елемент і оновіть матрицю елемента, щоб елемент візуально залишався на тому самому місці.

source: The ``Diagram`` class
fr: La classe ``Diagram``
ta: ``Diagram`` வகுப்பு
uk: Клас ``Діаграма``

source: Diagrams may contain :obj:`Presentation` elements.
fr: Les diagrammes peuvent contenir des éléments :obj:`Presentation`.
ta: வரைபடங்களில் இருக்கலாம் :obj:`Presentation` கூறுகள்.
uk: Діаграми можуть містити елементи :obj:`Presentation`.

source: If diagrams need to be owned, the modeling language (e.g. UML) should subclass ``Diagram`` and add ownership relationships and rules.
fr: Si les diagrammes doivent être propriétaires, le langage de modélisation (par exemple UML) doit subdiviser ``Diagram`` et ajouter des relations et des règles de propriété.
ta: வரைபடங்கள் சொந்தமாக இருக்க வேண்டும் என்றால், மாடலிங் மொழி (எ.கா. யுஎம்எல்) ``Diagram`` துணைப்பிரிவு செய்து உரிமையாளர் உறவுகள் மற்றும் விதிகளைச் சேர்க்க வேண்டும்.
uk: Якщо потрібно володіти діаграмами, мова моделювання (наприклад, UML) має створити підклас «Діаграма» та додати відносини власності та правила.

source: Create a new diagram item on the diagram.
fr: Créez un nouvel élément de diagramme sur le diagramme.
ta: வரைபடத்தில் புதிய வரைபட உருப்படியை உருவாக்கவும்.
uk: Створіть новий елемент діаграми на діаграмі.

source: It is created with a unique ID, and it is attached to the diagram's root item. The type parameter is the element class to create. The new element also has an optional parent and subject.
fr: Il est créé avec un identifiant unique et est attaché à l'élément racine du diagramme. item. Le paramètre de type est la classe d'élément à créer. Le nouvel élément peut également avoir un parent et un sujet facultatifs.
ta: இது ஒரு தனித்துவமான ஐடியுடன் உருவாக்கப்பட்டது, மேலும் இது வரைபடத்தின் ரூட் உருப்படியுடன் இணைக்கப்பட்டுள்ளது. வகை அளவுரு உருவாக்க வேண்டிய உறுப்பு வகுப்பு. புதிய உறுப்பு ஒரு விருப்ப பெற்றோர் மற்றும் பொருள் ஆகியவற்றைக் கொண்டுள்ளது.
uk: Він створюється з унікальним ідентифікатором і додається до кореневого елемента діаграми. Параметр типу - це клас елемента, який потрібно створити. Новий елемент також має необов’язковий батьківський елемент і тему.

source: Find a presentation item by id.
fr: Recherche d'un élément de présentation par son identifiant.
ta: ஐடி மூலம் விளக்கக்காட்சி உருப்படியைக் கண்டறியவும்.
uk: Знайдіть елемент презентації за ідентифікатором.

source: Returns a presentation in this diagram or return ``None``.
fr: Retourne une présentation dans ce diagramme ou retourne ``None``.
ta: இந்த வரைபடத்தில் ஒரு விளக்கக்காட்சியை வழங்குகிறது அல்லது ``None`` திரும்புகிறது.
uk: Повертає презентацію на цій діаграмі або повертає ``Немає``.

source: Return an iterator of all canvas items that match expression.
fr: Renvoie un itérateur de tous les éléments de la toile qui correspondent à l'expression.
ta: வெளிப்பாட்டுடன் பொருந்தக்கூடிய அனைத்து கேன்வாச் உருப்படிகளின் மறுசீரமைப்பாளரைத் தரவும்.
uk: Повертає ітератор усіх елементів полотна, які відповідають виразу.

source: Schedule an item for updating.
fr: Planifier la mise à jour d'un élément.
ta: புதுப்பிக்க ஒரு உருப்படியை திட்டமிடுங்கள்.
uk: Заплануйте оновлення елемента.

source: No update is done at this point, it's only added to the set of to-be updated items.
fr: Aucune mise à jour n'est effectuée à ce stade, l'élément est seulement ajouté à l'ensemble des éléments à mettre à jour.
ta: இந்த கட்டத்தில் எந்த புதுப்பிப்பும் செய்யப்படவில்லை, இது புதுப்பிக்கப்பட்ட உருப்படிகளின் தொகுப்பில் மட்டுமே சேர்க்கப்பட்டுள்ளது.
uk: На цьому етапі оновлення не виконується, воно лише додається до набору елементів, які потрібно оновити.

source: This method is part of the :obj:`gaphas.model.Model` protocol.
fr: Cette méthode fait partie du protocole :obj:`gaphas.model.Model`.
ta: இந்த முறை :obj:`gaphas.model.Model` நெறிமுறையின் ஒரு பகுதியாகும்.
uk: Цей метод є частиною протоколу :obj:`gaphas.model.Model`.

source: Update the diagram.
fr: Mettre à jour le diagramme.
ta: வரைபடத்தைப் புதுப்பிக்கவும்.
uk: Оновіть діаграму.

source: All items that requested an update via :meth:`request_update` are now updates. If an item has an ``update(context: UpdateContext)`` method, it's invoked. Constraints are solved.
fr: Tous les éléments ayant demandé une mise à jour via :meth:`request_update` sont désormais considérés comme des mises à jour. Si un élément possède une méthode ``update(context: UpdateContext)``, elle est invoquée. Les contraintes sont résolues.
ta: புதுப்பிப்பைக் கோரிய அனைத்து உருப்படிகளும் :meth:`request_update` இப்போது புதுப்பிப்புகள். ஒரு உருப்படிக்கு ``update(context: UpdateContext)`` முறை இருந்தால், அது செயல்படுத்தப்படுகிறது. தடைகள் தீர்க்கப்படுகின்றன.
uk: Усі елементи, які запитували оновлення через :meth:`request_update`, тепер є оновленнями. Якщо елемент має метод ``update(context: UpdateContext)``, він викликається. Обмеження вирішено.

source: Protocols
fr: Protocoles
ta: நெறிமுறைகள்
uk: Протоколи

source: Create a new element in the repository.
fr: Créer un nouvel élément dans le référentiel.
ta: களஞ்சியத்தில் ஒரு புதிய உறுப்பை உருவாக்கவும்.
uk: Створіть новий елемент у сховищі.

source: Select elements from the repository that fulfill ``expression``.
fr: Sélectionner dans le dépôt les éléments qui répondent à l'``expression``.
ta: ``expression`` நிறைவேற்றும் களஞ்சியத்திலிருந்து கூறுகளைத் தேர்ந்தெடுக்கவும்.
uk: Виберіть елементи зі сховища, які відповідають ``виразу``.

source: Select all elements from the repository of type ``type_``.
fr: Sélectionner tous les éléments du dépôt de type ``type_``.
ta: ``type_`` வகையின் களஞ்சியத்திலிருந்து அனைத்து கூறுகளையும் தேர்ந்தெடுக்கவும்.
uk: Виберіть усі елементи зі сховища типу ``type_``.

source: Select all elements from the repository.
fr: Sélectionner tous les éléments du dépôt.
ta: களஞ்சியத்திலிருந்து அனைத்து கூறுகளையும் தேர்ந்தெடுக்கவும்.
uk: Виберіть усі елементи зі сховища.

source: Get an element by id from the repository.
fr: Récupérer un élément par son identifiant dans le dépôt.
ta: களஞ்சியத்திலிருந்து ஐடி மூலம் ஒரு உறுப்பைப் பெறுங்கள்.
uk: Отримати елемент за id зі сховища.

source: Returns :const:`None` if no such element exists.
fr: Renvoie :const:`None` si aucun élément de ce type n'existe.
ta: வருமானம் :const:`None` அத்தகைய உறுப்பு இல்லை என்றால்.
uk: Повертає :const:`None`, якщо такого елемента не існує.

source: Add a watch for a specific path. The path is relative to the element that created the watcher object.
fr: Ajouter une veille pour un chemin spécifique. Le chemin est relatif à l'élément qui a créé l'objet de surveillance.
ta: ஒரு குறிப்பிட்ட பாதைக்கு ஒரு கடிகாரத்தைச் சேர்க்கவும். பாதை வாட்சர் பொருளை உருவாக்கிய உறுப்புடன் தொடர்புடையது.
uk: Додайте годинник для певного шляху. Шлях є відносно елемента, який створив об’єкт спостереження.

source: Returns ``self``, so watch operations can be chained.
fr: Renvoie ``self``, afin que les opérations de surveillance puissent être enchaînées.
ta: ``self`` வருமானம், எனவே கண்காணிப்பு செயல்பாடுகளை சங்கிலியால் பிணைக்க முடியும்.
uk: Повертає ``self``, тому операції спостереження можуть бути зв’язані.

source: Should be called before the watcher is disposed, to release all watched paths.
fr: Doit être appelé avant que l'observateur ne soit éliminé, pour libérer tous les chemins observés.
ta: பார்க்கும் அனைத்து பாதைகளையும் விடுவிக்க, பார்வையாளர் அகற்றப்படுவதற்கு முன்பு அழைக்கப்பட வேண்டும்.
uk: Його слід викликати перед видаленням спостерігача, щоб звільнити всі спостережувані шляхи.

source: Change Sets
fr: Modifier les ensembles
ta: தொகுப்புகளை மாற்றவும்
uk: Зміна наборів

source: The core model has support for change sets, which are sets of pending changes. Normally you end up with a change set when you [resolve a merge conflict](../merge_conflicts) in your model.
fr: Le modèle de base prend en charge les ensembles de modifications, qui sont des ensembles de modifications en attente. Normalement, vous vous retrouvez avec un ensemble de modifications lorsque vous [résolvez un conflit de fusion](../merge_conflicts) dans votre modèle.
ta: கோர் மாடலில் மாற்றத் தொகுப்புகளுக்கு உதவி உள்ளது, அவை நிலுவையில் உள்ள மாற்றங்களின் தொகுப்புகள். உங்கள் மாதிரியில் நீங்கள் [ஒன்றிணைக்கும் மோதலைத் தீர்க்க](../merge_conflicts) ஒரு மாற்றத் தொகுப்போடு பொதுவாக முடிவடையும்.
uk: Основна модель підтримує набори змін, які є наборами змін, що очікують на розгляд. Зазвичай ви отримуєте набір змін, коли [вирішуєте конфлікт злиття](../merge_conflicts) у своїй моделі.

source: Core Services
fr: Services de base
ta: முக்கிய சேவைகள்
uk: Основні послуги

source: here you can find the API for services that are related to model creation and model manipulation.
fr: vous trouverez ici l'API pour les services liés à la création et à la manipulation de modèles.
ta: மாதிரி உருவாக்கம் மற்றும் மாதிரி கையாளுதல் தொடர்பான சேவைகளுக்கான பநிஇ ஐ இங்கே காணலாம்.
uk: тут ви можете знайти API для служб, пов’язаних із створенням і маніпулюванням моделлю.

source: Element Repository (/Factory)
fr: Répertoire d'éléments (/Factory)
ta: உறுப்பு களஞ்சியம் (/தொழிற்சாலை)
uk: Репозиторій елементів (/Factory)

source: The ``ElementFactory`` is used as a central repository for a model.
fr: La ``ElementFactory`` est utilisée comme un dépôt central pour un modèle.
ta: ``ElementFactory`` ஒரு மாதிரிக்கான மைய களஞ்சியமாக பயன்படுத்தப்படுகிறது.
uk: ``ElementFactory`` використовується як центральне сховище для моделі.

source: New model elements should be created by :obj:`~gaphor.core.modeling.ElementFactory.create`.
fr: Les nouveaux éléments de modèle doivent être créés par :obj:`~gaphor.core.modeling.ElementFactory.create`.
ta: புதிய மாதிரி கூறுகளை உருவாக்க வேண்டும் :obj:`~gaphor.core.modeling.ElementFactory.create`.
uk: Нові елементи моделі повинні бути створені за допомогою :obj:`~gaphor.core.modeling.ElementFactory.create`.

source: Methods like :obj:`~gaphor.core.modeling.ElementFactory.select` can be used to find elements in the model.
fr: Des méthodes comme :obj:`~gaphor.core.modeling.ElementFactory.select` peuvent être utilisées pour trouver des éléments dans le modèle.
ta: போன்ற முறைகள் :obj:`~gaphor.core.modeling.ElementFactory.select` மாதிரியில் கூறுகளைக் கண்டறிய பயன்படுத்தலாம்.
uk: Для пошуку елементів у моделі можна використовувати такі методи, як :obj:`~gaphor.core.modeling.ElementFactory.select`.

source: Iterate elements that comply with expression.
fr: Interroger les éléments conformes à l'expression.
ta: வெளிப்பாட்டிற்கு இணங்க கூறும் கூறுகள்.
uk: Ітерація елементів, які відповідають виразу.

source: Expressions can be:
fr: Les expressions peuvent être :
ta: வெளிப்பாடுகள் இருக்கக்கூடும்:
uk: Вирази можуть бути:

source: :obj:`None`: return all elements.
fr: :obj:`None`: renvoie tous les éléments.
ta: :obj:`None`: எல்லா கூறுகளையும் திருப்பி விடுங்கள்.
uk: :obj:`None`: повертає всі елементи.

source: A type: return all elements of that type, or subtypes.
fr: Un type : renvoie tous les éléments de ce type ou de ses sous-types.
ta: ஒரு வகை: அந்த வகை அனைத்து கூறுகளையும் அல்லது துணை வகைகளைத் தரவும்.
uk: Тип: повертає всі елементи цього типу або підтипів.

source: An expression.
fr: Une expression.
ta: ஒரு வெளிப்பாடு.
uk: Вираз.

source: Like :obj:`~gaphor.core.modeling.ElementFactory.select`, but return a list, instead of an iterator.
fr: Comme :obj:`~gaphor.core.modeling.ElementFactory.select`, mais renvoie une liste au lieu d'un itérateur.
ta: போன்றவை :obj:`~gaphor.core.modeling.ElementFactory.select`, ஆனால் ஒரு மறுசீரமைப்பிற்கு பதிலாக ஒரு பட்டியலைத் திருப்பி விடுங்கள்.
uk: Як :obj:`~gaphor.core.modeling.ElementFactory.select`, але повертає список замість ітератора.

source: Find element with a specific id.
fr: Recherche d'un élément avec un identifiant spécifique.
ta: ஒரு குறிப்பிட்ட ஐடியுடன் உறுப்பைக் கண்டறியவும்.
uk: Знайти елемент із певним ідентифікатором.

source: Iterate all id's in the factory.
fr: Itère tous les identifiants de la structure.
ta: தொழிற்சாலையில் உள்ள அனைத்து ஐடியையும் மீண்டும் செய்யுங்கள்.
uk: Повторити всі ідентифікатори на заводі.

source: Iterate all elements in the factory.
fr: Interroger tous les éléments de la structure.
ta: தொழிற்சாலையில் உள்ள அனைத்து கூறுகளையும் மீண்டும் கூறினார்.
uk: Повторити всі елементи на заводі.

source: Return the amount of elements currently in the factory.
fr: Renvoie la quantité d'éléments actuellement présents dans la structure.
ta: தற்போது தொழிற்சாலையில் உள்ள உறுப்புகளின் அளவைத் தரவும்.
uk: Повернути кількість елементів на заводі.

source: Returns ``True`` if the factory holds no elements.
fr: Retourne ``True`` si la structure ne contient aucun élément.
ta: தொழிற்சாலை எந்த கூறுகளையும் வைத்திருந்தால் ``True`` திரும்பும்.
uk: Повертає ``True``, якщо фабрика не містить елементів.

source: Create a new model element of type ``type``.
fr: Créer un nouvel élément de modèle de type ``type``.
ta: ``type`` வகையின் புதிய மாதிரி உறுப்பை உருவாக்கவும்.
uk: Створіть новий елемент моделі типу ``type``.

source: This method will only create model elements, not :obj:`~gaphor.core.modeling.Presentation` elements: those are created by :obj:`~gaphor.core.modeling.Diagram`.
fr: Cette méthode ne crée que des éléments de modèle, et non des éléments :obj:`~gaphor.core.modeling.Presentation` : ceux-ci sont créés par :obj:`~gaphor.core.modeling.Diagram`.
ta: இந்த முறை மாதிரி கூறுகளை மட்டுமே உருவாக்கும், இல்லை :obj:`~gaphor.core.modeling.Presentation` கூறுகள்: அவை உருவாக்கப்பட்டவை :obj:`~gaphor.core.modeling.Diagram`.
uk: Цей метод створюватиме лише елементи моделі, а не елементи :obj:`~gaphor.core.modeling.Presentation`: їх створює :obj:`~gaphor.core.modeling.Diagram`.

source: Flush all elements (remove them from the factory).
fr: Purger tous les éléments (les retirer de la structure).
ta: எல்லா கூறுகளையும் பறிக்கவும் (தொழிற்சாலையிலிருந்து அவற்றை அகற்றவும்).
uk: Промити всі елементи (вилучити їх із заводу).

source: Diagram elements are flushed first. The remaining elements are flushed next.
fr: Les éléments du diagramme sont purgés en premier. Puis les autres éléments sont nettoyés par la suite.
ta: வரைபட கூறுகள் முதலில் சுத்தப்படுத்தப்படுகின்றன. மீதமுள்ள கூறுகள் அடுத்ததாக சுத்தப்படுத்தப்படுகின்றன.
uk: Спочатку очищаються елементи діаграми. Далі промиваються інші елементи.

source: Modeling Language
fr: Langue de Modélisation
ta: மாதிரியமைத்தல் மொழி
uk: Мова Моделювання

source: Information on how modeling languages are managed can be found :doc:`../modeling_language`.
fr: Des informations sur la gestion des langages de modélisation sont disponibles :doc:`../modeling_language`.
ta: மாடலிங் மொழிகள் எவ்வாறு நிர்வகிக்கப்படுகின்றன என்பது பற்றிய தகவல்களைக் காணலாம் :doc:`../modeling_language`.
uk: Інформацію про те, як керуються мовами моделювання, можна знайти :doc:`../modeling_language`.

source: Event Manager
fr: Gestionnaire d'événements
ta: நிகழ்வு மேலாளர்
uk: Менеджер заходів

source: The :doc:`../event_system` takes care of dispatches events throughout Gaphor.
fr: Le :doc:`../event_system` s'occupe de distribuer les événements à travers Gaphor.
ta: தி :doc:`../event_system` காஃபர் முழுவதும் அனுப்பும் நிகழ்வுகளை கவனித்துக்கொள்கிறது.
uk: :doc:`../event_system` піклується про надсилання подій у Gaphor.

source: Packages
es: Paquetes
fr: Paquets
ta: தொகுப்புகள்
uk: Пакети

source: Risk Analysis and Assessment Modeling Language
es: Lenguaje de modelización de análisis y evaluación de riesgos
fr: Langage de modélisation pour l'analyse et l'évaluation des risques
ta: இடர் பகுப்பாய்வு மற்றும் மதிப்பீட்டு மாடலிங் மொழி
uk: Мова моделювання аналізу та оцінки ризиків

source: Gaphor implements parts of the [RAAML 1.0 specification](https://www.omg.org/spec/RAAML).
es: Gaphor implementa partes de la [especificación RAAML 1.0](https://www.omg.org/spec/RAAML).
fr: Gaphor met en œuvre certaines parties de la [spécification RAAML 1.0] (https://www.omg.org/spec/RAAML).
ta: [RAAML 1.0 விவரக்குறிப்பு](https://www.omg.org/spec/RAAML) இன் பகுதிகளை கஃபர் செயல்படுத்துகிறது.
uk: Gaphor реалізує частини [специфікації RAML 1.0] (https://www.omg.org/spec/RAAML).

source: Core
fr: Le noyau
ta: வயிரம்
uk: Ядро

source: Core Library/Any Situation
es: Biblioteca central/Cualquier situación
fr: Bibliothèque centrale/toutes les situations
ta: மைய நூலகம்/எந்த சூழ்நிலையும்
uk: Основна бібліотека/будь-яка ситуація

source: Core Profile/Controlling Measure
es: Perfil básico/Medida de control
fr: Profil de base/Mesure de contrôle
ta: மைய சுயவிவரம்/கட்டுப்பாட்டு நடவடிக்கை
uk: Основний профіль/контролююча міра

source: Core Profile/Relevant To
es: Perfil básico/Relevante para
fr: Profil de base/pertinent pour
ta: முக்கிய சுயவிவரம்/தொடர்புடையது
uk: Основний профіль/релевантність

source: Core Profile/Situation
es: Perfil básico/Situación
fr: Profil de base/Situation
ta: முக்கிய சுயவிவரம்/நிலைமை
uk: Основний профіль/ситуація

source: Core Profile/Violates
es: Perfil básico/Viola
fr: Profil de base/Violation
ta: மைய சுயவிவரம்/மீறல்கள்
uk: Основний профіль/Порушення

source: General
fr: Général
ta: பொது
uk: Загальний

source: Basic Event
es: Evento básico
fr: Évènement basique
ta: அடிப்படை நிகழ்வு
uk: Основна подія

source: General Concepts Library/Abstract Cause
es: Biblioteca de conceptos generales/Causa abstracta
fr: Bibliothèque de Concepts Généraux/Cause abstraite
ta: பொதுவான கருத்துக்கள் நூலகம்/சுருக்க காரணம்
uk: Бібліотека загальних понять/реферат Причина

source: General Concepts Library/Abstract Effect
es: Biblioteca de Conceptos generales/Efecto Abstracto
fr: Bibliothèque de Concepts Généraux /Effet Abstrait
ta: பொதுவான கருத்துக்கள் நூலகம்/சுருக்க விளைவு
uk: Бібліотека загальних понять/абстрактний ефект

source: General Concepts Library/Abstract Event
es: Biblioteca de Conceptos generales/Efecto Abstracto
fr: Bibliothèque de Concepts Généraux/Événement abstrait
ta: பொது கருத்துக்கள் நூலகம்/சுருக்க நிகழ்வு
uk: Бібліотека загальних понять/реферат

source: General Concepts Library/Abstract Failure Mode
es: Biblioteca de conceptos generales/Modo de error abstracto
fr: Bibliothèque Concepts Généraux/Mode de défaillance Abstrait
ta: பொதுவான கருத்துக்கள் நூலகம்/சுருக்க தோல்வி முறை
uk: Бібліотека загальних понять/режим абстрактних помилок

source: General Concepts Library/Abstract Risk
es: Biblioteca de Conceptos generales/Riesgo Abstracto
fr: Bibliothèque de Concepts Généraux /Risque Abstrait
ta: பொதுவான கருத்துக்கள் நூலகம்/சுருக்க இடர்
uk: Бібліотека загальних понять/реферат Ризик

source: General Concepts Library/Activation
es: Biblioteca de conceptos generales/activación
fr: Bibliothèque de Concepts Généraux/Activation
ta: பொதுவான கருத்துக்கள் நூலகம்/செயல்படுத்தல்
uk: Бібліотека загальних понять/Активація

source: General Concepts Library/Cause
es: Biblioteca de conceptos generales/causa
fr: Bibliothèque de Concepts Généraux/Cause
ta: பொதுவான கருத்துக்கள் நூலகம்/காரணம்
uk: Бібліотека загальних понять/Cause
