Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: With all elements in the model, we can create a diagram. Let's drop the components and dependencies on the diagram and let auto-layout do its magic.
es: Con todos los elementos en el modelo, podemos crear un diagrama. Vamos a soltar los componentes y las dependencias en el diagrama y dejar que el diseño automático haga su magia.
fr: Avec tous les éléments du modèle, nous pouvons créer un diagramme. Déposons les composants et les dépendances sur le diagramme et laissons la mise en page automatique faire sa magie.
ta: மாதிரியில் உள்ள அனைத்து கூறுகளையும் கொண்டு, நாம் ஒரு வரைபடத்தை உருவாக்கலாம். வரைபடத்தின் கூறுகள் மற்றும் சார்புகளை கைவிட்டு, தானாகவே லேஅவுட் அதன் மந்திரத்தை செய்யட்டும்.
uk: З усіма елементами моделі ми можемо створити діаграму. Давайте відкинемо компоненти та залежності на діаграмі та дозволимо автоматичному компонуванню зробити свою магію.

source: To make the dependency look good, we have to add a style sheet. If you create a new diagram via the GUI, this element is automatically added.
es: Para que la dependencia se vea bien, tenemos que añadir una hoja de estilo. Si crea un diagrama nuevo a través de la interfaz gráfica de usuario, este elemento se añade automáticamente.
fr: Pour que la dépendance ait une bonne apparence, nous devons ajouter une feuille de style. Si vous créez un nouveau diagramme via l'interface graphique, cet élément est automatiquement ajouté.
ta: சார்புநிலையை அழகாக மாற்ற, நாம் ஒரு பாணி தாளைச் சேர்க்க வேண்டும். GUI வழியாக நீங்கள் ஒரு புதிய வரைபடத்தை உருவாக்கினால், இந்த உறுப்பு தானாகவே சேர்க்கப்படும்.
uk: Щоб залежність виглядала добре, нам потрібно додати таблицю стилів. Якщо ви створюєте нову діаграму через GUI, цей елемент додається автоматично.

source: Last step is to layout and draw the diagram.
es: El último paso consiste en maquetar y dibujar el diagrama.
fr: La dernière étape consiste à mettre en page et à dessiner le diagramme.
ta: கடைசி கட்டம் தளவமைப்பு மற்றும் வரைபடத்தை வரைய வேண்டும்.
uk: Останнім кроком є макет і малювання діаграми.

source: That's all. As you can see from the diagram, a lot of services rely on `EventManager`.
es: Eso es todo. Como puede ver en el diagrama, muchos servicios dependen de `EventManager`.
fr: C'est tout. Comme vous pouvez le voir sur le diagramme, beaucoup de services s'appuient sur `EventManager`.
ta: அவ்வளவுதான். வரைபடத்திலிருந்து நீங்கள் பார்க்க முடியும் என, நிறைய சேவைகள் `Eventanagager` ஐ நம்பியுள்ளன.
uk: Ось і все. Як ви можете бачити на діаграмі, багато служб покладаються на `EventManager`.

source: Get Started with Gaphor
es: Primeros pasos con Gaphor
fr: Démarrer avec Gaphor
ta: கஃபருடன் தொடங்கவும்
uk: Почніть роботу з Gaphor

source: Gaphor is more than a diagram editor: it's a modeling environment. Where simple diagram editors such as Microsoft Visio and [draw.io](https://draw.io) allow you to create pictures, Gaphor actually keeps track of the elements you add to the model. In Gaphor you can create diagrams to track and visualize different aspects of the system you're developing.
es: Gaphor es más que un editor de diagramas: es un entorno de modelado. Mientras que los editores de diagramas sencillos como Microsoft Visio y [draw.io](https://draw.io) permiten crear imágenes, Gaphor realiza un seguimiento de los elementos que se añaden al modelo. En Gaphor puede crear diagramas para seguir y visualizar diferentes aspectos del sistema que está desarrollando.
fr: Gaphor est plus qu'un éditeur de diagrammes : c'est un environnement de modélisation. Alors que les éditeurs de diagrammes simples tels que Microsoft Visio et [draw.io] (https://draw.io) vous permettent de créer des images, Gaphor garde en fait la trace des éléments que vous ajoutez au modèle. Dans Gaphor, vous pouvez créer des diagrammes pour suivre et visualiser les différents aspects du système que vous développez.
ta: காஃபர் ஒரு வரைபட எடிட்டரை விட அதிகம்: இது ஒரு மாடலிங் சூழல். நுண்மென் விசியோ மற்றும் [டிரா.யோ](https://draw.io) போன்ற எளிய வரைபட ஆசிரியர்கள் படங்களை உருவாக்க உங்களை அனுமதிக்கும் இடத்தில், நீங்கள் மாதிரியில் சேர்க்கும் கூறுகளை கேஃபர் உண்மையில் கண்காணிக்கிறது. நீங்கள் உருவாக்கும் அமைப்பின் வெவ்வேறு அம்சங்களைக் கண்காணிக்கவும் காட்சிப்படுத்தவும் வரைபடங்களை உருவாக்கலாம்.
uk: Gaphor - це більше, ніж редактор діаграм: це середовище для моделювання. Якщо прості редактори діаграм, такі як Microsoft Visio та [draw.io] (https://draw.io), дозволяють створювати малюнки, то Gaphor фактично відстежує елементи, які ви додаєте до моделі. У Gaphor ви можете створювати діаграми для відстеження та візуалізації різних аспектів системи, яку ви розробляєте.

source: Enough talk, let's get started.
es: Dejémonos de cháchara, empecemos.
fr: Assez parlé, commençons.
ta: போதுமான பேச்சு, தொடங்குவோம்.
uk: Досить говорити, почнемо.

source: You can find installers for Gaphor on the [Gaphor Website](https://gaphor.org/download). Gaphor can be installed on Linux (Flatpak), Windows, and macOS.
fr: Vous pouvez trouver des installateurs pour Gaphor sur le site Web de [Gaphor Website](https://gaphor.org/download). Gaphor peut être installé sur Linux (Flatpak), Windows et macOS.
ta: [Kaphor வலைத்தளம்](https://gaphor.org/ta/download) இல் Kaphor க்கான நிறுவிகளை நீங்கள் காணலாம். லினக்ச் (பிளாட்பாக்), சாளரங்கள் மற்றும் மேகோச் ஆகியவற்றில் கஃபர் நிறுவப்படலாம்.
uk: Ви можете знайти інсталятори для Gaphor на [веб-сайті Gaphor](https://gaphor.org/download). Gaphor можна встановити на Linux (Flatpak), Windows і macOS.

source: Once Gaphor is launched, it provides you a welcome screen. It shows you previously opened models and model templates.
es: Una vez que se inicia Gaphor, aparece una pantalla de bienvenida. En ella se muestran los modelos y plantillas de modelos abiertos anteriormente.
fr: Une fois lancé, Gaphor vous propose un écran de bienvenue. Il vous montre les modèles précédemment ouverts et les modèles de modèles.
ta: காஃபர் தொடங்கப்பட்டதும், அது உங்களுக்கு வரவேற்கத்தக்க திரையை வழங்குகிறது. இது முன்னர் திறந்த மாதிரிகள் மற்றும் மாதிரி வார்ப்புருக்கள் ஆகியவற்றைக் காட்டுகிறது.
uk: Після запуску Gaphor ви побачите екран привітання. Він показує раніше відкриті моделі та шаблони моделей.

source: ![Gaphor's welcome screen showing recently opened models and model templates.](images/getting-started-greeter.png)
fr: ![Écran d'accueil de Gaphor montrant les modèles récemment ouverts et les modèles de modèles](images/getting-started-greeter.png)
ta: ! [சமீபத்தில் திறந்த மாதிரிகள் மற்றும் மாதிரி வார்ப்புருக்களைக் காட்டும் கஃபரின் வரவேற்பு திரை.](images/getting-started-greeter.png)
uk: ![Екран привітання Gaphor показує нещодавно відкриті моделі та шаблони моделей.](images/getting-started-greeter.png)

source: Gaphor's welcome screen showing recently opened models and model templates.
fr: Écran d'accueil de Gaphor montrant les modèles et les modèles de modèles récemment ouverts.
ta: அண்மைக் காலத்தில் திறந்த மாதிரிகள் மற்றும் மாதிரி வார்ப்புருக்களைக் காட்டும் கஃபரின் வரவேற்பு திரை.
uk: Екран привітання Gaphor показує нещодавно відкриті моделі та шаблони моделей.

source: You can select a template to get started.
es: Puede seleccionar una plantilla para empezar.
fr: Vous pouvez sélectionner un modèle pour commencer.
ta: தொடங்க ஒரு வார்ப்புருவைத் தேர்ந்தெடுக்கலாம்.
uk: Ви можете вибрати шаблон, щоб почати.

source: **Generic:** a blank model to start with
es: **Genérico:** un modelo en blanco para empezar
fr: **Generic : (Générique :)** un modèle vierge pour commencer
ta: ** பொதுவான: ** தொடங்குவதற்கு ஒரு வெற்று மாதிரி
uk: **Загальний:** порожня модель для початку

source: **UML:** A template for the *Unified Modeling Language* for modeling a software system
es: **UML:** Una plantilla del *Lenguaje Unificado de Modelado* para modelar un sistema de software
fr: **UML:** Un modèle pour le *Unified Modeling Language* (langage de modélisation unifié) pour la modélisation d'un système logiciel
ta: ** யுஎம்எல்: ** ஒரு மென்பொருள் அமைப்பை மாடலிங் செய்வதற்கான*ஒருங்கிணைந்த மாடலிங் மொழிக்கான வார்ப்புரு*
uk: **UML:** Шаблон для *Уніфікованої мови моделювання* для моделювання програмної системи

source: **SysML:** A template for the *Systems Modeling Language* for modeling a wide range of systems and systems-of-systems
es: **SysML:** Una plantilla del *Lenguaje de Modelado de Sistemas* para modelar una amplia gama de sistemas y sistemas de sistemas
fr: **SysML:** Un modèle pour le *Systems Modeling Language* pour la modélisation d'une large gamme de systèmes et de systèmes de systèmes
ta: **SysML:** சிச்டம்ச் மாடலிங் மொழிக்கான ஒரு வார்ப்புரு*பரந்த அளவிலான அமைப்புகள் மற்றும் அமைப்புகளின் அமைப்புகளை மாடலிங் செய்வதற்கு
uk: **SysML:** Шаблон для *Systems Modeling Language* для моделювання широкого діапазону систем і систем-систем

source: **RAAML:** A template for the *Risk Analysis and Assessment Modeling language* for safety and reliability analysis
es: **RAAML:** Una plantilla para el *Lenguaje de Modelado de Análisis y Evaluación de Riesgos* para análisis de seguridad y fiabilidad
fr: **RAAML:** Un modèle pour le *langage d'analyse des risques et de modélisation de leur évaluation* pour l'analyse de la sécurité et de la fiabilité
ta: ** RAAML: ** பாதுகாப்பு மற்றும் நம்பகத்தன்மை பகுப்பாய்விற்கான*இடர் பகுப்பாய்வு மற்றும் மதிப்பீட்டு மாடலிங் மொழிக்கான ஒரு வார்ப்புரு
uk: **RAAML:** шаблон для *мови моделювання аналізу ризиків і оцінки* для аналізу безпеки та надійності

source: **C4 Model:** A template for *Context, Containers, Components, and Code* which is for lean modeling of software architecture
fr: **Modèle C4:** Un modèle pour *Contexte, Conteneurs, Composants et Code* qui permet une modélisation allégée de l'architecture logicielle
ta: ** சி 4 மாடல்: ***சூழல், கொள்கலன்கள், கூறுகள் மற்றும் குறியீட்டிற்கான ஒரு வார்ப்புரு*இது மென்பொருள் கட்டமைப்பின் ஒல்லியான மாடலிங்
uk: **Модель C4:** Шаблон для *Контексту, контейнерів, компонентів і коду*, призначений для економічного моделювання архітектури програмного забезпечення

source: Once the model interface is loaded you'll see the modeling interface.
es: Una vez cargada la interfaz del modelo, verá la interfaz de modelado.
fr: Une fois que l'interface du modèle est chargée, l'interface de modélisation s'affiche.
ta: மாதிரி இடைமுகம் ஏற்றப்பட்டவுடன் நீங்கள் மாடலிங் இடைமுகத்தைக் காண்பீர்கள்.
uk: Після завантаження інтерфейсу моделі ви побачите інтерфейс моделювання.

source: ![The Gaphor main window, with numbers refering to parts of the UI.](images/getting-started-new-model.png)
fr: ![La fenêtre principale de Gaphor, avec des numéros se référant à des parties de l'interface utilisateur](images/getting-started-new-model.png)
ta: மாதிரி இடைமுகம் ஏற்றப்பட்டவுடன் நீங்கள் மாடலிங் இடைமுகத்தைக் காண்பீர்கள்.
uk: ![Головне вікно Gaphor із цифрами, що стосуються частин інтерфейсу користувача.](images/getting-started-new-model.png)

source: The Gaphor main window, with numbers refering to parts of the UI.
fr: La fenêtre principale de Gaphor, avec des numéros se référant à des parties de l'interface utilisateur.
ta: Kaphor முதன்மையான சாளரம், இடைமுகம் இன் பகுதிகளைக் குறிக்கும் எண்களுடன்.
uk: Головне вікно Gaphor із цифрами, що стосуються частин інтерфейсу користувача.

source: The layout of the Gaphor interface is divided into four sections, namely:
es: La disposición de la interfaz Gaphor se divide en cuatro secciones:
fr: La présentation de l'interface Gaphor est divisée en quatre sections, à savoir :
ta: காஃபர் இடைமுகத்தின் தளவமைப்பு நான்கு பிரிவுகளாக பிரிக்கப்பட்டுள்ளது, அதாவது:
uk: Компонування інтерфейсу Gaphor поділено на чотири розділи, а саме:

source: Model Browser
es: Modelo de navegador
fr: Modèle de navigateur
ta: மாதிரி உலாவி
uk: Модель браузера

source: Diagram Element Toolbox
es: Caja de herramientas de elementos de diagrama
fr: Boîte à outils pour les éléments de diagramme
ta: வரைபடம் உறுப்பு கருவிப்பெட்டி
uk: Панель інструментів елементів діаграми

source: Diagrams
es: Diagramas
fr: Diagrammes
ta: வரைபடங்கள்
uk: Діаграми

source: Property Editor
es: Editor de propiedades
fr: Éditeur de propriétés
ta: சொத்து ஆசிரியர்
uk: Редактор властивостей

source: Each section has its own specific function.
es: Cada sección tiene su función específica.
fr: Chaque section a une fonction spécifique.
ta: ஒவ்வொரு பிரிவுக்கும் அதன் சொந்த குறிப்பிட்ட செயல்பாடு உள்ளது.
uk: Кожен розділ має свою особливу функцію.

source: The Model Browser section of the interface displays a hierarchical view of your model. Every model element you create will be inserted into the Model Browser. This view acts as a tree where you can expand and collapse different elements of your model. This provides an easy way to view the elements of your model from an elided perspective. That is, you can collapse those model elements that are irrelevant to the task at hand.
es: La sección Navegador de modelos de la interfaz muestra una vista jerárquica de su modelo. Cada elemento del modelo que cree se insertará en el Navegador de modelos. Esta vista actúa como un árbol en el que puede expandir y contraer diferentes elementos de su modelo. Esto proporciona una manera fácil de ver los elementos de su modelo desde una perspectiva elidida. Es decir, puede contraer aquellos elementos del modelo que son irrelevantes para la tarea que está realizando.
fr: La section Navigateur de modèle de l'interface affiche une vue hiérarchique de votre modèle. Chaque élément de modèle que vous créez est inséré dans le navigateur. Cette vue agit comme un arbre dans lequel vous pouvez développer et réduire les différents éléments de votre modèle. Cela permet de visualiser facilement les éléments du modèle d'un point de vue simplifié. En d'autres termes, vous pouvez réduire les éléments du modèle qui ne sont pas pertinents pour la tâche à accomplir.
ta: இடைமுகத்தின் மாதிரி உலாவி பிரிவு உங்கள் மாதிரியின் படிநிலை காட்சியைக் காட்டுகிறது. நீங்கள் உருவாக்கும் ஒவ்வொரு மாதிரி உறுப்பு மாதிரி உலாவியில் செருகப்படும். இந்த பார்வை உங்கள் மாதிரியின் வெவ்வேறு கூறுகளை விரிவுபடுத்தி உடைக்கக்கூடிய ஒரு மரமாக செயல்படுகிறது. உங்கள் மாதிரியின் கூறுகளை ஒரு எலெக்ட்ரைட் கண்ணோட்டத்தில் பார்க்க இது ஒரு எளிதான வழியை வழங்குகிறது. அதாவது, கையில் இருக்கும் பணிக்கு பொருத்தமற்ற அந்த மாதிரி கூறுகளை நீங்கள் உடைக்கலாம்.
uk: У секції Model Browser інтерфейсу відображається ієрархічне представлення вашої моделі. Кожен елемент моделі, який ви створюєте, буде вставлений в браузер моделі. Це подання діє як дерево, де ви можете розгортати і згортати різні елементи вашої моделі. Це забезпечує простий спосіб перегляду елементів вашої моделі з точки зору елідації. Тобто, ви можете згорнути ті елементи моделі, які не мають відношення до поставленого завдання.

source: In the figure above, you will see that there are two elements in the Model Browser. The root element, _New Model_ is a package. Notice the small arrow beside _New Model_ that is pointing downward. This indicates that the element is expanded. You will also notice the two sub-elements are slightly indented in relation to _New Model_. The _main_ element is a diagram.
es: En la figura anterior, verá que hay dos elementos en el Navegador de modelos. El elemento raíz, _Modelo nuevo_ es un paquete. Observe la pequeña flecha al lado de _Modelo nuevo_ que apunta hacia abajo. Esto indica que el elemento está expandido. También observará que los dos subelementos están ligeramente sangrados con respecto a _Modelo nuevo_. El elemento _principal_ es un diagrama.
fr: Dans la figure ci-dessus, vous verrez qu'il y a deux éléments dans le navigateur de modèle. L'élément racine, Nouveau modèle ( _New Model_), est un paquetage. Remarquez la petite flèche à côté de _Nouveau modèle_ qui pointe vers le bas. Elle indique que l'élément est développé. Vous remarquerez également que les deux sous-éléments sont légèrement en retrait par rapport à Nouveau modèle (_New Model_). L'élément principal (_principal_) est un diagramme.
ta: மேலே உள்ள படத்தில், மாதிரி உலாவியில் இரண்டு கூறுகள் இருப்பதை நீங்கள் காண்பீர்கள். ரூட் உறுப்பு, _ நியூ மாடல்_ ஒரு தொகுப்பு. கீழ்நோக்கி சுட்டிக்காட்டும் _ நியூ மாடல்_ க்கு அருகிலுள்ள சிறிய அம்புக்குறியைக் கவனியுங்கள். உறுப்பு விரிவாக்கப்படுவதை இது குறிக்கிறது. _ நியூ மாடல்_ தொடர்பாக இரண்டு துணை கூறுகள் சற்று உள்தள்ளப்பட்டுள்ளன என்பதையும் நீங்கள் கவனிப்பீர்கள். _Main_ உறுப்பு ஒரு வரைபடம்.
uk: На рисунку вище ви бачите, що браузер моделей складається з двох елементів. Кореневий елемент, _New Model_, є пакунком. Зверніть увагу на маленьку стрілку біля _New Model_, яка вказує вниз. Це означає, що елемент розгорнуто. Ви також помітите, що два піделементи трохи відступають від _New Model_. Основним елементом є діаграма.

source: In the Model Browser view, you can also right-click the model elements to get a context menu. This context menu allows you to find out in which diagram model elements are shown, add new diagrams and packages, and delete an element.
es: En la vista del Navegador de modelos, también puede hacer clic con el botón derecho del ratón en los elementos del modelo para obtener un menú contextual. Este menú contextual le permite averiguar en qué diagrama se muestran los elementos del modelo, añadir nuevos diagramas y paquetes, y eliminar un elemento.
fr: Dans la vue Navigateur de modèle, vous pouvez également cliquer avec le bouton droit de la souris sur les éléments de modèle pour obtenir un menu contextuel. Ce menu contextuel vous permet de savoir dans quel diagramme les éléments de modèle sont affichés, d'ajouter de nouveaux diagrammes et packages, et de supprimer un élément.
ta: மாதிரி உலாவி பார்வையில், சூழல் மெனுவைப் பெற மாதிரி கூறுகளை வலது சொடுக்கு செய்யலாம். இந்த சூழல் பட்டியல் எந்த வரைபட மாதிரி கூறுகள் காண்பிக்கப்படுகின்றன என்பதைக் கண்டறியவும், புதிய வரைபடங்கள் மற்றும் தொகுப்புகளைச் சேர்க்கவும், ஒரு உறுப்பை நீக்கவும் உங்களை அனுமதிக்கிறது.
uk: У режимі перегляду моделі ви також можете клацнути правою кнопкою миші на елементах моделі, щоб отримати контекстне меню. Це контекстне меню дозволяє дізнатися, на якій діаграмі показано елементи моделі, додати нові діаграми і пакети, а також видалити елемент.

source: Double-clicking on a diagram element will show it in the Diagram section. Elements such as classes and packages can be dragged from the tree view on the diagrams.
es: Haciendo doble clic en un elemento del diagrama se mostrará en la sección Diagrama. Los elementos como clases y paquetes pueden arrastrarse desde la vista en árbol a los diagramas.
fr: Un double-clic sur un élément de diagramme l'affiche dans la section Diagramme. Les éléments tels que les classes et les paquets peuvent être glissés de l'arborescence vers les diagrammes.
ta: ஒரு வரைபட உறுப்பில் இருமுறை சொடுக்கு செய்வது வரைபடப் பிரிவில் காண்பிக்கப்படும். வகுப்புகள் மற்றும் தொகுப்புகள் போன்ற கூறுகள் வரைபடங்களில் மரக் காட்சியில் இருந்து இழுக்கப்படலாம்.
uk: Подвійне клацання на елементі діаграми відобразить його в розділі Діаграма. Такі елементи, як класи та пакети, можна перетягувати з перегляду дерева на діаграмах.

source: Toolbox
es: Caja de herramientas
fr: Boîte à outils
ta: கருவிப்பெட்டி
uk: Ящик інструментів

source: The toolbox is used to add new items to a diagram. Select the element you want to add by clicking on it. When you click on the diagram, the selected element is created. The arrow is selected again, so the element can be manipulated.
es: La caja de herramientas se usa para añadir elementos nuevos a un diagrama. Seleccione el elemento que desea añadir haciendo clic sobre él. Al hacer clic en el diagrama, se crea el elemento seleccionado. La flecha vuelve a estar seleccionada, por lo que el elemento puede manipularse.
fr: La boîte à outils permet d'ajouter de nouveaux éléments à un diagramme. Sélectionnez l'élément que vous souhaitez ajouter en cliquant dessus. Lorsque vous cliquez sur le diagramme, l'élément sélectionné est créé. La flèche est à nouveau sélectionnée, ce qui permet de manipuler l'élément.
ta: ஒரு வரைபடத்தில் புதிய உருப்படிகளைச் சேர்க்க கருவிப்பெட்டி பயன்படுத்தப்படுகிறது. அதைக் சொடுக்கு செய்வதன் மூலம் நீங்கள் சேர்க்க விரும்பும் உறுப்பைத் தேர்ந்தெடுக்கவும். நீங்கள் வரைபடத்தில் சொடுக்கு செய்யும் போது, தேர்ந்தெடுக்கப்பட்ட உறுப்பு உருவாக்கப்படுகிறது. அம்பு மீண்டும் தேர்ந்தெடுக்கப்படுகிறது, எனவே உறுப்பு கையாளப்படலாம்.
uk: Панель інструментів використовується для додавання нових елементів до діаграми. Виберіть елемент, який ви хочете додати, натиснувши на нього. Коли ви клацнете на діаграмі, вибраний елемент буде створено. Стрілка знову виділяється, щоб елементом можна було маніпулювати.

source: Tools can be selected by simply left-clicking on them. By default, the pointer tool is selected after every item placement. This can be changed by disabling the "Reset tool" option in the Preferences window. Tools can also be selected by keyboard shortcuts. The keyboard shortcut can be displayed as a tooltip by hovering over the tool button in the toolbox. Finally, it is also possible to drag elements on the Diagram from the toolbox.
es: Las herramientas pueden seleccionarse simplemente haciendo clic con el botón izquierdo del ratón sobre ellas. Por defecto, la herramienta puntero se selecciona después de cada colocación de un elemento. Esto puede cambiarse desactivando la opción "Restablecer herramienta" en la ventana de Preferencias. Las herramientas también pueden seleccionarse mediante atajos del teclado. El atajo del teclado puede mostrarse como información sobre la herramienta pasando el ratón por encima del botón de la herramienta en la caja de herramientas. Por último, también es posible arrastrar elementos sobre el Diagrama desde la caja de herramientas.
fr: Les outils peuvent être sélectionnés en cliquant simplement avec le bouton gauche de la souris. Par défaut, l'outil pointeur est sélectionné après chaque placement d'élément. Ceci peut être modifié en désactivant l'option « Réinitialiser l'outil »(Reset tool) dans la fenêtre des préférences. Les outils peuvent également être sélectionnés par des raccourcis clavier. Le raccourci clavier peut être affiché sous forme d'infobulle en survolant le bouton de l'outil dans la boîte à outils. Enfin, il est également possible de faire glisser des éléments sur le diagramme à partir de la boîte à outils.
ta: வெறுமனே இடது-கிளிக் செய்வதன் மூலம் கருவிகளைத் தேர்ந்தெடுக்கலாம். இயல்பாக, ஒவ்வொரு உருப்படி வேலைவாய்ப்புக்கும் பிறகு சுட்டிக்காட்டி கருவி தேர்ந்தெடுக்கப்படுகிறது. விருப்பத்தேர்வுகள் சாளரத்தில் "மீட்டமைப்பு கருவி" விருப்பத்தை முடக்குவதன் மூலம் இதை மாற்றலாம். விசைப்பலகை குறுக்குவழிகள் மூலமாகவும் கருவிகளைத் தேர்ந்தெடுக்கலாம். விசைப்பலகை குறுக்குவழியை கருவிப்பெட்டியில் உள்ள கருவி பொத்தானை நகர்த்துவதன் மூலம் உதவிக்குறிப்பாக காட்ட முடியும். இறுதியாக, கருவிப்பெட்டியில் இருந்து வரைபடத்தில் கூறுகளை இழுக்கவும் முடியும்.
uk: Інструменти можна вибрати, просто клацнувши на них лівою кнопкою миші. За замовчуванням інструмент вказівника вибирається після кожного розміщення елемента. Це можна змінити, вимкнувши опцію "Скидати інструмент" у вікні Параметри. Інструменти також можна вибирати за допомогою комбінацій клавіш. Комбінацію клавіш можна відобразити у вигляді підказки, якщо навести курсор миші на кнопку інструмента на панелі інструментів. Нарешті, можна також перетягувати елементи на діаграмі з панелі інструментів.
