Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: At the logical Level, we'll define a technology-agnostic solution. This is the middle level of abstraction, where the system is described in terms of its structure and behavior. At this level, the focus is on how the system components are organized and how they interact with each other.
fr: Au niveau logique, nous définirons une solution indépendante sur le plan technologique. Il s'agit du niveau intermédiaire d'abstraction, où le système est décrit en termes de structure et de comportement. À ce niveau, l'accent est mis sur la façon dont les composants du système sont organisés et sur la façon dont ils interagissent les uns avec les autres.
ta: தர்க்கரீதியான மட்டத்தில், தொழில்நுட்ப-அஞ்ஞான தீர்வை வரையறுப்போம். இது சுருக்கத்தின் நடுத்தர மட்டமாகும், அங்கு கணினி அதன் கட்டமைப்பு மற்றும் நடத்தை அடிப்படையில் விவரிக்கப்பட்டுள்ளது. இந்த மட்டத்தில், கணினி கூறுகள் எவ்வாறு ஒழுங்கமைக்கப்பட்டுள்ளன, அவை எவ்வாறு ஒருவருக்கொருவர் தொடர்பு கொள்கின்றன என்பதில் கவனம் செலுத்துகிறது.
uk: На логічному рівні ми визначимо технологічно агностичне рішення. Це середній рівень абстракції, де система описується з точки зору її структури та поведінки. На цьому рівні основна увага приділяється тому, як організовані компоненти системи та як вони взаємодіють один з одним.

source: Functional Boundary Behavior
fr: Comportement à la frontière fonctionnelle
ta: செயல்பாட்டு எல்லை நடத்தை
uk: Функціональна гранична поведінка

source: A Functional Boundary Behavior diagram is a type of SysML Activity diagram used to show the interactions between different logical blocks. The swim lanes divide the diagram into different areas, each representing a different functional block or component.
fr: Un diagramme de 'comportement à la frontière fonctionnelle' est un type de diagramme d'activité SysML utilisé pour montrer les interactions entre différents blocs logiques. Les couloirs d'activité (swim lanes) divisent le diagramme en différentes zones, chacune représentant un bloc fonctionnel ou un composant différent.
ta: ஒரு செயல்பாட்டு எல்லை நடத்தை வரைபடம் என்பது வெவ்வேறு தருக்க தொகுதிகளுக்கு இடையிலான தொடர்புகளைக் காட்டப் பயன்படுத்தப்படும் ஒரு வகை SysML செயல்பாட்டு வரைபடமாகும். நீச்சல் பாதைகள் வரைபடத்தை வெவ்வேறு பகுதிகளாகப் பிரிக்கின்றன, ஒவ்வொன்றும் வெவ்வேறு செயல்பாட்டு தொகுதி அல்லது கூறுகளைக் குறிக்கின்றன.
uk: Діаграма функціональної межі — це тип діаграми активності SysML, який використовується для відображення взаємодії між різними логічними блоками. Доріжки для плавання поділяють діаграму на різні області, кожна з яких представляє окремий функціональний блок або компонент.

source: In this case, the diagram includes swimlanes for the HMI, Controller, Water Pump, Water Heater, Group Head, and Portafilter. The HMI receives the button press from the barista and then sends a command to the Controller. The Controller then commands the Water Heater to start, and once the water has reached the correct temperature, the Controller commands the Pump to start. The water would then be pumped through the Group Head and into the Portafilter, brewing the coffee. The diagram shows the flow of information and actions between the different logical blocks, and help to ensure that the behavior that each block provides is properly connected and integrated into the system.
fr: Dans ce cas, le diagramme comprend des couloirs d'activité (swimlanes) pour l'IHM (HMI), le contrôleur (Controller), la pompe à eau (Water Pomp), le chauffe-eau (Water Heater) , la tête de groupe (Group Head) et le filtre à eau (Portafilter). L'IHM reçoit l'information 'bouton pressé' par le barman ( barista) et envoie une commande au contrôleur. Ce dernier ordonne alors au chauffe-eau de se mettre en marche et, une fois que l'eau a atteint la bonne température, il ordonne à la pompe de se mettre en marche. L'eau est alors pompée à travers la tête de groupe et dans le porte-filtre, ce qui permet de préparer le café. Le diagramme montre le flux d'informations et d'actions entre les différents blocs logiques et permet de s'assurer que le comportement fourni par chaque bloc est correctement connecté et intégré au système.
ta: இந்த வழக்கில், வரைபடத்தில் எச்.எம்.ஐ, கட்டுப்படுத்தி, நீர் பம்ப், வாட்டர் ஈட்டர், குழு தலை மற்றும் போர்டாஃபில்டர் ஆகியவற்றிற்கான நீச்சலுடைகள் அடங்கும். HMI பாரிச்டாவிலிருந்து பொத்தானை அழுத்துகிறது, பின்னர் ஒரு கட்டளையை கட்டுப்படுத்திக்கு அனுப்புகிறது. கட்டுப்படுத்தி பின்னர் வாட்டர் ஈட்டரைத் தொடங்கும்படி கட்டளையிடுகிறது, மேலும் நீர் சரியான வெப்பநிலையை அடைந்தவுடன், கட்டுப்படுத்தி பம்பை தொடங்க கட்டளையிடுகிறது. பின்னர் தண்ணீர் குழு தலை வழியாகவும், போர்டாஃபில்டருக்கும் செலுத்தப்படும், காபியை காய்ச்சும். வரைபடம் வெவ்வேறு தருக்கத் தொகுதிகளுக்கு இடையிலான செய்தி மற்றும் செயல்களின் ஓட்டத்தைக் காட்டுகிறது, மேலும் ஒவ்வொரு தொகுதியும் வழங்கும் நடத்தை சரியாக இணைக்கப்பட்டு கணினியில் ஒருங்கிணைக்கப்படுவதை உறுதிப்படுத்த உதவுகிறது.
uk: У цьому випадку діаграма включає доріжки для HMI, контролера, водяного насоса, водонагрівача, головки групи та портафільтра. HMI отримує натискання кнопки від бариста, а потім надсилає команду контролеру. Потім контролер дає команду на запуск водонагрівача, і коли вода досягне потрібної температури, контролер дає команду на запуск насоса. Потім вода прокачується через головку групи в портафільтр, заварюючи каву. Діаграма показує потік інформації та дії між різними логічними блоками та допомагає переконатися, що поведінка, яку забезпечує кожен блок, належним чином пов’язана та інтегрована в систему.

source: From the Logical package, expand the Behavior package in the Model Browser and double-click on the diagram named Functional Boundary Behavior. Additional swimlanes can be added by clicking on the swimlanes and add additional partitions in the Property Editor. The name of the partition before the colon can also be changed in the Property Editor. The names of the Blocks can be changed in the Structure package, as was explained in the [Domain Diagram section](coffee_machine_concept.md#domain-diagram).
fr: Dans le paquet Logique, développez le paquet Comportement (Beahavior) dans le navigateur de modèle (Model Browser) et double-cliquez sur le diagramme nommé Comportement de frontière fonctionnelle (Functional Boundary Behavior). Des couloirs d'activités (swimlanes) supplémentaires peuvent être ajoutés en cliquant sur les couloirs d'activités et en ajoutant des partitions supplémentaires dans l'éditeur de propriétés. Le nom de la partition précédant les deux points peut également être modifié dans l'éditeur de propriétés. Les noms des blocs peuvent être modifiés dans le paquet Structure, comme expliqué dans la [section Diagramme de domaine](coffee_machine_concept.md#domain-diagram).
ta: தருக்க தொகுப்பிலிருந்து, மாதிரி உலாவியில் நடத்தை தொகுப்பை விரிவுபடுத்தி, செயல்பாட்டு எல்லை நடத்தை என்ற வரைபடத்தில் இருமுறை சொடுக்கு செய்யவும். நீச்சலுடைகளைக் சொடுக்கு செய்வதன் மூலம் கூடுதல் நீச்சலுடைகளைச் சேர்க்கலாம் மற்றும் சொத்து எடிட்டரில் கூடுதல் பகிர்வுகளைச் சேர்க்கலாம். பெருங்குடலுக்கு முன் பகிர்வின் பெயரை சொத்து எடிட்டரில் மாற்றலாம். [டொமைன் வரைபட பிரிவு](coffee_machine_concept.md#domain-diagram) விளக்கப்பட்டுள்ளபடி, கட்டமைப்பு தொகுப்பில் தொகுதிகளின் பெயர்களை மாற்றலாம்.
uk: У пакеті Logical розгорніть пакет Behavior у браузері моделей і двічі клацніть діаграму з назвою Functional Boundary Behavior. Додаткові доріжки можна додати, натиснувши на доріжки та додавши додаткові розділи в редакторі властивостей. Ім’я розділу перед двокрапкою також можна змінити в редакторі властивостей. Назви блоків можна змінити в пакеті Structure, як пояснювалося в [розділі діаграми домену](coffee_machine_concept.md#domain-diagram).

source: Additional Object Flows, pins (pay attention to inputs vs outputs), and actions can be created using the Toolbox. The Parameter Nodes which are attached to the Activity on the very left and right of the diagram are created and renamed created by clicking on the Activity and modifying them in the Property Editor.
fr: Des flux d'objets (Object Flows), des broches (attention aux entrées et aux sorties) et des actions supplémentaires peuvent être créés à l'aide de la boîte à outils (Toolbox). Les nœuds de paramètres attachés à l'activité à gauche et à droite du diagramme sont créés et renommés en cliquant sur l'activité et en les modifiant dans l'éditeur de propriétés.
ta: கூடுதல் பொருள் பாய்ச்சல்கள், ஊசிகள் (உள்ளீடுகள் மற்றும் வெளியீடுகளுக்கு கவனம் செலுத்துங்கள்), மற்றும் கருவிப்பெட்டியைப் பயன்படுத்தி செயல்களை உருவாக்கலாம். வரைபடத்தின் இடது மற்றும் வலதுபுறத்தில் செயல்பாட்டுடன் இணைக்கப்பட்டுள்ள அளவுரு முனைகள் உருவாக்கப்பட்டு, செயல்பாட்டைக் சொடுக்கு செய்து அவற்றை சொத்து எடிட்டரில் மாற்றியமைப்பதன் மூலம் உருவாக்கப்பட்டு மறுபெயரிடப்படுகின்றன.
uk: Додаткові потоки об’єктів, закріплення (зверніть увагу на входи та виходи) і дії можна створити за допомогою панелі інструментів. Вузли параметрів, які приєднані до активності ліворуч і праворуч від діаграми, створюються та перейменовуються шляхом натискання на дію та зміни їх у редакторі властивостей.

source: Logical State Machine
fr: État Logique Machine
ta: தருக்க மாநில இயந்திரம்
uk: Логічний кінцевий автомат

source: The logical state machine for the coffee machine is a diagram that shows the different states and transitions that the machine goes through to make coffee. In this case, there are two main states: On and Off.
fr: L' état logique de la machine à café est un diagramme qui montre les différents états et transitions par lesquels la machine passe pour faire du café. Dans ce cas, il y a deux états principaux : On et Off.
ta: காபி இயந்திரத்திற்கான தருக்க நிலை இயந்திரம் ஒரு வரைபடமாகும், இது காபி தயாரிக்க இயந்திரம் கடந்து செல்லும் வெவ்வேறு மாநிலங்களையும் மாற்றங்களையும் காட்டுகிறது. இந்த வழக்கில், இரண்டு முக்கிய மாநிலங்கள் உள்ளன: ஆன் மற்றும் ஆஃப்.
uk: Машина логічного стану для кавомашини – це діаграма, яка показує різні стани та переходи, через які проходить машина для приготування кави. У цьому випадку є два основних стани: увімкнено та вимкнено.

source: When the coffee machine is turned on, it enters the On state. Inside the On state, there are some substates, starting with the heat water state. The machine will transition from the heat water state to the ready state when the temperature reaches the set point.
fr: Lorsque la machine à café est allumée, elle passe à l'état « On ». À l'intérieur de cet état, il y a plusieurs sous-états, à commencer par l'état « eau chaude ». La machine passe de l'état « eau chaude » à l'état « prêt » lorsque la température atteint le point de consigne.
ta: காபி இயந்திரம் இயக்கப்படும் போது, அது நிலைக்குள் நுழைகிறது. மாநிலத்தின் உள்ளே, வெப்ப நீர் நிலையில் தொடங்கி சில துணை மூலக்கூறுகள் உள்ளன. வெப்பநிலை செட் புள்ளியை அடையும் போது இயந்திரம் வெப்ப நீர் நிலையிலிருந்து தயாராக நிலைக்கு மாறும்.
uk: Коли кавова машина вмикається, вона переходить у стан On. Усередині стану «Ввімкнуто» є кілька підстанів, починаючи зі стану тепла, води. Машина перейде зі стану нагріву води в стан готовності, коли температура досягне заданої точки.

source: Once the machine is in the ready state, the user can select one or two cup mode. Depending on the mode selected, the machine will transition to either the one cup mode or two cup mode.
fr: Une fois que la machine est prête, l'utilisateur peut sélectionner le mode une ou deux tasses. Selon le mode sélectionné, la machine passera en mode une tasse ou deux tasses.
ta: இயந்திரம் தயாராக இருக்கும் நிலையில் இருந்ததும், பயனர் ஒன்று அல்லது இரண்டு கப் பயன்முறையைத் தேர்ந்தெடுக்கலாம். தேர்ந்தெடுக்கப்பட்ட பயன்முறையைப் பொறுத்து, இயந்திரம் ஒரு கோப்பை பயன்முறைக்கு அல்லது இரண்டு கப் பயன்முறைக்கு மாறும்.
uk: Коли машина перебуває в стані готовності, користувач може вибрати режим однієї або двох чашок. Залежно від вибраного режиму машина перейде в режим однієї або двох чашок.

source: State machine diagram showing logical states including on and off
fr: Diagramme d'état machine montre les états logiques, y compris l'activation et la désactivation
ta: ஆன் மற்றும் ஆஃப் உள்ளிட்ட தர்க்கரீதியான நிலைகளைக் காட்டும் மாநில இயந்திர வரைபடம்
uk: Схема кінцевого автомата, що показує логічні стани, включаючи ввімкнення та вимкнення

source: Open the Logical States diagram and add a region to the On state via the Property Editor. Next use the Toolbox to add the additional substates and transition. Guards for the transitions, shown surrounded by brackets, are added by selecting the transition and adding the guard in the Property Editor.
fr: Ouvrez le diagramme des Etats Logiques (Logical States) et ajoutez une région à l'état 'On' via l'éditeur de propriétés (Property Editor). Utilisez ensuite la boîte à outils (Toolbox) pour ajouter les sous-états et la transition supplémentaires. Les protections des transitions, indiquées entre parenthèses, sont ajoutées en sélectionnant la transition et la protection correspondante dans l'éditeur de propriétés.
ta: தருக்க மாநிலங்களின் வரைபடத்தைத் திறந்து, சொத்து எடிட்டர் வழியாக ஒரு பகுதியை ஆன் மாநிலத்தில் சேர்க்கவும். அடுத்து கூடுதல் துணை மற்றும் மாற்றங்களைச் சேர்க்க கருவிப்பெட்டியைப் பயன்படுத்தவும். மாற்றங்களுக்கான காவலர்கள், அடைப்புக்குறிகளால் சூழப்பட்டுள்ளனர், மாற்றத்தைத் தேர்ந்தெடுத்து சொத்து எடிட்டரில் காவலரைச் சேர்ப்பதன் மூலம் சேர்க்கப்படுகிறார்கள்.
uk: Відкрийте діаграму логічних станів і за допомогою редактора властивостей додайте область у стан «Увімкнено». Далі використовуйте Toolbox, щоб додати додаткові підстани та перехід. Захисники для переходів, показані в дужках, додаються шляхом вибору переходу та додавання обмежувача в редакторі властивостей.

source: The logical state machine diagram for the coffee machine shows these states, and the different conditions that trigger the transitions. This helps the ants designing the machine to understand how the coffee machine works and ensure that it functions properly.
fr: Le diagramme d'état logique de la machine à café montre ces états et les différentes conditions qui déclenchent les transitions. Cela aide les fourmis qui conçoivent la machine à comprendre le fonctionnement de la machine à café et à s'assurer qu'elle fonctionne correctement.
ta: காபி இயந்திரத்திற்கான தருக்க மாநில இயந்திர வரைபடம் இந்த நிலைகளையும், மாற்றங்களைத் தூண்டும் வெவ்வேறு நிலைமைகளையும் காட்டுகிறது. காபி இயந்திரம் எவ்வாறு இயங்குகிறது என்பதைப் புரிந்துகொள்ளவும், அது சரியாக செயல்படுவதை உறுதிசெய்யவும் இயந்திரத்தை வடிவமைக்கும் எறும்புகள் இது உதவுகிறது.
uk: Схема логічного автомата стану для кавомашини показує ці стани та різні умови, які викликають переходи. Це допомагає мурахам, які розробляють машину, зрозуміти, як працює кавоварка, і переконатися, що вона працює належним чином.

source: Logical Structure
fr: Structure logique
ta: தருக்க அமைப்பு
uk: Логічна структура

source: The logical structure shows which logical blocks the espresso machine is made up of. Since we are at the logical level, these blocks should be agnostic to technical choices.
fr: La structure logique montre de quels blocs logiques la machine à espresso est constituée. Puisque nous sommes au niveau logique, ces blocs devraient être agnostiques par rapport aux choix techniques.
ta: எச்பிரெசோ இயந்திரம் எந்த தர்க்கரீதியான தொகுதிகளை உருவாக்கியது என்பதை தருக்க அமைப்பு காட்டுகிறது. நாங்கள் தர்க்கரீதியான மட்டத்தில் இருப்பதால், இந்த தொகுதிகள் தொழில்நுட்ப தேர்வுகளுக்கு அஞ்ஞானவாதியாக இருக்க வேண்டும்.
uk: Логічна структура показує, з яких логічних блоків складається еспресо-машина. Оскільки ми знаходимося на логічному рівні, ці блоки повинні бути агностиками щодо технічного вибору.

source: The following logical blocks are part of the espresso machine:
fr: Les blocs logiques suivants font partie de la machine à expresso :
ta: பின்வரும் தருக்க தொகுதிகள் எச்பிரெசோ இயந்திரத்தின் ஒரு பகுதியாகும்:
uk: До складу еспресо-машини входять такі логічні блоки:

source: Water tank
fr: Water tank (Réservoir d'eau)
ta: நீர் தொட்டி
uk: Резервуар для води

source: Water pump
fr: Water pump (Pompe)
ta: நீர் பம்ப்
uk: Водяний насос

source: Water heater
fr: Water heater (Chauffe-eau)
ta: வாட்டர் ஈட்டர்
uk: Водонагрівач

source: Portafilter
fr: Portafilter (Porte-filtre)
ta: போர்டாஃபில்டர்
uk: Портафільтр

source: Controller
fr: Controller (Contrôleur)
ta: கட்டுப்படுத்தி
uk: Контролер

source: Group head
fr: Group head (Tête de groupe)
ta: குழு தலை
uk: Керівник групи

source: HMI
fr: IHM
ta: அ்மி

source: Each block represents a key portion of the espresso machine, and the containment relationship is used between the espresso machine and its logical parts.
fr: Chaque bloc représente une partie essentielle de la machine à espresso, et la relation de confinement est utilisée entre la machine à espresso et ses parties logiques.
ta: ஒவ்வொரு தொகுதியும் எச்பிரெசோ இயந்திரத்தின் முக்கிய பகுதியைக் குறிக்கிறது, மேலும் எச்பிரெசோ இயந்திரத்திற்கும் அதன் தருக்க பகுதிகளுக்கும் இடையில் கட்டுப்பாட்டு உறவு பயன்படுத்தப்படுகிறது.
uk: Кожен блок представляє ключову частину еспресо-машини, а зв’язок утримання використовується між еспресо-машиною та її логічними частинами.

source: Block definition diagram showing the coffee machine and its logical parts
fr: Schéma de définition du bloc montrant la machine à café et ses parties logiques
ta: காபி இயந்திரம் மற்றும் அதன் தர்க்கரீதியான பகுதிகளைக் காட்டும் வரையறை வரைபடம்
uk: Блок-схема визначення кавоварки та її логічних частин

source: Water tank: The water tank is a container that stores the water used in the espresso machine. It typically has a specific capacity and is designed for easy filling and cleaning. The water tank supplies water to the water pump when needed.
fr: Water tank : Le réservoir d'eau est un récipient qui stocke l'eau utilisée dans la machine à espresso. Il a généralement une capacité spécifique et est conçu pour être facilement rempli et nettoyé. Le réservoir d'eau alimente la pompe à eau en cas de besoin.
ta: நீர் தொட்டி: நீர் தொட்டி என்பது எச்பிரெசோ கணினியில் பயன்படுத்தப்படும் தண்ணீரை சேமிக்கும் ஒரு கொள்கலன் ஆகும். இது பொதுவாக ஒரு குறிப்பிட்ட திறனைக் கொண்டுள்ளது மற்றும் எளிதாக நிரப்புவதற்கும் தூய்மை செய்வதற்கும் வடிவமைக்கப்பட்டுள்ளது. தேவைப்படும்போது நீர் பம்பிற்கு நீர் தொட்டி தண்ணீரை வழங்குகிறது.
uk: Резервуар для води: резервуар для води – це ємність, у якій зберігається вода, яка використовується в еспресо-машині. Зазвичай він має певну місткість і призначений для легкого наповнення та очищення. Резервуар для води подає воду до водяного насоса, коли це необхідно.

source: Water pump: The water pump is responsible for drawing water from the water tank and creating the necessary pressure to force the water through the coffee grounds in the portafilter. It plays a crucial role in the espresso extraction process by ensuring a consistent flow of water.
fr: Water pump : La pompe à eau est chargée de puiser l'eau dans le réservoir d'eau et de créer la pression nécessaire pour faire passer l'eau à travers le marc de café dans le filtre à café. Elle joue un rôle crucial dans le processus d'extraction de l'espresso en assurant un débit d'eau constant.
ta: நீர் பம்ப்: நீர் தொட்டியில் இருந்து தண்ணீரை வரைந்து, போர்டாஃபில்டரில் உள்ள காபி மைதானத்தின் வழியாக தண்ணீரை கட்டாயப்படுத்த தேவையான அழுத்தத்தை உருவாக்குவதற்கு நீர் பம்ப் பொறுப்பாகும். எச்பிரெசோ பிரித்தெடுத்தல் செயல்பாட்டில் இது ஒரு முக்கிய பங்கு வகிக்கிறது.
uk: Водяний насос: водяний насос відповідає за забір води з резервуара для води та створення необхідного тиску, щоб проштовхнути воду через кавову гущу в портафільтрі. Він відіграє вирішальну роль у процесі екстракції еспресо, забезпечуючи постійний потік води.

source: Water heater: The water heater, also known as the boiler or heating element, is responsible for heating the water to the optimal temperature for brewing espresso. It maintains the water at the desired temperature to ensure proper extraction and flavor.
fr: Water heater : Le chauffe-eau, également appelé boiler ou élément chauffant, est chargé de chauffer l'eau à la température optimale pour la préparation de l'espresso. Il maintient l'eau à la température souhaitée pour garantir une extraction et une saveur adéquates.
ta: வாட்டர் ஈட்டர்: கொதிகலன் அல்லது வெப்பமூட்டும் உறுப்பு என்றும் அழைக்கப்படும் வாட்டர் ஈட்டர், எச்பிரெசோவை காய்ச்சுவதற்கான உகந்த வெப்பநிலைக்கு தண்ணீரை சூடாக்குவதற்கு காரணமாகும். சரியான பிரித்தெடுத்தல் மற்றும் சுவையை உறுதி செய்வதற்காக இது விரும்பிய வெப்பநிலையில் தண்ணீரை பராமரிக்கிறது.
uk: Водонагрівач: водонагрівач, також відомий як бойлер або нагрівальний елемент, відповідає за нагрівання води до оптимальної температури для приготування еспресо. Він підтримує бажану температуру води, щоб забезпечити правильний віджим і смак.

source: Portafilter: The portafilter is a detachable handle-like device that holds the coffee grounds. It is attached to the espresso machine and acts as a filter holder. The water from the pump is forced through the coffee grounds in the portafilter to extract the flavors and create the espresso.
fr: Portafilter : C'est un dispositif amovible en forme de poignée qui contient le marc de café. Il est fixé à la machine à espresso et sert de porte-filtre. L'eau de la pompe est forcée à travers le marc de café dans le porte-filtre pour extraire les arômes et créer l'espresso.
ta: போர்டாஃபில்டர்: போர்டாஃபில்டர் என்பது பிரிக்கக்கூடிய கைப்பிடி போன்ற சாதனமாகும், இது காபி மைதானத்தை வைத்திருக்கிறது. இது எச்பிரெசோ இயந்திரத்துடன் இணைக்கப்பட்டுள்ளது மற்றும் வடிகட்டி வைத்திருப்பவராக செயல்படுகிறது. பம்பிலிருந்து வரும் நீர் போர்டாஃபில்டரில் உள்ள காபி மைதானம் வழியாக சுவைகளைப் பிரித்தெடுத்து எச்பிரெசோவை உருவாக்க கட்டாயப்படுத்தப்படுகிறது.
uk: Портафільтр: портафільтр – це знімний пристрій, схожий на ручку, який утримує кавову гущу. Він кріпиться до еспресо-машини і виконує роль тримача фільтра. Вода з насоса проходить через кавову гущу в портафільтрі, щоб отримати аромати та створити еспресо.

source: Controller: The controller, often a microcontroller or a dedicated circuit board, is the brain of the espresso machine. It manages and coordinates the operation of various components, such as the water pump, water heater, and HMI, to ensure the correct brewing process. It monitors and controls temperature, pressure, and other parameters to maintain consistency and deliver the desired results.
fr: Controller : C'est très souvent un microcontrôleur ou un circuit imprimé dédié, c'est le cerveau de la machine à espresso. Il gère et coordonne le fonctionnement de divers composants, tels que la pompe à eau, le chauffe-eau et l'IHM, afin de garantir un processus d'infusion correct. Il surveille et contrôle la température, la pression et d'autres paramètres afin de maintenir la cohérence et d'obtenir les résultats souhaités.
ta: கட்டுப்படுத்தி: கட்டுப்படுத்தி, பெரும்பாலும் மைக்ரோகண்ட்ரோலர் அல்லது பிரத்யேக சர்க்யூட் போர்டு, எச்பிரெசோ இயந்திரத்தின் மூளை. சரியான காய்ச்சும் செயல்முறையை உறுதிப்படுத்த நீர் பம்ப், வாட்டர் ஈட்டர் மற்றும் எச்.எம்.ஐ போன்ற பல்வேறு கூறுகளின் செயல்பாட்டை இது நிர்வகிக்கிறது மற்றும் ஒருங்கிணைக்கிறது. இது வெப்பநிலை, அழுத்தம் மற்றும் பிற அளவுருக்களைக் கண்காணிக்கிறது மற்றும் கட்டுப்படுத்துகிறது, இது நிலைத்தன்மையை பராமரிக்கவும் விரும்பிய முடிவுகளை வழங்கவும்.
uk: Контролер: Контролер, часто мікроконтролер або спеціальна друкована плата, є мозком кавоварки еспресо. Він керує та координує роботу різних компонентів, таких як водяний насос, водонагрівач і HMI, щоб забезпечити правильний процес пивоваріння. Він відстежує та контролює температуру, тиск та інші параметри для підтримки стабільності та досягнення бажаних результатів.
