Repository: gaphor/gaphor
Catalog: docs/locale/*/LC_MESSAGES/docs.po
Languages: es, fr, ta, uk

source: Gaphor supports dark and light mode since 2.16.0. Dark and light color schemes are exclusively used for on-screen editing. When exporting images, only the default color scheme is applied. Color schemes can be defined with `@media` queries. The official `prefers-color-scheme = dark` query is supported, as well as a more convenient `dark-mode`.
es: Gaphor soporta los modos oscuro y claro desde la versión 2.16.0. Los esquemas de color oscuro y claro se usan exclusivamente para la edición en pantalla. Al exportar imágenes, sólo se aplica el esquema de color predeterminado. Los esquemas de color se pueden definir con consultas `@media`. La consulta oficial `prefers-color-scheme = dark` está soportada, así como la más conveniente `dark-mode`.
fr: Depuis la version 2.16.0, Gaphor prend en charge les modes sombre et clair. Les couleurs foncées et claires sont exclusivement utilisées pour l'édition à l'écran. Lors de l'exportation d'images, la palette de couleurs par défaut est appliquée. Les jeux de couleurs peuvent être définis à l'aide des requêtes `@media`. La requête officielle `prefers-color-scheme = dark` est prise en charge, ainsi qu'un mode sombre plus pratique.
ta: கஃபர் 2.16.0 முதல் இருண்ட மற்றும் ஒளி பயன்முறையை ஆதரிக்கிறது. இருண்ட மற்றும் ஒளி வண்ணத் திட்டங்கள் திரையில் திருத்துதல் பிரத்தியேகமாகப் பயன்படுத்தப்படுகின்றன. படங்களை ஏற்றுமதி செய்யும் போது, இயல்புநிலை வண்ணத் திட்டம் மட்டுமே பயன்படுத்தப்படுகிறது. வண்ணத் திட்டங்களை `@மீடியா` வினவல்களுடன் வரையறுக்கலாம். அதிகாரி `விரும்புகிறது-வண்ணம் = இருண்ட` வினவல் ஆதரிக்கப்படுகிறது, அத்துடன் மிகவும் வசதியான` இருண்ட-முறை`.
uk: Gaphor підтримує темні та світлі режими, починаючи з версії 2.16.0. Темні та світлі колірні схеми використовуються виключно для редагування на екрані. Під час експорту зображень застосовується лише типова схема кольорів. Кольорові схеми можна визначити за допомогою запитів `@media`. Підтримується офіційний запит `prefers-color-scheme = dark`, а також більш зручний `dark-mode`.

source: Diagram styles
es: Estilos de diagrama
fr: Styles de diagramme
ta: வரைபடம் பாணிகள்
uk: Стилі діаграм

source: Only a few properties can be defined on a diagram, namely `background-color` and `line-style`. You define the diagram style separately from the diagram item styles. That way it's possible to set the background color for diagrams specifically. The line style can be the normal straight lines, or a more playful "sloppy" style. For the sloppy style an optional wobliness factor can be provided to set the level of line wobbliness. 0.5 is default, 0.0 is a straight line. The value should be between -2.0 and 2.0. Values between 0.0 and 0.5 make for a subtle effect.
es: En un diagrama solo pueden definirse unas pocas propiedades, a saber, `background-color` y `line-style`. El estilo del diagrama se define por separado de los estilos de los elementos del diagrama. De esta manera es posible establecer el color de fondo para los diagramas específicamente. El estilo de línea puede ser las líneas rectas normales, o un estilo "omisión" más juguetón. Para el estilo "omisión" se puede proporcionar un factor opcional de bamboleo para establecer el nivel de bamboleo de la línea. 0.5 es el valor predeterminado, 0.0 es una línea recta. El valor debe estar comprendido entre -2,0 y 2,0. Los valores entre 0,0 y 0,5 producen un efecto sutil.
fr: Seules quelques propriétés peuvent être définies pour un diagramme, à savoir `background-color` et `line-style`. Le style du diagramme est défini séparément de celui des éléments du diagramme. Il est ainsi possible de définir la couleur d'arrière-plan pour les diagrammes de manière spécifique. Le style de ligne peut être la ligne droite normale, ou un style plus ludique « sloppy ». Pour le style négligé, il est possible de fournir un facteur optionnel d'ondulation permettant de définir le niveau d'ondulation de la ligne. La valeur par défaut est 0,5, correspondant à une ligne droite. La valeur doit être comprise entre -2,0 et 2,0. Les valeurs comprises entre 0,0 et 0,5 produisent un effet subtil.
ta: ஒரு வரைபடத்தில் ஒரு சில பண்புகளை மட்டுமே வரையறுக்க முடியும், அதாவது `பின்னணி-வண்ணம்` மற்றும்` வரி-பாணி`. வரைபட பாணியை வரைபடம் உருப்படி பாணிகளிலிருந்து தனித்தனியாக வரையறுக்கிறீர்கள். அந்த வகையில் வரைபடங்களுக்கான பின்னணி நிறத்தை குறிப்பாக அமைக்க முடியும். வரி பாணி சாதாரண நேர் கோடுகள் அல்லது மிகவும் விளையாட்டுத்தனமான "சேறும் சகதியுமான பாணியாக இருக்கலாம். சேறும் சகதியுமான பாணிக்கு, வரி வோப்னெச் அளவை அமைக்க ஒரு விருப்பமான வொப்ளினச் காரணி வழங்கப்படலாம். 0.5 இயல்புநிலை, 0.0 ஒரு நேர் கோடு. மதிப்பு -2.0 முதல் 2.0 வரை இருக்க வேண்டும். 0.0 மற்றும் 0.5 க்கு இடையிலான மதிப்புகள் நுட்பமான விளைவை ஏற்படுத்துகின்றன.
uk: Для діаграми можна визначити лише декілька властивостей, а саме `background-color` та `line-style`. Стиль діаграми визначається окремо від стилів елементів діаграми. Таким чином, ви можете задати колір тла саме для діаграм. Стиль ліній може бути звичайними прямими лініями або більш грайливим "недбалим" стилем. Для недбалого стилю можна задати опціональний коефіцієнт хиткості, щоб встановити рівень хиткості лінії. 0.5 - значення за замовчуванням, 0.0 - пряма лінія. Значення має бути між -2.0 і 2.0. Значення від 0.0 до 0.5 дають тонкий ефект.

source: CSS model elements
fr: Éléments du modèle CSS
ta: சிஎச்எச் மாதிரி கூறுகள்
uk: Елементи моделі CSS

source: Gaphor has many model elements. How can you find out which item should be styled?
es: Gaphor tiene muchos elementos de modelo. ¿Cómo se puede saber qué elemento debe ser estilizado?
fr: Gaphor possède de nombreux éléments de modèle. Comment savoir quel élément doit être stylisé ?
ta: கஃபர் பல மாதிரி கூறுகளைக் கொண்டுள்ளது. எந்த உருப்படியை வடிவமைக்க வேண்டும் என்பதை நீங்கள் எவ்வாறு கண்டுபிடிப்பது?
uk: Gaphor має багато модельних елементів. Як можна дізнатися, який предмет потрібно стилізувати?

source: Gaphor only styles the elements that are in the model, so you should be explicit on their names. For example: `Component` inherits from `Class` in the UML model, but changing a color for `Class` does not change it for `Component`.
es: Gaphor solo aplica estilo a los elementos que están en el modelo, por lo que debe ser explícito en sus nombres. Por ejemplo: `Component` hereda de `Class` en el modelo UML, pero cambiar un color para `Class` no lo cambia para `Component`.
fr: Gaphor ne stylise que les éléments présents dans le modèle, vous devez donc être explicite sur leurs noms. Par exemple, `Component`hérite de la `Class` dans le modèle UML, mais changer la couleur d'une classe ne la change pas pour un `Component`.
ta: கஃபர் மாதிரியில் உள்ள கூறுகளை மட்டுமே பாணியில் வைத்திருக்கிறது, எனவே நீங்கள் அவர்களின் பெயர்களில் வெளிப்படையாக இருக்க வேண்டும். எடுத்துக்காட்டாக: `கூறு` யுஎம்எல் மாதிரியில்` வகுப்பு` இலிருந்து பெறுகிறது, ஆனால் `வகுப்பிற்கான வண்ணத்தை மாற்றுவது` கூறுக்கு` அதை மாற்றாது.
uk: Gaphor стилізує тільки ті елементи, які є в моделі, тому ви повинні чітко вказувати їхні імена. Наприклад: `Component` успадковує від `Class` в UML-моделі, але зміна кольору для `Class` не змінює його для `Component`.

source: If you hover over a button the toolbox (bottom-left section), a popup will appear with the item's name and a shortcut. As a general rule, you can use the component name, glued together as the name in the stylesheet. A *Component* can be addressed as `component`, *Use Case* as `usecase`. The name matching is case insensitive. CSS names are written in lower case by default.
es: Si pasa el ratón por encima de un botón de la caja de herramientas (sección inferior izquierda), aparecerá una ventana emergente con el nombre del elemento y un acceso directo. Como regla general, puede usar el nombre del componente, pegado como el nombre en la hoja de estilos. Un *Componente* puede ser direccionado como `component`, *Caso de uso* como `usecase`. La coincidencia de nombres es insensible a mayúsculas y minúsculas. Los nombres CSS se escriben en minúsculas por defecto.
fr: Si vous survolez un bouton de la boîte à outils (dans la section inférieure gauche), une fenêtre contextuelle apparaîtra avec le nom de l'élément et un raccourci. En règle générale, vous pouvez utiliser le nom du composant, qui doit être collé ensemble, comme le nom dans la feuille de style. Vous pouvez adresser un *Composant* comme `component`ou un*Cas d'utilisation* comme `usecase`. La correspondance des noms est insensible à la casse. Les noms CSS sont écrits en minuscules par défaut.
ta: கருவிப்பெட்டி (கீழ்-இடது பிரிவு) நீங்கள் ஒரு பொத்தானை நோக்கிச் சென்றால், உருப்படியின் பெயர் மற்றும் குறுக்குவழியுடன் ஒரு பாப்அப் தோன்றும். ஒரு பொதுவான விதியாக, நீங்கள் கூறுகளின் பெயரைப் பயன்படுத்தலாம், இது ச்டைல்சீட்டில் பெயராக ஒன்றாக ஒட்டப்படுகிறது. A * கூறு * `component`, * வழக்கை *` usecase` எனக் குறிப்பிடலாம். பெயர் பொருத்தம் என்பது வழக்கு உணர்வற்றது. சிஎச்எச் பெயர்கள் இயல்புநிலையாகச் சிறிய விசயத்தில் எழுதப்பட்டுள்ளன.
uk: Якщо ви наведете вказівник миші на кнопку панелі інструментів (нижня ліва частина), з'явиться спливаюче вікно з назвою елемента та його ярликом. Як правило, ви можете використовувати назву компонента, склеєну з назвою у таблиці стилів. До *компонента* можна звертатися як до `component`, до *використовуваного регістру* - як до `usecase`. Відповідність імен не залежить від регістру. За замовчуванням імена CSS пишуться у нижньому регістрі.

source: However, since the CSS element names are derived from names used within Gaphor, there are a few exceptions.
es: Sin embargo, como los nombres de los elementos CSS se derivan de los nombres usados en Gaphor, hay algunas excepciones.
fr: Cependant, comme les noms des éléments CSS sont dérivés des noms utilisés dans Gaphor, il y a quelques exceptions.
ta: இருப்பினும், சிஎச்எச் உறுப்பு பெயர்கள் காஃபருக்குள் பயன்படுத்தப்படும் பெயர்களிடமிருந்து பெறப்பட்டவை என்பதால், சில விதிவிலக்குகள் உள்ளன.
uk: Однак, оскільки імена елементів CSS походять від імен, які використовуються в Gaphor, є кілька винятків.

source: Profile
es: Perfil
ta: சுயவிவரம்
uk: Профіль

source: Group
es: Grupo
fr: Groupe
ta: குழு
uk: Група

source: Element
es: Elemento
fr: Élément
ta: தனிமம்
uk: Елемент

source: CSS element
es: Elemento CSS
fr: Élément CSS
ta: சிஎச்எச் உறுப்பு
uk: елемент CSS

source: *element name*
es: *nombre del elemento*
fr: *nom de l'élément*
ta: *உறுப்பு பெயர்*
uk: *назва елемента*

source: element name without spaces
es: nombre del elemento sin espacios
fr: nom de l'élément sans espace
ta: இடைவெளிகள் இல்லாத உறுப்பு பெயர்
uk: назва елемента без пробілів

source: E.g. ``class``, ``usecase``.
es: P. ej. ``class``, ``usecase``.
fr: Par exemple, ``class``, ``usecase``.
ta: எ.கா. ``class``, ``usecase``.
uk: наприклад ``клас``, ``випадок``.

source: UML
ta: ஒகுமொ

source: Classes
es: Clases
ta: வகுப்புகள்
uk: Заняття

source: all Association's
es: Todas las asociaciones
fr: toutes les associations
ta: அனைத்து சங்கங்கள்
uk: всі Асоціації

source: Components
es: Componentes
fr: Composants
ta: கூறுகள்
uk: Компоненти

source: Device/Node
es: Dispositivo/Nodo
fr: Dispositif/Nœud
ta: சாதனம்/முனை
uk: Пристрій/вузол

source: Actions
es: Acciones
ta: செயல்கள்
uk: Дії

source: Decision/Merge Node
es: Nodo de decisión/fusión
fr: Décision/Fusion de Nœud
ta: முடிவு/ஒன்றிணைத்தல் முனை
uk: Вузол рішення/злиття

source: Fork/Join Node
es: Nodo de bifurcación/unión
fr: Fork/Joindre Nœud
ta: முட்கரண்டி/சேர முனை
uk: Розгалуження/Вузол приєднання

source: Swimlane
es: Carril
fr: Couloir d'activité (Swimlane)
ta: நீச்சல்
uk: Свімлане

source: Interactions
es: Interacciones
ta: இடைவினைகள்
uk: Взаємодії

source: Reflexive message
es: mensaje reflexivo
fr: Message réflexif
ta: பிரதிபலிப்பு செய்தி
uk: Рефлексивне повідомлення

source: States
es: Estados
fr: États
ta: மாநிலங்கள்
uk: Держави

source: Initial Pseudostate
es: Pseudoestado inicial
fr: Pseudo-état initial
ta: ஆரம்ப போலிநிலை
uk: Початковий псевдостан

source: ``pseudostate``
ta: ``psuedostate``

source: History Pseudostate
es: Pseudoestado de historia
fr: Histoique Pseudo-État
ta: வரலாறு சூடோச்டேட்
uk: Історія Псевдодержава

source: Profiles
es: Perfiles
ta: தன்விவரங்கள்
uk: Профілі

source: Metaclass
es: Metaclase
fr: Métaclasse
ta: உருவகவகுப்பு
uk: Метаклас

source: C4 Model
es: Modelo C4
fr: Modèle C4
ta: சி4 மாதிரி
uk: Модель C4

source: Person
es: Persona
fr: Personne
ta: ஆள்
uk: Особа

source: Software System
es: Sistema informático
fr: Système logiciel
ta: மென்பொருள் அமைப்பு
uk: Програмна система

source: ``c4container[type="Software System"]``
ta: ``c4container[type="மென்பொருள் அமைப்பு"]``

source: Component
es: Componente
fr: Composant
ta: கூறு
uk: Компонент

source: ``c4container[type="Component"]``
ta: ``c4container[type="கூறு"]``

source: Container
es: Contenedor
fr: Conteneur
ta: சரக்குப் பெட்டகம்
uk: Контейнер

source: ``c4container[type="Container"]``
ta: ``c4container[type="கொள்கலன்"]``

source: Container: Database
es: Contenedor: Base de datos
fr: Conteneur : Base de données
ta: கொள்கலன்: தரவுத்தளம்
uk: Контейнер: база даних

source: SysML
ta: முறைமைமமொ

source: ValueType
es: ValorTipo
fr: Type de valeur
ta: மதிப்புவகை

source: Primitive
es: Primitivo
ta: தொடக்கநிலை
uk: Примітивний

source: Derive Requirement
es: Derivación de requisitos
fr: Exigence dérivée
ta: பெறப்பட்ட தேவை
uk: Вивести вимогу

source: RAAML
ta: ராகுமொ

source: FTA
ta: எப்டிஎ

source: any AND/OR/… Gate
es: cualquier puerta AND/OR/…
fr: Porte...toute/ET/OU
ta: ஏதேனும் மற்றும்/அல்லது/… வாயில்
uk: будь-який І/АБО/… ворота

source: ``and``, ``or``, etc.
ta: ``and``, ``or``, முதலியன.

source: Ideas
fr: Idées
ta: சிந்தனைகள்
uk: Ідеї

source: Here are some ideas that go just beyond changing a color or a font. With the following examples we dig in to Gaphor's model structure to reveal more information to the users.
es: He aquí algunas ideas que van más allá de cambiar un color o un tipo de letra. Con los siguientes ejemplos profundizamos en la estructura del modelo de Gaphor para revelar más información a los usuarios.
fr: Voici quelques idées qui vont au-delà du changement de couleur ou de police. Les exemples suivants nous permettent d'approfondir la structure du modèle de Gaphor afin de révéler davantage d'informations aux utilisateurs.
ta: ஒரு வண்ணம் அல்லது எழுத்துருவை மாற்றுவதற்கு அப்பாற்பட்ட சில சிந்தனைகள் இங்கே. பயனர்களுக்கு கூடுதல் தகவல்களை வெளிப்படுத்த பின்வரும் எடுத்துக்காட்டுகளுடன், காஃபரின் மாதிரி கட்டமைப்பை நாங்கள் தோண்டி எடுக்கிறோம்.
uk: Ось кілька ідей, які виходять за межі зміни кольору чи шрифту. За допомогою наступних прикладів ми заглибимося в структуру моделі Gaphor, щоб відкрити користувачам більше інформації.

source: To create your own expression you may want to use the Console (![Menu icon](images/open-menu-symbolic.svg) → Tools → Console). Drop us a line on [Gitter](https://gitter.im/gaphor/Lobby) and we would be happy to help you.
fr: Pour créer votre propre expression, vous pouvez utiliser la console ( ![Menu icon](images/open-menu-symbolic.svg) → Tools → Console). Envoyez-nous un message sur [Gitter](https://gitter.im/gaphor/Lobby) et nous serons heureux de vous aider.
ta: உங்கள் சொந்த வெளிப்பாட்டை உருவாக்க நீங்கள் கன்சோலைப் பயன்படுத்த விரும்பலாம் (![மெனு ஐகான்](images/open-menu-symbolic.svg) → கருவிகள் → கன்சோல்). [Gitter](https://gitter.im/gaphor/lobby) இல் ஒரு வரியை எங்களுக்கு விடுங்கள், நாங்கள் உங்களுக்கு உதவ மகிழ்ச்சியாக இருப்போம்.
uk: Щоб створити власний вираз, ви можете скористатися консоллю (![Іконка меню](images/open-menu-symbolic.svg) → Інструменти → Консоль). Напишіть нам на [Gitter](https://gitter.im/gaphor/Lobby), і ми будемо раді допомогти вам.

source: The drafts package
es: El paquete de borradores
fr: Le paquet de projets
ta: வரைவுகள் தொகுப்பு
uk: Пакет чернеток

source: All diagrams in the package "Drafts" should be drawn using sloppy lines:
es: Todos los diagramas del paquete "Borradores" deben dibujarse con líneas poco definidas:
fr: Tous les diagrammes du paquet « Drafts » doivent être dessinés en utilisant des lignes négligées :
ta: "வரைவுகள்" என்ற தொகுப்பில் உள்ள அனைத்து வரைபடங்களும் சேறும் சகதியுமான வரிகளைப் பயன்படுத்தி வரையப்பட வேண்டும்:
uk: Всі схеми в пакеті «Чернетки» повинні бути намальовані неакуратними лініями:

source: draft style
es: estilo borrador
fr: style brouillon
ta: வரைவு நடை
uk: чернетковий стиль

source: Wrap long attributes, operations, and stereotype values
fr: Envelopper les attributs longs, les opérations et les valeurs des stéréotypes
ta: நீண்ட பண்புக்கூறுகள், செயல்பாடுகள் மற்றும் ச்டீரியோடைப் மதிப்புகளை மடிக்கவும்
uk: Обгортання довгих атрибутів, операцій і стереотипних значень

source: Sometimes attribute values get a bit lengthy. By default, Gaphor will not wrap text. If you want to, you can add this little snippet to wrap text for lengthy attributes on classes. You can also apply this to other types, of course.
fr: Les valeurs des attributs sont parfois un peu longues. Par défaut, Gaphor n'enveloppe pas le texte. Si vous le souhaitez, vous pouvez ajouter ce petit extrait pour envelopper le texte des attributs longs des classes. Vous pouvez bien sûr également l'appliquer à d'autres types.
ta: சில நேரங்களில் பண்புக்கூறு மதிப்புகள் கொஞ்சம் நீளமாகப் பெறுகின்றன. இயல்பாக, காஃபர் உரையை மடிக்காது. நீங்கள் விரும்பினால், வகுப்புகளில் நீண்ட பண்புகளுக்கு உரையை மடிக்க இந்த சிறிய துணுக்குகளைச் சேர்க்கலாம். இதை நீங்கள் மற்ற வகைகளுக்கும் பயன்படுத்தலாம்.
uk: Іноді значення атрибутів можуть бути довгими. За замовчуванням Gaphor не обгортає текст. Якщо ви хочете, ви можете додати цей невеликий фрагмент, щоб обернути текст для довгих атрибутів у класах. Звісно, ви також можете застосувати його до інших типів.

source: wrap long attribute
fr: attribut long enveloppant
ta: நீண்ட பண்புக்கூறு
uk: довгий атрибут wrap

source: Unconnected relationships
es: Relaciones inconexas
fr: Relations non connectées
ta: இணைக்கப்படாத உறவுகள்
uk: Беззв'язкові відносини

source: All items on a diagram that are not backed by a model element, should be drawn in a dark red color. This can be used to spot not-so-well connected relationships, such as Generalization, Implementation, and Dependency. These items will only be backed by a model element once you connect both line ends. This rule will exclude simple elements, like lines and boxes, which will never have a backing model element.
es: Todos los elementos de un diagrama que no estén respaldados por un elemento del modelo deben dibujarse en color rojo oscuro. Esto se puede usar para detectar relaciones no muy bien conectadas, como Generalización, Implementación y Dependencia. Estos elementos sólo estarán respaldados por un elemento del modelo una vez que conecte ambos extremos de la línea. Esta regla excluirá elementos simples, como líneas y cajas, que nunca tendrán un elemento modelo de respaldo.
fr: Tous les éléments d'un diagramme qui ne sont pas soutenus par un élément du modèle doivent être dessinés en rouge foncé. Cela permet de repérer les relations mal connectées, telles que la généralisation, l'implémentation et la dépendance. Ces éléments ne seront soutenus par un élément de modèle que lorsque les deux extrémités de la ligne seront connectées. Cette règle exclut les éléments simples, tels que les lignes et les boîtes, qui ne sont jamais soutenus par un élément de modèle.
ta: ஒரு மாதிரி உறுப்பால் ஆதரிக்கப்படாத வரைபடத்தில் உள்ள அனைத்து உருப்படிகளும் அடர் சிவப்பு நிறத்தில் வரையப்பட வேண்டும். பொதுமைப்படுத்தல், செயல்படுத்தல் மற்றும் சார்பு போன்ற இணைக்கப்பட்ட உறவுகளைக் கண்டறிய இது பயன்படுத்தப்படலாம். இரண்டு வரி முனைகளையும் இணைத்தவுடன் மட்டுமே இந்த உருப்படிகள் ஒரு மாதிரி உறுப்பு மூலம் ஆதரிக்கப்படும். இந்த விதி கோடுகள் மற்றும் பெட்டிகள் போன்ற எளிய கூறுகளை விலக்கும், இது ஒருபோதும் பின்னணி மாதிரி உறுப்பு இருக்காது.
uk: Всі елементи на діаграмі, які не підкріплені елементами моделі, повинні бути намальовані темно-червоним кольором. Це може бути використано для виявлення не дуже добре пов'язаних зв'язків, таких як Узагальнення, Реалізація та Залежність. Ці елементи будуть підкріплені елементом моделі лише після того, як ви з'єднаєте обидва кінці лінії. Це правило виключає прості елементи, такі як лінії та рамки, які ніколи не матимуть підкріплення у вигляді елемента моделі.

source: unconnected relationship
es: relación inconexa
fr: relation sans lien
ta: இணைக்கப்படாத உறவு
uk: безсполучникові відносини

source: Navigable associations
es: Asociaciones navegables
fr: Associations navigables
ta: செல்லக்கூடிய சங்கங்கள்
uk: Судноплавні асоціації

source: An example of how to apply a style to a navigable association is to color an association blue if neither of the ends are navigable. This color could act as a validation rule for a model where at least one end of each association should be navigable. This is actually the case for the model file used to create Gaphor's data model.
es: Un ejemplo de cómo aplicar un estilo a una asociación navegable es colorear de azul una asociación si ninguno de sus extremos es navegable. Este color podría actuar como una regla de validación para un modelo en el que al menos un extremo de cada asociación debe ser navegable. Este es el caso del fichero modelo usado para crear el modelo de datos de Gaphor.
fr: Un exemple d'application d'un style à une association navigable consiste à la colorer en bleu si aucune de ses extrémités n'est navigable. Cette couleur pourrait servir de règle de validation pour un modèle dans lequel au moins une extrémité de chaque association doit être navigable. C'est d'ailleurs le cas pour le fichier de modèle utilisé pour créer le modèle de données de Gaphor.
ta: ஒரு செல்லக்கூடிய சங்கத்திற்கு ஒரு பாணியை எவ்வாறு பயன்படுத்துவது என்பதற்கான எடுத்துக்காட்டு, எந்தவொரு முனைகளும் செல்லமுடியாது என்றால் ஒரு சங்க நீல நிறத்தை வண்ணமயமாக்குவது. இந்த வண்ணம் ஒரு மாதிரிக்கான சரிபார்ப்பு விதியாக செயல்படக்கூடும், அங்கு ஒவ்வொரு சங்கத்தின் குறைந்தது ஒரு முனையாவது செல்லக்கூடியதாக இருக்க வேண்டும். காஃபரின் தரவு மாதிரியை உருவாக்கப் பயன்படுத்தப்படும் மாதிரி கோப்பிற்கு இது உண்மையில் பொருந்தும்.
uk: Прикладом застосування стилю до навігаційної асоціації є забарвлення асоціації синім кольором, якщо жоден з її кінців не є навігаційним. Цей колір може діяти як правило перевірки для моделі, де принаймні один кінець кожної асоціації має бути навігаційним. Це, власне, і відбувається у файлі моделі, що використовується для створення моделі даних Gaphor.

source: navigable association
es: asociación navegable
fr: association navigable
ta: செல்லக்கூடிய சங்கம்
uk: судноплавна асоціація

source: Solid Control Flow lines
es: Líneas sólidas de flujo de control
fr: lignes Flux de Contrôle Solide
ta: திட கட்டுப்பாட்டு ஓட்ட கோடுகள்
uk: Лінії Solid Control Flow

source: In Gaphor, Control Flow lines follow the SysML styling: dashed. If you want, or need to strictly follow the official UML specifications, you can simply make those solid lines.
es: En Gaphor, las líneas de flujo de control siguen el estilo SysML: discontinuas. Si desea, o necesita seguir estrictamente las especificaciones oficiales UML, puede simplemente hacer esas líneas sólidas.
fr: Dans Gaphor, les lignes de Flux de Contrôle suivent le style SysML : en pointillés. Si vous voulez ou devez suivre strictement les spécifications officielles d'UML, vous pouvez simplement créer des lignes pleines.
ta: Gaphor இல், கட்டுப்பாட்டு ஓட்டக் கோடுகள் SysML ச்டைலிங்: கோடு. நீங்கள் விரும்பினால், அல்லது அதிகாரப்பூர்வ யுஎம்எல் விவரக்குறிப்புகளை கண்டிப்பாக பின்பற்ற வேண்டும் என்றால், நீங்கள் அந்த திடமான வரிகளை உருவாக்கலாம்.
uk: У Gaphor лінії Control Flow відповідають стилю SysML: пунктирні. Якщо ви бажаєте або маєте суворо дотримуватися офіційних специфікацій UML, ви можете просто зробити ці суцільні лінії.

source: control flow
es: flujo de control
fr: flux de contrôle
ta: கட்டுப்பாட்டு ஓட்டம்
uk: керування потоком

source: Todo note highlight
es: Nota destacada
fr: Mise en évidence de la note de service
ta: செய்யவேண்டிய குறிப்பு சிறப்பம்சமாக
uk: Усі виділення нот
